{"title": "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/index.html", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 12:44:51 GMT", "fetched_at": "2025-12-23 14:27:33.271814"}
{"title": "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/h_8d51e3ae2714edaa0dace837305d03b8", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "2025-12-23 14:27:33.271818", "fetched_at": "2025-12-23 14:27:33.271821"}
{"title": "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory", "link": "https://www.cnn.com/2023/04/17/media/dominion-fox-news-allegations/index.html", "description": "• Fox-Dominion trial delay 'is not unusual,' judge says\n• Fox News' defamation battle isn't stopping Trump's election lies", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Mon, 17 Apr 2023 16:01:11 GMT", "fetched_at": "2025-12-23 14:27:33.271826"}
{"title": "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'", "link": "https://www.cnn.com/2023/04/18/media/fox-dominion-settlement/index.html", "description": "The judge just announced in court that a settlement has been reached in the historic defamation case between Fox News and Dominion Voting Systems.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 08:28:17 GMT", "fetched_at": "2025-12-23 14:27:33.271832"}
{"title": "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement", "link": "https://www.cnn.com/videos/politics/2023/04/18/jake-tapper-dominion-lawsuit-settlement-fox-news-statement-lead-vpx.cnn", "description": "A settlement has been reached in Dominion Voting Systems' defamation case against Fox News, the judge for the case announced. The network will pay more than $787 million to Dominion, a lawyer for the company said.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Tue, 18 Apr 2023 21:17:44 GMT", "fetched_at": "2025-12-23 14:27:33.271838"}
{"title": "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/index.html", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 12:44:51 GMT", "fetched_at": "2025-12-23 14:31:55.018968"}
{"title": "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/h_8d51e3ae2714edaa0dace837305d03b8", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "2025-12-23 14:31:55.018974", "fetched_at": "2025-12-23 14:31:55.018976"}
{"title": "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory", "link": "https://www.cnn.com/2023/04/17/media/dominion-fox-news-allegations/index.html", "description": "• Fox-Dominion trial delay 'is not unusual,' judge says\n• Fox News' defamation battle isn't stopping Trump's election lies", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Mon, 17 Apr 2023 16:01:11 GMT", "fetched_at": "2025-12-23 14:31:55.018982"}
{"title": "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'", "link": "https://www.cnn.com/2023/04/18/media/fox-dominion-settlement/index.html", "description": "The judge just announced in court that a settlement has been reached in the historic defamation case between Fox News and Dominion Voting Systems.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 08:28:17 GMT", "fetched_at": "2025-12-23 14:31:55.018988"}
{"title": "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement", "link": "https://www.cnn.com/videos/politics/2023/04/18/jake-tapper-dominion-lawsuit-settlement-fox-news-statement-lead-vpx.cnn", "description": "A settlement has been reached in Dominion Voting Systems' defamation case against Fox News, the judge for the case announced. The network will pay more than $787 million to Dominion, a lawyer for the company said.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Tue, 18 Apr 2023 21:17:44 GMT", "fetched_at": "2025-12-23 14:31:55.018993"}
{"title": "Three killed after Russia launches 'massive' attack across Ukraine", "link": "https://www.bbc.com/news/articles/cr4d99p63y4o?at_medium=RSS&at_campaign=rss", "summary": "Several regions are without power after missile and drone strikes targeted several cities.", "content": "Three killed after Russia launches 'massive' attack across Ukraine\n\n30 minutes ago Share Save Alex Smith and Mohamed Madi , Kyiv Share Save\n\nWatch: BBC correspondent at the scene of Kyiv drone attack\n\nRussia carried out a \"massive\" overnight attack on several Ukrainian cities, President Volodymyr Zelensky has said, a day after he warned of strikes over the Christmas period. At least three people were killed, according to Ukrainian officials, including a four-year-old child, while energy infrastructure was also targeted, leaving several regions without power. Russia launched 635 drones and 38 missiles, Ukraine's air force said, adding that 621 of them were downed. Zelensky said \"people simply want to be with their families, at home, and safe\" in the run-up to Christmas, and said the strikes sent \"an extremely clear signal about Russia's priorities\" despite ongoing peace talks.\n\nHe added that Russian President Vladimir Putin \"still cannot accept that he must stop killing. And that means that the world is not putting enough pressure on Russia\". Zelensky had previously warned it was in the Kremlin's \"nature\" to \"carry out massive attacks\" during the festive period. Russia launched a full-scale invasion of Ukraine in February 2022, and Moscow currently controls about 20% of Ukrainian territory.\n\nLocal authorities in the central Zhytomyr region confirmed a child's death. Regional head Vitaly Bunechko said the child \"was taken to hospital, doctors fought for (the child's) life but could not save (the child) in the end\". Five others were injured in the strike, he added. Meanwhile, a 76-year-old woman was killed and three people injured when a house in the Kyiv region was struck, according to Ukraine's state emergencies service. An attack in Khmelnytskyy, western Ukraine, killed a 72-year-old, regional administration head Serhiy Tyurin said. Polish fighter jets were scrambled in response to missiles and drones targeting west Ukraine. The Russian defence ministry said it had targeted Ukrainian \"military-industrial complex plants and supporting energy facilities\". It added that all the designated targets had been hit. Meanwhile, Ukraine reportedly struck a petrochemical plant in Stravropol, southern Russia. Videos shared by Russian media channels online showed large flames rising from the direction of the plant. The region's governor, Vladimir Vladimirov, said a Ukrainian drone hit the plant and sparked a fire. No casualties were reported and residential buildings were left undamaged.\n\nReuters Emergency responders work at the site of a Russian drone strike on an apartment building in the Ukrainian capital\n\nWith temperatures expected to fall to as low as -7C on Wednesday, Ukraine's energy operator warned of emergency power shutdowns \"in all regions\" and urged people to use energy \"sparingly\". Acting energy minister Artem Nekrasov said it was the ninth large attack on Ukraine's energy system this year, and that supply in the Rivne, Ternopil and Khmelnytsky regions has been \"almost completely\" lost. Ukrainian MP Oleksandr Merezhko told the BBC World Service that some areas could be without power \"for days\". The main focus of Russian attacks in recent days has been the southern port city of Odesa, which comes after Vladimir Putin threatened to sever Ukraine's access to the Black Sea. The Russian president made the threat in retaliation for Ukrainian drone attacks on tankers belonging to Russia's \"shadow fleet\", vessels used to move goods including oil which are under Western sanctions.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 14:11:18 GMT", "fetched_at": "2025-12-23T14:42:57.119660"}
{"title": "'A miracle': Officer shot in head during Bondi attack home from hospital", "link": "https://www.bbc.com/news/articles/cd0kxrr2jyko?at_medium=RSS&at_campaign=rss", "summary": "The Christmas homecoming of Jack Hibbert, who was shot in the head and shoulder, is a \"miracle\", his family say.", "content": "'A miracle': Officer shot in head during Bondi attack home from hospital\n\n9 hours ago Share Save Yang Tian Sydney Share Save\n\nPA Media Jack Hibbert had been working as a police officer for just months before he was shot\n\nA young police officer who was shot in the head during the Bondi Beach attack has been released from hospital. Probationary Constable Jack Hibbert - who is just four months into the job - was patrolling a Hanukkah event when two gunmen opened fire, injuring over 40 people and killing 15. The 22-year-old, who was also hit in the shoulder, has lost vision in one of his eyes but is now recovering at home, his family confirmed in a statement. \"As a family, we couldn't ask for anything more - having our Jack home, especially for Christmas, truly feels like a miracle.\"\n\nThey thanked the public for their \"overwhelming support\" and praised medical staff for their \"exceptional\" care and dedication. \"While he is home, he is still recovering and will need space, support, and continued positive thoughts during this time,\" the statement added. Even after he was shot during the attack, Constable Hibbert continued to help festival attendees until he physically could no longer do so, his family previously said. \"Many of his colleagues who were present on the night of the incident have visited in hospital and given testaments to Jack's bravery during the incident... They described how Jack acted, he moved toward people in need, not away from danger,\" they said. He was one of two police officers injured in the shooting, with the second officer Constable Scott Dyson, 25, still recovering from his injuries in hospital, according to the last police update.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 06:06:34 GMT", "fetched_at": "2025-12-23T14:42:57.255092"}
{"title": "Trump says US will keep or sell oil seized from Venezuela", "link": "https://www.bbc.com/news/articles/c87lnn09yj8o?at_medium=RSS&at_campaign=rss", "summary": "The US president also says the US intends to keep the tankers it has intercepted off the coast of Venezuela.", "content": "Trump says US will keep or sell oil seized from Venezuela\n\n5 hours ago Share Save Rachel Hagan Share Save\n\nANDREW CABALLERO-REYNOLDS / AFP/ Getty Images\n\nDonald Trump has said the US will keep or sell the crude oil contained on tankers it has seized off the coast of Venezuela, as well as the vessels themselves. The US president's comments came as Washington continues to pressure the South American country's leader Nicolás Maduro to stand down. Speaking to reporters in Florida on Monday, Trump said of the oil \"we're going to keep it\", adding: \"Maybe we will sell it, maybe we will keep it. Maybe we'll use it in the Strategic Reserves. We're keeping the ships also.\" The Trump administration has accused Venezuela of using oil revenues to fund drug-related crime, while Caracas has condemned the seizures as \"piracy\".\n\nThe US military has seized two oil tankers this month, including one on Saturday. Trump issued his latest warning as the US Coast Guard continued to pursue a third oil tanker, which authorities described as part of a Venezuelan \"dark fleet\" used to evade US sanctions. \"It's moving along, and we'll end up getting it,\" Trump said. Separately on Monday, the US military said it carried out a strike on what it said was a suspected trafficking vessel in international waters in the eastern Pacific. US Southern Command said one person was killed.\n\nRos Atkins on… the oil tanker being pursued by the US", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 09:51:47 GMT", "fetched_at": "2025-12-23T14:42:57.387900"}
{"title": "Israel extends order allowing closure of foreign broadcasters", "link": "https://www.bbc.com/news/articles/c2k47wg2j90o?at_medium=RSS&at_campaign=rss", "summary": "A bill passed by parliament expands temporary powers introduced during the Gaza war to shutter outlets seen as a security threat.", "content": "Israel extends order allowing closure of foreign broadcasters\n\nAl Jazeera was forced to close its office in Ramallah, in the occupied West Bank, in September 2024\n\nOriginally dubbed the \"Al Jazeera Law\", the powers were used to shut down the Qatari-owned channel's offices and block its broadcasts in May 2024.\n\nIt allows the government for the next two years to cease operations of a foreign outlet even in peace time and without the need for a court order.\n\nThe legislation, passed by 22 votes to 10, expands temporary powers introduced during the Gaza war to shutter outlets seen as a threat to national security.\n\nIsrael's parliament has extended an order allowing the government to shut down foreign broadcasters operating in the country.\n\nIsrael accused Al Jazeera - which has been a strong critic of Israel's military campaign in Gaza - of anti-Israel bias and of supporting Hamas in its coverage.\n\nAl Jazeera denied the accusations and condemned Israel's actions, calling it a \"criminal act\" and an attack on press freedom.\n\nThe Association for Civil Rights in Israel (ACRI) said last year that the temporary order violated \"freedom of expression, the right to information and freedom of the press, and blocks citizens and residents from receiving a variety of information that does not fit the Israeli narrative or is not broadcast on Israeli media channels\".\n\nThe legislation extending the order was passed hours after the Israeli cabinet approved a plan to shut down Army Radio, or Galei Tzahal (GLZ), a state-funded station that is operated by the Israel Defense Forces (IDF) but is editorially independent.\n\nUnder the plan proposed by Defence Minister Israel Katz, the station will cease operations by 1 March 2026.\n\nKatz argued that Army Radio, which employs both active duty soldiers and civilians, \"no longer serves as a mouthpiece and ear for soldiers and broadcasts political and divisive content that is not in line with IDF values\".\n\nPrime Minister Benjamin Netanyahu told the cabinet meeting that a station broadcasting under the authority of the military was highly unusual.\n\n\"I think it exists in North Korea and maybe a few other countries, and we probably don't want to be counted among them,\" he said.\n\nThe Union of Journalists and Journalists' Organisations said they would petition the High Court of Justice against the decision, calling it \"a severe and unlawful infringement on freedom of expression and freedom of the press\".\n\nThe Israel Democracy Institute (IDI) think tank said shutting Army Radio constituted a serious violation of freedom of expression and effectively wiped out half of Israel's independent public radio news broadcasts.\n\n\"The decision to shut down a public media organisation is not an isolated move. It is part of a broader and worrying pattern of ongoing harm to Israeli democracy,\" it warned.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 11:55:57 GMT", "fetched_at": "2025-12-23T14:42:57.521126"}
{"title": "US regulator approves pill form of Wegovy weight-loss drug", "link": "https://www.bbc.com/news/articles/ce86le5dyxyo?at_medium=RSS&at_campaign=rss", "summary": "Wegovy becomes first pill of its kind to be approved, shifting weight-loss drugs beyond injections.", "content": "US regulator approves pill form of Wegovy weight-loss drug\n\nThe US Food and Drug Administration (FDA) has approved a pill version of the weight-loss drug Wegovy, according to pharmaceutical giant Novo Nordisk.\n\nIt is the first pill of its kind to receive approval from the regulator, marking a new era for weight-loss drugs.\n\nWegovy's Danish makers Novo Nordisk said the once-daily pill was a \"convenient option\" to the injectable and would provide the same weight loss as the shot. It comes after Wegovy was approved by the FDA specifically for weight loss.\n\nOthers like Ozempic, which has similar weight-loss effects, were primarily approved for the treatment of Type 2 diabetes.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 01:29:07 GMT", "fetched_at": "2025-12-23T14:42:57.649999"}
{"title": "Freed Nigerian schoolchildren to be reunited with families", "link": "https://www.theguardian.com/world/2025/dec/22/freed-nigerian-schoolchildren-set-to-be-reunited-with-families", "summary": "<p>Month-long ordeal ends but no details released on how they regained their freedom or who was behind abduction</p><p>A final group of 130 kidnapped Nigerian schoolchildren <a href=\"https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria\">freed by the government on Sunday</a> are expected to be reunited with their families in the central Niger state on Monday, ending a month-long ordeal that drew global concern.</p><p>Last month, unknown gunmen took hundreds of schoolchildren and 12 teachers from St Mary’s Catholic school, Papiri community in Niger state, which runs west from the capital, Abuja, to neighbouring Benin.</p> <a href=\"https://www.theguardian.com/world/2025/dec/22/freed-nigerian-schoolchildren-set-to-be-reunited-with-families\">Continue reading...</a>", "content": "A final group of 130 kidnapped Nigerian schoolchildren freed by the government on Sunday are expected to be reunited with their families in the central Niger state on Monday, ending a month-long ordeal that drew global concern.\n\nLast month, unknown gunmen took hundreds of schoolchildren and 12 teachers from St Mary’s Catholic school, Papiri community in Niger state, which runs west from the capital, Abuja, to neighbouring Benin.\n\nFifty children escaped not long after, and another 100 were released on 7 December.\n\n“Another 130 abducted Niger state pupils released, none left in captivity,” the presidential spokesperson Sunday Dare posted on X on Sunday.\n\nThe last group of children were reportedly released near Nigeria’s border with Benin but as with the previous release, there was no mention of how they regained freedom or what group was behind the abduction. Other details also remain unclear.\n\nKidnap-for-ransom abductions represent one angle of Nigeria’s multifaceted security crises. Gangs of armed bandits roam the vast countryside in the north, while jihadists operate with external support from surrounding areas in the Sahel. The abundance of non-state actors has left rural areas particularly vulnerable, and Nigeria’s under-equipped security agencies continue to be stretched.\n\nThe Papiri incident was the second mass abduction in the west African country in a week, and the second in Niger state in four years, after a May 2021 abduction of 135 pupils from an Islamic seminary. The most high-profile mass abduction remains the infamous 2014 kidnapping of more than 200 schoolgirls from the town of Chibok in north-east Nigeria, which spurred a global campaign supported by dozens of celebrities including Michelle Obama and Elton John.\n\nAccording to the Lagos-based geopolitical advisory SBM Intelligence, there were at least 4,722 victims of kidnappings across Nigeria between July 2024 and June 2025, with at least 762 people killed and about $1.66m paid as ransom in total.\n\nThe deteriorating security situation has led to the US president, Donald Trump, to threaten military action in Nigeria. The Trump administration has designated Nigeria as a country of particular concern, citing a “Christian genocide” – a framing that Abuja has repeatedly rejected as being an oversimplification of a complex crisis.\n\nReuters contributed to this report", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Mon, 22 Dec 2025 12:00:34 GMT", "fetched_at": "2025-12-23T14:42:57.907347"}
{"title": "Another 130 kidnapped schoolchildren released in Nigeria", "link": "https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria", "summary": "<p>Presidential spokesperson says all those abducted from a Catholic school in Niger state last month are now free</p><p>Nigerian authorities say they have secured the release of a further 130 schoolchildren kidnapped from a Catholic school in November, after <a href=\"https://www.theguardian.com/world/2025/dec/07/release-secured-of-100-kidnapped-nigerian-schoolchildren-but-many-still-being-held\">100 were freed earlier this month</a>.</p><p>“Another 130 abducted Niger state pupils released, none left in captivity,” presidential spokesperson Sunday Dare said on X, in a post accompanied by a photo of smiling children.</p> <a href=\"https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria\">Continue reading...</a>", "content": "Nigerian authorities say they have secured the release of a further 130 schoolchildren kidnapped from a Catholic school in November, after 100 were freed earlier this month.\n\n“Another 130 abducted Niger state pupils released, none left in captivity,” presidential spokesperson Sunday Dare said on X, in a post accompanied by a photo of smiling children.\n\nIn late November, gunmen kidnapped hundreds of students and staff from St Mary’s co-educational boarding school in the country’s north-central Niger state.\n\nNigeria has recently seen a new wave of mass abductions, reminiscent of the kidnapping of schoolgirls in the town of Chibok by the militant group Boko Haram in 2014.\n\nA UN source said the remaining schoolchildren would be taken to Minna, the capital of Niger state, on Tuesday.\n\nView image in fullscreen The exact number of students and staff kidnapped from St Mary’s school remains unclear. Photograph: Afolabi Sotunde/EPA\n\nThe exact number of people taken and how many have remained in captivity has been unclear since the kidnapping in the rural hamlet of Papiri.\n\nThe Christian Association of Nigeria (CAN) said that a total of 315 students and staff were kidnapped. Some 50 escaped immediately afterwards, and on 7 December the government secured the release of about 100 more.\n\nA statement from President Bola Tinubu then put the number of people still being held at 115 – about 50 fewer than the initial CAN figure would suggest.\n\nIt has not been made public who seized the children, or how the government secured their release.\n\nThough kidnappings for ransom are a common way for criminals and armed groups to make money, a spate of mass abductions in Nigeria has put an uncomfortable spotlight on the country’s already grim security situation.\n\nIn November, assailants kidnapped two dozen Muslim schoolgirls, 38 church worshippers and a bride and her bridesmaids, with male farm workers, women and children also taken hostage.\n\nThe kidnappings come as Nigeria faces a diplomatic offensive from the United States, where President Donald Trump has alleged that mass killings of Christians in the west African country amount to a “genocide”.\n\nThe Nigerian government and independent analysts reject that framing, which has long been used by the Christian right in the US and Europe.\n\nThe religiously diverse country of 230 million people has myriad security concerns, from jihadists in the north-east to armed “bandit” gangs in the north-west, and its multiple conflicts have seen Christians and Muslims killed.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 20:05:09 GMT", "fetched_at": "2025-12-23T14:42:58.007511"}
{"title": "Manchester Museum seeks help to uncover hidden histories of African collection", "link": "https://www.theguardian.com/uk-news/2025/dec/21/manchester-museum-uncover-hidden-histories-africa-hub", "summary": "<p>New Africa Hub confronts colonial-era silences by asking visitors to share insights on 40,000 objects</p><p>It’s a rare thing for a museum to talk about what it doesn’t know. But unanswered questions and archival silences are at the heart of the new Africa Hub at Manchester Museum, north-west England, which is inviting people around the world to help fill the gaps.</p><p>The museum holds more than 40,000 items from across Africa, many of which were traded, collected, looted or preserved during the era of the British empire.</p> <a href=\"https://www.theguardian.com/uk-news/2025/dec/21/manchester-museum-uncover-hidden-histories-africa-hub\">Continue reading...</a>", "content": "It’s a rare thing for a museum to talk about what it doesn’t know. But unanswered questions and archival silences are at the heart of the new Africa Hub at Manchester Museum, north-west England, which is inviting people around the world to help fill the gaps.\n\nThe museum holds more than 40,000 items from across Africa, many of which were traded, collected, looted or preserved during the era of the British empire.\n\nAs a result, the names of makers, the cultural significance of objects and the people to which they once belonged are largely unknown to curators in Manchester; in many cases, only the name of the donor or the collection from which an item came is recorded.\n\nThe new Africa Hub will display “beautifully crafted” items that have been in storage for years, the museum says.\n\nView image in fullscreen A view of a carved wooden figure, one of the objects at Manchester Museum. Photograph: Manchester Museum/Reuters\n\nIt is inviting visitors to the collections on Oxford Road, in the city’s university district, as well as those exploring the collections online, to share stories about the objects’ provenance.\n\nCurators say this could lead to the restitution of items, as well as new partnerships in the African diaspora. And community collaboration has already begun. A display at the heart of Africa Hub draws on the knowledge of Manchester’s Igbo community, one of the oldest Nigerian diaspora communities in the UK.\n\nLucy Edematie, the curator of African collections from colonial contexts at Manchester Museum, worked with the Igbo Community Greater Manchester (ICM) organisation to research objects and celebrate Igbo heritage.\n\nSylvia Mgbeahurike, the vice-chair of ICM Women, said: “Some of these objects were given, some were stolen, some were taken forcefully out of conquest. It is important that we start bringing them together again. It shows inclusiveness. It shows there is strength in diversity. It shows we are one people, irrespective of our colour or where we are from.”\n\nEdematie said: “Unlike most galleries or exhibitions, which represent the culmination of years of research and collaboration, Africa Hub is the beginning. It builds on work the museum has already been doing to engage with both diasporic communities and communities in Africa but provides an opportunity to extend this even further.\n\n“It is a chance to do our thinking in public, with honesty and transparency, and to involve people in that process from the start.”\n\nThe museum says the Africa Hub will be an “evolving space for reflection, dialogue and shared learning and its future direction will be shaped by public contribution”.\n\nView image in fullscreen The objects from across Africa include animals, cultural heritage items, minerals and plants. Photograph: Manchester Museum\n\nA spokesperson added: “We’re supposed to know everything there is to know about the collections we care for, ready to communicate the wisdom of the world through a series of carefully written object labels.\n\n“Well, sometimes the reality is slightly different. And, on this occasion, we need your help, as visitors and communities, to uncover the stories that museum records cannot tell or have suppressed.\n\n“Mostly, Africa Hub means being honest about what we don’t know. Manchester Museum holds over 40,000 objects from across Africa, cultural heritage items, plants, animals and minerals … much of their story remains untold.\n\n“We’re laying our lack of knowledge bare and extending an invitation to you, to come and view these collections, either in person or online, and share your own knowledge, experience and perspectives to create richer narratives.”", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 15:00:01 GMT", "fetched_at": "2025-12-23T14:42:58.134892"}
{"title": "Sweden and Germany slash aid budgets to focus on Ukraine and defence spending", "link": "https://www.theguardian.com/global-development/2025/dec/21/sweden-and-germany-slash-aid-budgets-to-focus-on-ukraine-and-defence-spending", "summary": "<p>Echoing the dismantling of USAID, other countries are changing funding priorities and health and hunger programmes in Africa will lose out </p><p>The notion of humanitarian aid being used to combat poverty and hunger is being replaced in Europe with geopolitical “games” as states redirect aid to Ukraine and to defence spending, analysts warn after recent announcements by Sweden and Germany.</p><p>Earlier this year, humanitarian groups called for European donors to fill the gap as President Donald Trump dismantled the USAID programme, but instead other nations are further pulling back from their commitments around the world.</p> <a href=\"https://www.theguardian.com/global-development/2025/dec/21/sweden-and-germany-slash-aid-budgets-to-focus-on-ukraine-and-defence-spending\">Continue reading...</a>", "content": "The notion of humanitarian aid being used to combat poverty and hunger is being replaced in Europe with geopolitical “games” as states redirect aid to Ukraine and to defence spending, analysts warn after recent announcements by Sweden and Germany.\n\nEarlier this year, humanitarian groups called for European donors to fill the gap as President Donald Trump dismantled the USAID programme, but instead other nations are further pulling back from their commitments around the world.\n\nIn December, Sweden announced a 10bn kronor (£800m) cut in development funding to Mozambique, Zimbabwe, Liberia, Tanzania and Bolivia. Germany’s humanitarian budget of €1.05bn (£920m) for 2026 will be less than half of last year’s, with spending refocused on areas deemed a priority to Europe.\n\n“I think we are losing a consensus of solidarity and responsibility which has been established for a while now,” said Ralf Südhoff, director of the Berlin-based Centre for Humanitarian Action.\n\n“Germany this year has started to phase out Latin America, decreased engagement in Asia and say they want to focus now on crises which have an impact on Europe,” he said, noting that while Ukraine was in need of funding because of Russia’s invasion, its location in Europe meant it was saved from the cuts developing countries have experienced.\n\nThe UK also announced earlier this year that it would be cutting aid to fund defence spending. Norway has increased its civilian support to Ukraine by 2.5bn kroner (£185m), to a quarter of its aid budget, but has been accused of making Africa pay for that rise with a 355m kroner cut (£26m).\n\nFrance’s budget for 2026 will also see a €700m cut to aid spending, with a 60% reduction in food aid, while increasing defence spending by €6.7bn.\n\n“It’s a broader geopolitical trend and there’s a misleading belief by European actors that they have to play this game now in the same way as Moscow, Beijing, Washington,” said Südhoff, suggesting aid will be more “transactional” and directed to where donors see direct benefits for themselves. “The reaction now is not to fill the gap or attempt to do so but to follow the [American] cuts.”\n\nAnalysis of Germany’s 2026 aid budget by Venro, a coalition of German NGOs, shows that the country is slashing funding to traditional development and poverty-reduction programmes, with a 20% cut for the World Food Programme and 33% for the Gavi vaccine alliance.\n\nOne of the few elements of the budget not cut is Germany’s partnerships with the private sector in developing countries.\n\nAnita Kattakuzhy, director of policy at Near, a coalition of civil society groups in the global south, said a wider pattern is emerging among donors.\n\n“Budgets are being reshaped under political pressure, and the communities who bear the consequences have no way to shape those decisions,” said Kattakuzhy.\n\n“Cutting funding in this way may meet short-term priorities in donor capitals, but it destabilises the local systems that are keeping crises from getting worse.”\n\nAmong the countries most affected by aid cuts is Mozambique, which has suffered from cyclones and droughts as well as a resurgent conflict in the country’s Cabo Delgado province that has displaced more than 300,000 people since July.\n\nThe country has received only $31m of $222m funding required this year, leading to food distribution happening only every two months and covering 39% of caloric needs, according to the UN.\n\nThe cutting of development funding by Sweden will directly hit programmes used to rehabilitate and provide healthcare and education to people displaced by the insurgency in the Cabo Delgado region, which began in 2017.\n\nAll four of the African countries removed from Sweden’s development funding have seen cuts for HIV/Aids services, as experts warn there will be a reversal of years of progress in fighting the disease.\n\nMozambique, Zimbabwe and Tanzania are among six countries, along with Nigeria, South Africa and Zambia – that could bear the brunt of cuts to health programmes tackling HIV/Aids, according to analysis by the Boston Consultant Group.\n\nIlaria Manunza, country director for Save the Children Mozambique, said aid cuts have already made 2025 very difficult: “Every cut compounds the risk of long-term developmental setbacks, particularly in education and child protection,” said Manunza. “If current trends continue, 2026 will be extremely challenging … there is a real risk that progress made over the past decade could be reversed.”", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 14:00:05 GMT", "fetched_at": "2025-12-23T14:42:58.250661"}
{"title": "Gunmen kill nine in Johannesburg township in South Africa’s second mass shooting this month", "link": "https://www.theguardian.com/world/2025/dec/21/gunmen-johannesburg-township-in-south-africas-second-mass-shooting-within-weeks", "summary": "<p>Attackers wound 10 others in Bekkersdal after opening fire at people in a bar and ‘randomly’ shooting in the street, police say</p><p>Nine people have been killed after gunmen opened fire at a bar near Johannesburg in the second mass shooting in South Africa this month.</p><p>Ten more were wounded in the early morning attack at the tavern in the impoverished Bekkersdal township in a gold mining area about 25 miles (40km) south-west of Johannesburg.</p> <a href=\"https://www.theguardian.com/world/2025/dec/21/gunmen-johannesburg-township-in-south-africas-second-mass-shooting-within-weeks\">Continue reading...</a>", "content": "Nine people have been killed after gunmen opened fire at a bar near Johannesburg in the second mass shooting in South Africa this month.\n\nTen more were wounded in the early morning attack at the tavern in the impoverished Bekkersdal township in a gold mining area about 25 miles (40km) south-west of Johannesburg.\n\nIt comes after a shooting at a tavern near Pretoria on 6 December when gunmen killed 12 people, including a three-year-old child.\n\nPolice initially said 10 people were killed when the Bekkersdal bar was attacked just before 1am, but later revised the toll.\n\nMost of the attackers were armed with pistols and one had an AK-47 rifle, the deputy provincial police commissioner Maj Gen Fred Kekana told SABC television from the scene.\n\n“They entered the tavern and randomly shot at the patrons, unprovoked,” he said.\n\nView image in fullscreen Police put up crime scene tape outside the bar in Bekkersdal. Photograph: Emmanuel Croset/AFP/Getty Images\n\nThree people were killed inside the bar and others were killed as they fled the scene, he said, adding: “It’s also reported that after they shot the people, they searched them. They took their valuables, including cell phones.”\n\nThe dead included a driver from an online car-hailing service who was driving past.\n\n“It’s pure criminality,” Kekana said. Police launched a manhunt for the attackers and appealed for public assistance.\n\nSouth Africa, the continent’s most industrialised nation, is grappling with a high crime rate, much of it driven by organised networks and gangs. The country is awash with legal and illegal firearms and shootings are common, often fuelled by gang rivalry and competition between informal businesses.\n\nThe tavern hit in the Pretoria attack this month was an unlicenced outlet in a hostel for migrant workers at Saulsville township. The dead included children age three, 12 and 16.\n\nThe country was also shocked by the daylight killing in central Johannesburg last week of a popular former radio presenter known as DJ Warras. The 40-year-old, whose real name was Warris Stock, was shot on 16 December outside a building he had been visiting as part of his work with a private security company.\n\nIn another high-profile killing, a witness in a corruption inquiry was shot dead in front of his family on 5 December just weeks after testifying against a municipal police chief. The murder of Marius Van der Merwe, 41, reignited a debate about the targeting of whistleblowers who provide information related to crime and corruption.\n\nSouth Africa has one of the highest murder rates in the world, with an average of 63 people a day killed between April and September this year, according to police data.\n\nIn one of the worst mass shootings in recent years, 18 relatives were shot dead at a rural homestead in the Eastern Cape province in September 2024. The victims, who had gathered for a traditional ceremony, were age 14 to 64, and 15 were women. Several men have been arrested.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 12:12:54 GMT", "fetched_at": "2025-12-23T14:42:58.355180"}
{"title": "US economy grows at fastest pace in two years", "link": "https://www.bbc.com/news/articles/c62n9ynzrdpo?at_medium=RSS&at_campaign=rss", "summary": "Strong consumer spending helps the US economy grow at a faster rate than expected.", "content": "US economy grows at fastest pace in two years\n\n2 hours ago Share Save Natalie Sherman Business reporter Share Save\n\nBloomberg via Getty Images\n\nThe US economy picked up speed over the three months to September, as consumer spending jumped and exports increased. The world's largest economy expanded at an annual rate of 4.3%, up from 3.8% in the previous quarter. That was better than expected, and marked the strongest growth in two years. The report, which had been delayed by the US government shutdown, sheds light on an economy that has been buffeted by dramatic changes to trade and immigration policies, as well as persistent inflation and cuts to government spending. But while that has led to sharp swings in some areas, such as imports and exports, the underlying economy has maintained solid momentum, outperforming many forecasts.\n\n\"This is an economy that has defied doom and gloom expectations basically since the beginning of 2022\", said Aditya Bhave, senior economist at Bank of America. Speaking to the BBC's Business Today programme, Mr Bhave described the economy as \"very very resilient\". \"I don't see why that wouldn't continue going forward,\" he added. The overall growth figure for the third quarter of the year was much stronger than expected, with most analysts expecting an annual pace of about 3.2%. It was lifted by consumer spending that rose at an annual rate of 3.5%, compared with 2.5% in the previous quarter, despite a slowing job market, as households spent more on health care services. Imports - which count against growth - continued to decline, reflecting the wave of taxes on shipments entering the US that President Donald Trump announced this spring. Meanwhile exports, which had dropped sharply, bounced back, surging by 7.4%. Government spending also rebounded, driven by defence outlays. Those gains helped to overcome a slowdown in business investment, including in intellectual property, and a housing market struggling under the weight of still-high interest rates, which have heightened affordability issues and supply constraints.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 15:56:57 GMT", "fetched_at": "2025-12-23T17:32:09.831119"}
{"title": "Gunmen abduct 28 Muslim travellers in central Nigeria", "link": "https://www.bbc.com/news/articles/czj0ll7ppewo?at_medium=RSS&at_campaign=rss", "summary": "The victims, including women and children, were ambushed on their way to a religious festival.", "content": "Gunmen abduct 28 Muslim travellers in central Nigeria\n\nNews of the abductions comes just a day after the Nigerian authorities announced the release of the remaining 130 schoolchildren and teachers from a separate mass kidnapping at a Catholic boarding school in Niger state last month.\n\nPolice spokesperson Alabo Alfred said the authorities have \"deployed assets\" to the affected area to ensure that those abducted are rescued.\n\nThe victims, including women and children, were ambushed in their bus on Sunday night as it was driving between villages.\n\nArmed men have kidnapped 28 people travelling to an annual Islamic event in Nigeria's central Plateau state, local police told the BBC.\n\nA journalist based in Plateau state said the families of the latest victims had begun receiving ransom demands.\n\nThe police have not said anything about the identity of the possible perpetrators.\n\nKidnapping for ransom by criminal gangs, known locally as bandits, has become common across parts of northern and central Nigeria.\n\nAlthough the handing over of cash in order to release those being held is illegal, it is thought that this is how many cases are resolved and seen as a way for these gangs to raise money.\n\nThe incident in Plateau state is unrelated to the long-running Islamist insurgency in the country's north-east, where jihadist groups have been battling the state for more than a decade.\n\nThe insecurity in Nigeria received renewed international attention in November after US President Donald Trump threatened to send troops to \"that now disgraced country, 'guns-a-blazing'\". He alleged that Christians were being targeted.\n\nNigeria's federal government has acknowledged the security problems but has denied that Christians are being singled out.\n\nOn Monday, Information Minister Mohammed Idris said that recent tensions with the US over insecurity and alleged persecution of Christians had been \"largely resolved\", resulting in stronger relations with Washington.\n\nHe added that trained and equipped forest guards will be deployed to secure forests and other remote areas used as hideouts by criminal groups to supplement army operations.\n\nAdditional reporting by Abayomi Adisa and BBC Monitoring", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 14:10:19 GMT", "fetched_at": "2025-12-23T17:54:00.587844"}
{"title": "Trump travelled on Epstein's plane more than previously thought, prosecutor says", "link": "https://www.bbc.com/news/articles/c74xgp81pqgo?at_medium=RSS&at_campaign=rss", "summary": "The US president has long denied any wrongdoing in relation to late convicted sex offender Jeffrey Epstein.", "content": "Trump travelled on Epstein's plane more than previously thought, prosecutor says\n\n8 minutes ago Share Save Alex Smith and Anthony Reuben , BBC Verify Share Save\n\nDavidoff Studios/Getty Images A file photo of Jeffrey Epstein and Donald Trump, then a real estate developer, at Trump's Mar-a-Lago estate in Palm Beach, Florida in 1997\n\nUS President Donald Trump was listed as a passenger on the private jet of late convicted sex offender Jeffrey Epstein eight times between 1993 and 1996, a new email released by the US Department of Justice (DOJ) says. \"Donald Trump traveled on Epstein's private jet many more times than previously has been reported (or that we were aware),\" reads the 7 January 2020 email from an assistant US attorney. Trump's name on the flight record does not indicate wrongdoing. In 2024, Trump wrote: \"I was never on Epstein's Plane\". He has denied any wrongdoing in relation to Epstein. The DOJ says some files released on Tuesday \"contain untrue and sensationalist claims\" against Trump.\n\nTrump was a friend of Epstein's for years, but the president has said they fell out in about 2004 - years before Epstein was first arrested. The latest release of documents - running to more than 30,000 pages - is part of the so-called Epstein files the DOJ was legally required to publish in their entirety by last Friday. Live: What the newly-released files contain and reaction In a statement on Tuesday, the DOJ said: \"Some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election. To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already.\" \"Nevertheless, out of our commitment to the law and transparency, the DOJ is releasing these documents with the legally required protections for Epstein's victims,\" the DOJ statement on X said.\n\nThe prosecutor's email was sent on 7 January 2020 and is part of an email chain which includes the subject heading: \"RE: Epstein flight records.\" The sender and recipient are redacted, but the bottom of the email says assistant US attorney, Southern District of New York - with the name redacted. The email states that Trump \"is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which [Epstein's associate Ghislaine] Maxwell was also present. He is listed as having traveled with, among others and at various times, Marla Maples, his daughter Tiffany, and his son Eric.\" \"On one flight in 1993, he and Epstein are the only two listed passengers; on another, the only three passengers are Epstein, Trump, and then-20-year-old...\" - the rest of the sentence has been redacted. It continues: \"On two other flights, two of the passengers, respectively, were women who would be possible witnesses in a Maxwell case.\" In 2022, Ghislaine Maxwell was sentenced to 20 years in prison for crimes including conspiracy to entice minors to travel to engage in illegal sex acts and sex trafficking of a minor. Epstein died in a New York prison cell in 2019 as he awaited his trial on sex trafficking charges.\n\nUS Department of Justice An extract from the 2020 email, released by the US Department of Justice", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 19:46:42 GMT", "fetched_at": "2025-12-23T19:55:18.018097"}
{"title": "Libya's army chief killed in air crash in Turkey", "link": "https://www.bbc.com/news/articles/cyvgzyepdqno?at_medium=RSS&at_campaign=rss", "summary": "Signal was earlier lost with a jet that took off from Ankara with Gen Mohammed Ali Ahmed al-Haddad and four others on board.", "content": "Libya's army chief killed in air crash in Turkey\n\nLibya's Gen Mohammed Ali Ahmed al-Haddad (left) died just hours after holding talks with Turkish Defence Minister Yasar Guler\n\nThe Libyan army chief has been killed in an air crash in Turkey.\n\nGen Mohammed Ali Ahmed al-Haddad and four others were on board a Falcon 50 aircraft flying out of the Turkish capital, Ankara.\n\nIn a post on X, Turkish Interior Minister Ali Yerlikaya said signal with the business jet was lost at 20:52 local time (17:52 GMT) - about 42 minutes after it took off from Ankara's airport.\n\nThe Tripoli-bound jet had issued an emergency landing request before contact was lost.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 20:18:23 GMT", "fetched_at": "2025-12-23T20:29:24.155552"}
{"title": "Libya’s army chief dies in plane crash in Turkey", "link": "https://www.theguardian.com/world/2025/dec/23/libyas-army-chief-dies-in-plane-crash-in-turkey", "summary": "<p>Libyan PM says Mohammed Ali Ahmed al-Haddad died after aircraft lost radio contact above Ankara</p><p>The Libyan army’s chief of staff, Mohammed Ali Ahmed al-Haddad, has been killed in a plane crash after leaving Turkey’s capital, Ankara.</p><p>The prime minister of Libya’s internationally recognised government confirmed on Tuesday evening that Mohammed Ali Ahmed al-Haddad had died and that four others were on the jet with him.</p> <a href=\"https://www.theguardian.com/world/2025/dec/23/libyas-army-chief-dies-in-plane-crash-in-turkey\">Continue reading...</a>", "content": "The Libyan army’s chief of staff, Mohammed Ali Ahmed al-Haddad, has been killed in a plane crash after leaving Turkey’s capital, Ankara.\n\nThe prime minister of Libya’s internationally recognised government confirmed on Tuesday evening that Mohammed Ali Ahmed al-Haddad had died and that four others were on the jet with him.\n\n“This followed a tragic and painful incident while they were returning from an official trip from the Turkish city of Ankara. This grave loss is a great loss for the nation, for the military institution, and for all the people,” the Libyan prime minister, Abdul Hamid Dbeibah, said.\n\nHe said the commander of Libya’s ground forces, the director of its military manufacturing authority, an adviser to the chief of staff, and a photographer from the chief of staff’s office were also on the aircraft.\n\nThe Turkish interior minister, Ali Yerlikaya, said on X that the plane had taken off from Ankara’s Esenboğa airport at 17:10 GMT en route to Tripoli, and that radio contact was lost at 17:52 GMT.\n\nView image in fullscreen Debris pieces, believed to belong to the aircraft, are found during a search and rescue operation after a Libya-bound private jet carrying the Libyan army chief lost contact with the control tower in Turkey on 23 December 2025. Photograph: Anadolu/Getty Images\n\nHe said authorities found the plane’s wreckage near the Kesikkavak village in Ankara’s Haymana district.\n\nYerlikaya added that the Dassault Falcon 50-type jet had made a request for an emergency landing while over Haymana, but that no contact was established.\n\nThe cause of the crash was not immediately clear.\n\nTurkey’s defence ministry had announced Haddad’s visit earlier, saying he had met with the Turkish defence minister, Yaşar Güler, and Turkish counterpart, Selçuk Bayraktaroğlu, along with other Turkish military commanders.\n\nThe crash occurred a day after Turkey’s parliament passed a decision to extend the mandate of Turkish soldiers’ deployment in Libya by two more years.\n\nNato member Turkey has militarily and politically supported Libya’s Tripoli-based, internationally recognised government. In 2020, it sent military personnel there to train and support its government and later reached a maritime demarcation accord, which has been disputed by Egypt and Greece.\n\nIn 2022, Ankara and Tripoli also signed a preliminary accord on energy exploration, which Egypt and Greece also oppose.\n\nHowever, Turkey has recently switched course under its “One Libya” policy, ramping up contacts with Libya’s eastern faction as well.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Tue, 23 Dec 2025 21:03:05 GMT", "fetched_at": "2025-12-23T21:25:08.105123"}
{"title": "UN experts urge Iran to stop execution of woman activist", "link": "https://www.bbc.com/news/articles/cwyxz5jken3o?at_medium=RSS&at_campaign=rss", "summary": "Zahra Tabari, 67, was sentenced to death after a trial that lasted less than 10 minutes, her family says.", "content": "UN experts urge Iran to stop execution of woman activist\n\nZahra Tabari was sentenced to death after a trial that lasted less than 10 minutes, her family says\n\nIranian authorities have not yet commented on the case.\n\nIn October, she was convicted of \"armed rebellion\" by a Revolutionary Court in Rasht after a trial via video link that lasted less than 10 minutes. Her family said the verdict was based on extremely limited and unreliable evidence: a piece of cloth bearing the words \"Woman, Resistance, Freedom\", and an unpublished audio message.\n\nMs Tabari was arrested in April and accused of collaborating with a banned opposition group, the People's Mujahideen Organisation of Iran (PMOI), according to her family.\n\nUN experts and 400 prominent women have urged Iran not to execute Zahra Tabari, a 67-year-old electrical engineer and women's rights activist.\n\nAt least 51 other people are known to be facing the death penalty in Iran after being convicted of national security offences including armed rebellion, as well as \"enmity against God\", \"corruption on Earth\" and espionage, according to the UN experts.\n\nThe UN Human Rights Council's special rapporteurs on human rights in Iran, violence against women and arbitrary executions, as well as the five members of the working group on discrimination against women and girls, warned in a joint statement that Ms Tabari's case showed \"a pattern of serious violations of international human rights law\".\n\nShe was arrested during a raid on her home without a judicial warrant, and was interrogated for a month while held in solitary confinement and pressured to confess to taking up arms against the state and to membership in an opposition group, according to the experts.\n\nMs Tabari was denied access to a lawyer of her choosing and was represented by a court-appointed lawyer, they said, adding that her death sentence was issued immediately after a brief hearing.\n\n\"The severe procedural violations in this case - including the unlawful deprivation of her liberty, the denial of effective legal representation, the extraordinarily brief trial, the lack of adequate time to prepare a defence, and the use of evidence that appears insufficient to support a charge of [armed rebellion] - render any resulting conviction unsafe,\" they said.\n\nThey also noted that international law restricted the death penalty to the most serious crimes, meaning intentional killing.\n\n\"To execute Tabari under these circumstances would constitute arbitrary execution,\" the experts added. \"Criminalising women's activism for gender equality and treating such expression as evidence of armed rebellion constitutes a grave form of gender discrimination.\"\n\nMore than 400 prominent women - including several Nobel laureates, the former presidents of Switzerland and Ecuador, and former prime ministers of Finland, Peru, Poland and Ukraine - also signed a public appeal for Ms Tabari's immediate release on Tuesday.\n\n\"Iran is today the world's number one executioner of women per capita. Zahra's case lays bare this terror: in Iran, daring to hold a sign declaring women's resistance to oppression is now punishable by death,\" it said.\n\nThe appeal was organised by Justice for the Victims of the 1988 Massacre in Iran, a UK-based group that represents the families of the thousands of political prisoners who were executed in Iran three decades ago.\n\nAnother Iranian woman, Kurdish rights activist and social worker Pakhshan Azizi, is also facing the death penalty on the same charge as Ms Tabari.\n\nUN experts have previously said Ms Azizi's sentencing appeared to be \"solely related to her legitimate work as a social worker, including her support for refugees in Iraq and Syria\".\n\nAccording to Iran Human Rights (IHR), at least 1,426 people - including 41 women - were executed in Iran in the first 11 months of 2025 - a 70% increase on the same period last year.\n\nAlmost half of those put to death as of the end of November were convicted of drug-related offences, while 53 were convicted of national security offences, the Norway-based group said.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 22:11:01 GMT", "fetched_at": "2025-12-23T22:25:41.282436"}
{"title": "'Inappropriate friends' email from 'Balmoral' among Epstein release", "link": "https://www.bbc.com/news/articles/cm28g5exx09o?at_medium=RSS&at_campaign=rss", "summary": "A newly released email sent to Ghislane Maxwell from \"A\" is among the latest set of Epstein files released by the US' House Committee on Oversight and Reform.", "content": "'Inappropriate friends' email from 'Balmoral' among Epstein release\n\n38 minutes ago Share Save Cachella Smith Share Save\n\nPA Media\n\nAn email sent from an individual named \"A\", saying they are at Balmoral and asking Ghislaine Maxwell for \"inappropriate friends\", is among the latest tranche of Epstein files released on Tuesday. The message, sent to Maxwell on 16 August 2001, begins: \"I am up here at Balmoral Summer Camp for the Royal Family.\" Later in the email, the sender asks: \"How's LA? Have you found me some new inappropriate friends?\" before signing off \"see ya A xxx\". Balmoral Castle is a royal residence. The emails do not indicate any wrongdoing. The BBC has contacted Andrew Mountbatten-Windsor's team for a response. The former prince has previously denied all wrongdoing.\n\nHe has also previously said he did not \"see, witness or suspect any behaviour of the sort that subsequently led to his [Epstein's] arrest and conviction\".\n\nThe message was sent from email address \"abx17@dial.pipex.com\" entitled \"The Invisible Man\" and forms part of the more than 11,000 files published on Tuesday. In an email sent back to this address on the same day, Maxwell wrote: \"So sorry to dissapoint [sic] you, however the truth must be told. I have only been able to find appropriate friends.\"\n\nUS Department of Justice\n\nA different email address - aace@dial.pipex.com - is listed in Epstein's phone book under a contact labelled \"Duke of York\", a previously released image showed. A further exchange between Maxwell and \"The Invisible Man\" also published on Tuesday's shows the alias attached to both of the email addresses. The messages, sent in February 2002, discuss a trip to Peru. Maxwell initially forwarded an email to \"The Invisible Man\" at abx17@dial.pipex.com with details of plans for a visit to the South American country asking \"What do you think [?]\". The forwarded email comes from an address labelled \"Juanesteban Ganoza\" and makes suggestions on possible activities including a small lunch and horse riding. It also said: \"About the girls... how old is he? I doubt it that he will find someone here, but we can try,\" A reply from \"The Invisible Man\" is sent to Maxwell via the other address \"aace@dial.pipex.com\" with comments including: \"As far as food is concerned I am very easy and will fit in with whatever he plans […] As for girls well I leave that entirely to you and Juan Estoban!\" The sender signs off \"Masses of love A xxx\". In a later exchange, in March 2002, Maxwell forwards an email to aace@dial.pipex.com, which begins: \"Thought you would like to see what I sent.\" The email then appears to copy in a note sent to someone else beginning: \"I just gave Andrew your telephone no [sic]. \"Some sight seeing some 2 legged sight seeing (read intelligent pretty fun and from good families) and he will be very happy.\"\n\nUS Department of Justice\n\nIn October, Andrew Mountbatten-Windsor lost use of his prince and Duke of York titles following scrutiny over his links with Epstein. The US Department of Justice has been releasing documents, known as the Epstein files, relating to two criminal investigations into the convicted sex offender during his lifetime. Congress passed a law mandating the files be released in their entirety by 19 December. Not all the files have yet been released. Andrew has been referenced in previous documents. Simply appearing in the photos or documents is not itself evidence of wrongdoing.\n\nAlso among the newly released documents is a formal request from the US Department of Justice (DOJ) dating to April 2020 asking for assistance from the British authorities \"to interview H.R.H Prince Andrew Albert Christian Edward\" relating to two criminal investigations. One of the two related to Epstein. On the Epstein investigation, the DOJ's note reads \"the investigation to date has revealed that Prince Andrew may have been a witness to and/or participant in certain events of relevance to the ongoing investigation\". The document also underlined that Andrew was not a \"target\" of the investigation and no evidence had been gathered that he had committed any crime under US law. Attached to the document is a list of areas the US authorities had sought to cover in an interview - it included names and identifying features of any females Prince Andrew met through Epstein and/or Maxwell as well as the history of his relationship with both.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 22:48:09 GMT", "fetched_at": "2025-12-23T23:27:30.168568"}
{"title": "Trump trips, a fake video and 10 possible co-conspirators - Takeaways from new Epstein files", "link": "https://www.bbc.com/news/articles/c5yj4yvx80do?at_medium=RSS&at_campaign=rss", "summary": "The largest release of Epstein-related documents yet from the justice department included some notable messages and several mentions of Trump.", "content": "Trump trips, a fake video and 10 possible co-conspirators - Takeaways from new Epstein files\n\n1 hour ago Share Save Kayla Epstein Share Save\n\nWatch: The BBC reports on the latest Epstein file release\n\nThe US Department of Justice released its latest - and largest - tranche of Jeffrey Epstein files on Tuesday. The 11,000-plus documents continue a stream of released information that began on Friday, the deadline mandated in a new law that required the department to publicly release all of its investigative files into the deceased paedophile and financier. Many of the documents released on Tuesday are redacted with names and information blacked out, including names of people who the FBI appears to cite as possible co-conspirators in the Epstein case. The justice department is facing criticism from lawmakers on both sides of the political aisle over the amount of redactions, which the law specifically states can only be done to protect the identity of victims or active criminal investigations. President Donald Trump's name appeared more in these new documents than in previous releases. Many were media clippings that mention him, but one notable email from a federal prosecutor indicated Trump flew on Epstein's jet. The justice department said some files \"contain untrue and sensationalist claims\" about Trump. Being mentioned in the Epstein files does not indicate wrongdoing. BBC has requested comment from individuals named in our reporting.\n\nEmail exchange between 'A' and Ghislaine Maxwell about 'girls'\n\nOf the thousands of pages included in this latest release, one 2001 email sent by a person identified as \"A\" stands out. The message, to Epstein's accomplice and close associate Ghislaine Maxwell, says that \"A\" is at \"Balmoral Summer Camp for the Royal Family\". \"A\" then asks Maxwell, who was sentenced to 20 years in prison in 2022 for sex trafficking of minors and other offences: \"Have you found me some new inappropriate friends?\" In another email sent later that day, Maxwell writes back: \"So sorry to dissapoint [sic] you, however the truth must be told. I have only been able to find appropriate friends.\" The \"A\" email was sent from the address abx17@dial.pipex.com, with the sender's name shown as \"The Invisible Man\". An image from a prior Epstein files release showed a different, but similar email - aace@dial.pipex.com - listed in Epstein's phone book under a contact titled \"Duke of York\". Email by 'A' from 'Balmoral' asked Ghislaine Maxwell for 'inappropriate friends', Epstein files show\n\nWho and what are in the Epstein files?\n\nWhat the underwhelming Epstein files release means for Trump and Maga Another exchange in the new files between Maxwell and \"The Invisible Man\" discusses a trip to Peru. In October, Andrew Mountbatten-Windsor lost use of his Duke of York title following scrutiny over his links with Epstein. He has repeatedly denied all wrongdoing, and said he did not \"see, witness or suspect any behaviour of the sort that subsequently led to his [Epstein's] arrest and conviction\". The BBC has contacted Andrew Mountbatten-Windsor's team for a response.\n\nFBI email lists out 10 alleged co-conspirators to Epstein\n\nUS Department of Justice\n\nAmong the documents released are emails appearing to be sent between FBI personnel in 2019 that mention 10 possible \"co-conspirators\" of Epstein. The emails said six of the 10 co-conspirators had been served with subpoenas. This included three in Florida, one in Boston, one in New York City, and one in Connecticut. Four subpoenas were yet to be served when the emails were sent, including to one \"wealthy businessman in Ohio\". Another email sent to FBI New York gives an update on the co-conspirators. This time it appears to mention multiple names. Most are redacted from the file. Two names were not redacted – (Ghislaine) Maxwell and Wexner. An email says, \"I do not know about Ohio contacting Wexner\". The email is presumably referring to Former Victoria's Secret CEO Les Wexner, who had a public friendship with Epstein. In 2019, Wexner said he was \"embarrassed\" by his ties to the financier. Lawyers for Wexner told BBC News that \"the assistant U.S. attorney in charge of the Epstein investigation stated at the time that Mr. Wexner was neither a co-conspirator nor target\". \"Mr. Wexner cooperated fully by providing background information on Epstein and was never contacted again,\" they said. Possible co-conspirators in Epstein's crimes are a major focus for his victims, and for several lawmakers who have demanded more transparency from the DOJ. \"There's 10 co-conspirators potentially that we knew nothing about that the DOJ had been investigating,\" Democrat Congressman Suhas Subramanyam told BBC News on Tuesday. Subramanyam, who sits on the House Oversight Committee, added that he was also \"concerned\" over the level of redactions that protect names of lawyers and people who are not victims. Lawmakers in both parties have said they are examining legal options to force more transparency. The law passed by Congress and signed by President Trump states names and information that might be embarrassing or cause \"reputational harm\" are not allowed to be redacted and specifically asks the justice department for internal communications and memos detailing who was investigated and decisions concerning \"to charge, not charge, investigate, or decline to investigate Epstein or his associates\".\n\nJustice Department says Epstein letter to Larry Nassar is a fake\n\nGetty Images Larry Nassar\n\nA letter included in the released batch of documents got a lot of attention online. But, according to the justice department, it is fake. The handwritten letter and envelope at first appeared to show Epstein writing to Larry Nassar, the former USA Gymnastics doctor who is serving decades in prison for sexually abusing young female athletes. \"As you know by now I have taken the 'short route' home. Good luck!\" the faux letter states. \"We shared one thing…our love & caring for young ladies and the hope they'd reach their full potential.\" The writer signs it, \"Life is unfair, Yours, J. Epstein.\" The letter had been deemed undeliverable, and was sent back to a Manhattan jail where Epstein was detained before his death. The FBI was alerted to the returned letter and requested an analysis of it. That request was also included in the releases batch of documents. The justice department on Tuesday called the letter a fake, noting several irregularities with the note and the envelope that held it. \"The writing does not appear to match Jeffrey Epstein's,\" the justice department wrote on X. \"The return address did not list the jail where Epstein was held and did not include his inmate number, which is required for outgoing mail,\" they added. Officials pointed out the envelope bore a postmark from northern Virginia - noting that Epstein was detained in New York. It was also postmarked on 13 August 2019, three days after Epstein died. Even before the justice department's announcement of it being fake, the documents raised immediate questions. The return sender was listed as \"J. Epstein\" at \"Manhattan Correctional\" - but the correct name for the now-shuttered jail was \"Metropolitan Correctional Center\". The documents released on Tuesday also show the analysis request by the FBI. A FBI laboratory request stated that in August 2019, a sender listed as \"J. Epstein\" at \"Manhattan Correctional\" tried to send a letter to \"Larry Nassar at 9300 S. Wilmot Road, Tucson, Arizona, 85756\", the address of a federal prison. Nassar is currently incarcerated in Pennsylvania, according to the Bureau of Prisons.\n\nTrump's travels aboard Epstein's private jet\n\nGetty Images\n\nTrump's name appears more in these files than in other batches of documents released by the justice department. Notably, in a January 2020 email, a federal prosecutor in New York wrote that newly received flight records \"reflect that Donald Trump traveled on Epstein's private jet many more times than previously has been reported (or that we were aware)\". The recipient of the email was redacted. Trump was listed as a passenger on \"at least eight flights between 1993 and 1996\", and Ghislaine Maxwell was present on at least four of those flights, the prosecutor wrote. Trump was also \"listed as having traveled with, among others and at various times, Marla Maples, his daughter Tiffany, and his son Eric\". Trump was previously married to Marla Maples, Tiffany's mother, from 1993 to 1999. The prosecutor also wrote that \"on one flight in 1993, he and Epstein are the only two listed passengers; on another, the only three passengers are Epstein, Trump, and then-20-year-old\", with the third passenger's name redacted. Trump travelled on Epstein's plane more than previously thought, prosecutor says\n\nImage in Epstein files that features Trump reinstated after backlash\n\nClinton and Trump - Two US presidents and their long associations with Jeffrey Epstein \"On two other flights, two of the passengers, respectively, were women who would be possible witnesses in a Maxwell case.\" The timing of the trips coincide with years in which federal prosecutors were examining Maxwell's conduct and travels as part of the criminal case they brought against her. She was ultimately found guilty of conspiring with Epstein to recruit and sexually abuse minors. But throughout the files released on Tuesday, many of the other mentions of Trump's name are simply in press clippings mentioning him, his campaigns, and other news moments. Trump has repeatedly denied wrongdoing in regards to Epstein. In a statement accompanying Tuesday's release, the Department of Justice said the new files \"contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election\". \"To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already,\" the justice department said.\n\nFake video of Epstein included", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 01:08:43 GMT", "fetched_at": "2025-12-24T02:10:57.679496"}
{"title": "Australia to deport British man charged with displaying Nazi symbols", "link": "https://www.bbc.com/news/articles/cgke51rzpvro?at_medium=RSS&at_campaign=rss", "summary": "The immigration minister said the man is an unwelcome \"guest\" in Australia.", "content": "Australia to deport British man charged with displaying Nazi symbols\n\n2 hours ago Share Save Lana Lam Sydney Share Save\n\nAustralian Federal Police Police arrested and charged the British man, 43, earlier this month\n\nA British national in Australia has had his visa cancelled and faces deportation for allegedly displaying Nazi symbols. The 43-year-old man living in Queensland was arrested and charged earlier this month, after allegedly using a social media account to post the Nazi swastika, promote pro-Nazi ideology and call for violence towards the Jewish community. The man was taken into immigration detention this week in Brisbane and is due to face court in January. Police have been cracking down on the use of prohibited symbols amid a recent rise in antisemitism and right-wing extremism. Home Affairs Minister Tony Burke said: \"He came here to hate - he doesn't get to stay.\"\n\n\"If you come to Australia on a visa, you are here as a guest,\" Burke told the Australian Broadcasting Corporation (ABC) on Wednesday. Last month, Burke also revoked the visa of Matthew Gruter, a South African national who had been living in Australia since 2022, after he was seen attending a neo-Nazi rally in front of the New South Wales parliament. Like Gruter, the British man can appeal his visa being revoked. He can leave Australia voluntarily or wait to be deported to his home country. It is understood police are assessing whether to delay deporting the man so he can face court next month. Earlier this year, Australia tightened its hate crime laws, introducing mandatory jail terms for displaying hate symbols or performing a Nazi salute. Police began investigating the British man in October over alleged posts on X. The social media platform blocked his account, prompting him to create a new one with a similar name where he continued posting offensive and harmful content, police said.\n\nAustralian Federal Police Police seized weapons including axes and knives from the British man's home", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 00:25:04 GMT", "fetched_at": "2025-12-24T02:10:57.837829"}
{"title": "US denies visas to ex-EU commissioner and others over social media rules", "link": "https://www.bbc.com/news/articles/cp39kngz008o?at_medium=RSS&at_campaign=rss", "summary": "Thierry Breton, the former top tech regulator at the European Commission, says a \"witch hunt\" is taking place.", "content": "US denies visas to ex-EU commissioner and others over social media rules\n\nThierry Breton, the former top tech regulator at the European Commission, has clashed with Elon Musk in the past\n\nBreton was described by the State Department as the \"mastermind\" of the EU's Digital Services Act (DSA), which imposes content moderation on social media firms.\n\nThierry Breton, the former top tech regulator at the European Commission, suggested that a \"witch hunt\" was taking place.\n\n\"These radical activists and weaponized NGOs have advanced censorship crackdowns by foreign states - in each case targeting American speakers and American companies,\" Secretary of State Marco Rubio said in a statement.\n\nThe US State Department said it would deny visas to five people, including a former EU commissioner, for seeking to \"coerce\" American social media platforms into suppressing viewpoints they oppose.\n\nHowever, it has angered some US conservatives who see it as seeking to censor right-wing opinions. Brussels denies this.\n\nBreton has clashed with Elon Musk, the world's richest man and owner of X, over obligations to follow EU rules.\n\nThe European Commission recently fined X €120m (£105m) over its blue tick badges - the first fine under the DSA. It said the platform's blue tick system was \"deceptive\" because the firm was not \"meaningfully verifying users\".\n\nIn response, Musk's site blocked the Commission from making adverts on its platform.\n\nReacting to the visa ban, Breton posted on X: \"To our American friends: Censorship isn't where you think it is.\"\n\nClare Melford, who leads the UK-based Global Disinformation Index (GDI), was also listed.\n\nUS Undersecretary of State Sarah B Rogers accused the GDI of using US taxpayer money \"to exhort censorship and blacklisting of American speech and press\".\n\nA GDI spokesperson told the BBC that \"the visa sanctions announced today are an authoritarian attack on free speech and an egregious act of government censorship\".\n\n\"The Trump Administration is, once again, using the full weight of the federal government to intimidate, censor, and silence voices they disagree with. Their actions today are immoral, unlawful, and un-American.\"\n\nImran Ahmed of the Center for Countering Digital Hate (CCDH), a nonprofit that fights online hate and misinformation, was also handed a ban.\n\nRogers called Mr Ahmed a \"key collaborator with the Biden Administration's effort to weaponize the government against US citizens\".\n\nThe BBC has reached out to the CCDH for comment.\n\nAlso subject to bans were Anna-Lena von Hodenberg and Josephine Ballon of HateAid, a German organisation that the State Department said helped enforce the DSA.\n\nIn a statement to the BBC, the two CEOs called it an \"act of repression by a government that is increasingly disregarding the rule of law and trying to silence its critics by any means necessary\".\n\n\"We will not be intimidated by a government that uses accusations of censorship to silence those who stand up for human rights and freedom of expression,\" they added.\n\nRubio said that steps had been taken to impose visa restrictions on \"agents of the global censorship-industrial complex who, as a result, will be generally barred from entering the United States\".\n\n\"President Trump has been clear that his America First foreign policy rejects violations of American sovereignty. Extraterritorial overreach by foreign censors targeting American speech is no exception,\" he added.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 00:45:28 GMT", "fetched_at": "2025-12-24T03:42:18.202153"}
{"title": "Latest peace plan offers possible Ukrainian withdrawal from east, Zelensky says", "link": "https://www.bbc.com/news/articles/c9d9wg2pwl1o?at_medium=RSS&at_campaign=rss", "summary": "On the key question of Ukraine's eastern Donbas, Zelensky says a \"free economic zone\" is a potential option.", "content": "Latest peace plan offers possible withdrawal from east Ukraine, Zelensky says\n\nZelensky said the 20 points agreed with the Americans offered Ukraine security guarantees that mirrored Nato membership\n\nUkraine's President Volodymyr Zelensky has given details of an updated peace plan that offers Russia the potential withdrawal of Ukrainian troops from the east that Moscow has demanded.\n\nGiving details of the 20-point plan agreed by US and Ukrainian negotiators in Florida at the weekend, Zelensky said the Russians would give their response once the Americans had spoken to them.\n\nDescribing the plan as \"the main framework for ending the war\" Zelensky said it proposed security guarantees from the US, Nato and Europeans for a co-ordinated military response if Russia invaded Ukraine again.\n\nOn the key question of Ukraine's eastern Donbas, Zelensky said a \"free economic zone\" was a potential option.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 09:52:14 GMT", "fetched_at": "2025-12-24T09:54:26.760905"}
{"title": "Venezuela accuses US of 'extortion' over seizure of oil tankers", "link": "https://www.bbc.com/news/articles/cd749gqgg11o?at_medium=RSS&at_campaign=rss", "summary": "An emergency meeting of the UN Security Council was called to discuss the US seizure of two tankers.", "content": "Venezuela accuses US of 'extortion' over seizure of oil tankers\n\nPresident Trump has accused Venezuela's President Nicolas Maduro of leading a drugs cartel and said gangs had operated with impunity for too long.\n\nThe US has also said it was pursuing a third Venezuelan oil tanker.\n\nThe emergency meeting of the Security Council was called to discuss the seizure of the tankers, which took place off the coast of Venezuela earlier this month.\n\nWashington's seizure of two Venezuelan oil tankers was \"worse than piracy,\" the Venezuelan ambassador to the UN said.\n\nVenezuela has accused the United States of the \"greatest extortion\" at an emergency session of the UN Security Council in New York.\n\nOn 16 December, Trump ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. The US president has said the US will keep or sell the crude oil contained on tankers it has seized, as well as the vessels themselves.\n\nThe US has deployed 15,000 troops and a range of aircraft carriers, guided-missile destroyers, and amphibious assault ships to the Caribbean.\n\nThe stated aim of the deployment - the largest to the region since the US invaded Panama in 1989 - is to stop the flow of fentanyl and cocaine to the US.\n\nThe US has also targeted more than 20 vessels in the Pacific and the Caribbean in recent months, killing at least 90 people, as part of President Trump's campaign against gangs he accuses of transporting drugs in the region.\n\nSome experts say the strikes could violate laws governing armed conflict.\n\nVenezuela's envoy to the UN said the US was subjecting his country to the \"greatest extortion\" in its history.\n\nSpeaking at the UN Security Council meeting on Tuesday, Samuel Moncada said \"we are in the presence of a power that acts outside of international law, demanding that Venezuelans vacate our country and hand it over.\"\n\nRegarding the US seizure of Venezuelan oil, he added: \"We are talking about pillaging, looting and recolonisation of Venezuela.\n\n\"The government of the United States does not have jurisdiction in the Caribbean.\"\n\nReferring to the Venezuelan oil industry, he said: \"What does that have to do with drugs?\"\n\nIn response, the US Ambassador to the UN, Michael Waltz, told the Security Council the US does not recognise Mr Maduro as the legitimate leader of Venezuela.\n\n\"Maduro's ability to sell Venezuela's oil enables his fraudulent claims to power and his narco-terrorist activities,\" Mr Waltz said.\n\nOn a visit to a trade fair in Caracas, President Maduro said \"the Security Council is giving overwhelming support to Venezuela.\"\n\nRussia and China accused the US of bullying and aggression.\n\nThe US was \"illegally destroying\" civilian vessels in the Caribbean Sea, the Russian ambassador to the UN, Vassily Nebenzia, told the UN meeting.\n\nHe warned that other countries could be next.\n\nThe US actions against Venezuelan vessels, he said, were \"a template for future acts of force against Latin American states.\"\n\nMeanwhile, China's envoy to the UN, Sun Lei, called on the US to \"immediately halt relevant actions and avoid further escalation of tensions.\"", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 09:46:14 GMT", "fetched_at": "2025-12-24T10:28:40.284022"}
{"title": "Two police officers killed in explosion in Moscow", "link": "https://www.bbc.com/news/articles/cz68z3wn1e3o?at_medium=RSS&at_campaign=rss", "summary": "An explosion was detonated after police approached a 'suspicious' individual in Moscow, authorities said.", "content": "Two police officers killed in explosion in Moscow\n\nPolice stand guard close to the scene of the explosion\n\nThree people - including two police officers - have been killed in an explosion in Moscow, Russian authorities have said.\n\nTwo traffic police officers saw a \"suspicious individual\" near a police car on the city's Yeletskaya Street, and when they approached the suspect to detain him, an explosive device was detonated, Russia's Investigative Committee has said.\n\nThe two police officers died from their injuries, along with another individual who was standing nearby.\n\nThe blast took place close to the location where a senior Russian general was killed in a car bombing in the capital on Monday.\n\nLt Gen Fanil Sarvarov died after an explosive device - which had been planted under a car - was detonated.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 08:58:48 GMT", "fetched_at": "2025-12-24T15:27:52.284999"}
{"title": "Algeria passes law declaring French colonisation a crime", "link": "https://www.theguardian.com/world/2025/dec/24/algeria-passes-law-declaring-french-colonisation-crime", "summary": "<p>France’s rule over Algeria from 1830 to 1962 is marked by mass killings and large-scale deportation</p><p>Algeria’s parliament has unanimously approved a law declaring France’s colonisation of the country a crime and demanded an apology and reparations.</p><p>Lawmakers, standing in the chamber wearing scarves in the colours of the national flag, chanted “long live Algeria” on Wednesday as they applauded the passage of the bill, which states that France holds “legal responsibility for its colonial past in Algeria and the tragedies it caused”.</p> <a href=\"https://www.theguardian.com/world/2025/dec/24/algeria-passes-law-declaring-french-colonisation-crime\">Continue reading...</a>", "content": "Algeria’s parliament has unanimously approved a law declaring France’s colonisation of the country a crime and demanded an apology and reparations.\n\nLawmakers, standing in the chamber wearing scarves in the colours of the national flag, chanted “long live Algeria” on Wednesday as they applauded the passage of the bill, which states that France holds “legal responsibility for its colonial past in Algeria and the tragedies it caused”.\n\nThe two countries are embroiled in a major diplomatic crisis and analysts say that while Algeria’s move is largely symbolic, it is still politically significant.\n\nThe parliament speaker, Ibrahim Boughali, told the APS state news agency that the vote would send “a clear message, both internally and externally, that Algeria’s national memory is neither erasable nor negotiable”.\n\nThe legislation lists the “crimes of French colonisation”, which include nuclear tests, extrajudicial killings, “physical and psychological torture” and the “systematic plundering of resources”.\n\nView image in fullscreen Lawmakers, wearing scarves in the colours of the national flag, chanted ‘long live Algeria’ as they applauded the passage of the bill. Photograph: Fateh Guidoum/AP\n\nIt states that “full and fair compensation for all material and moral damages caused by French colonisation is an inalienable right of the Algerian state and people”.\n\nFrance’s rule over Algeria from 1830 until 1962 wasa period marked by mass killings and large-scale deportations, all the way up to the bloody war of independence from 1954 to 1962.\n\nAlgeria says the war killed 1.5 million people, while French historians put the death toll at 500,000 in total, 400,000 of them Algerian.\n\nThe French president, Emmanuel Macron, has previously acknowledged the colonisation of Algeria as a “crime against humanity” but has stopped short of offering an apology.\n\nAsked last week about the vote, the French foreign ministry spokesperson, Pascal Confavreux, said he would not comment on “political debates taking place in foreign countries”.\n\nHosni Kitouni, a researcher in colonial history at the University of Exeter in the UK, said that “legally, this law has no international scope and therefore is not binding for France”. However, “its political and symbolic significance is important: it marks a rupture in the relationship with France in terms of memory,” he said.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Wed, 24 Dec 2025 15:02:47 GMT", "fetched_at": "2025-12-24T15:27:52.778652"}
{"title": "Algerian law declares France's colonisation a crime", "link": "https://www.bbc.com/news/articles/c14vdpyj1vjo?at_medium=RSS&at_campaign=rss", "summary": "Lawmakers unanimously approve a law, which demands an apology and reparations from the former colonial power.", "content": "Algerian law declares France's colonisation a crime\n\nFrance returned the remains of 24 Algerian resistance fighters in 2020\n\nFrance's colonialisation of Algeria between 1830 and 1962 was marked by mass killings, large-scale deportations and ended in a bloody war of independence. Algeria says the war killed 1.5 million people, while French historians put the death toll much lower.\n\nThe vote is the latest sign of increasingly strained diplomatic relations between the two countries, with some observers saying they are at their lowest since Algeria gained independence 63 years ago.\n\nThe law also criminalises the glorification of colonialism, state-run TV reports.\n\nAlgeria's parliament has unanimously passed a law declaring France's colonisation of the North African state a crime, and demanding an apology and reparations.\n\nLawmakers wore scarves in the colours of the national flag and chanted \"long live Algeria\" as they applauded the bill's passage through parliament, AFP news agency reports.\n\nFrance's President Emmanuel Macron has previously acknowledged the colonisation of Algeria was a \"crime against humanity\" but has not offered an apology.\n\nFrench relief as Algeria frees jailed novelist at centre of diplomatic crisis\n\nOutcry after Algeria sentences French sports journalist to seven years in jail\n\nFrench row with Algeria escalates further with tit-for-tat expulsions\n\nIt says the legislation states that France has \"legal responsibility\" for the \"tragedies it caused\", and \"full and fair\" compensation was an \"inalienable right of the Algerian state and people\".\n\nFrance has not yet commented on the vote.\n\nIt comes at a time of growing pressure on Western powers to offer reparations for slavery and colonialism, and to return looted artefacts still kept in their museums.\n\nAlgerian lawmakers have been demanding that France return a 16th Century bronze canon, known as Baba Merzoug, meaning \"Blessed Father\", that was regarded as the protector of Algiers, now Algeria's capital.\n\nFrench forces captured the city in 1830, on their third attempt, and removed the cannon - which is now in the port city of Brest in north-western France.\n\nIn 2020, France returned the remains of 24 Algerian fighters who were killed resisting French colonial forces in the 19th Century.\n\nLast month, Algeria hosted a conference of African states to push for justice and reparations.\n\nAlgeria's Foreign Minister Ahmed Attaf said that a legal framework would ensure that restitution was neither regarded as \"a gift nor a favour\".\n\nDiplomatic relations between between Algeria and France soured last year, when Macron announced France was recognising Moroccan sovereignty of Western Sahara and backed a plan for limited autonomy for the disputed territory.\n\nAlgeria backs the pro-independence Polisario Front in Western Sahara and is seen as its main ally.\n\nFrench-Algerian novelist Boualem Sansal was then arrested at Algiers airport in and jailed for five years, before being pardoned by Algeria's President Abdelmadjid Tebboune last month.\n\nProsecutors said he had undermined national security for making remarks that questioned Algeria's borders.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 17:37:07 GMT", "fetched_at": "2025-12-24T17:44:08.425057"}
{"title": "Explosion hits packed mosque in Nigeria", "link": "https://www.bbc.com/news/articles/c0je3v3en01o?at_medium=RSS&at_campaign=rss", "summary": "Eyewitnesses say the blast happened as people were gathered for evening prayers.", "content": "Explosion hits packed mosque in Nigeria\n\nSeveral people are feared to have been killed and injured in Nigeria after a suspected suicide bomber carried out an attack on a mosque in Borno state.\n\nEyewitnesses said the blast happened during evening prayers. One report suggests seven people were killed, but there has been no official confirmation of any casualties.\n\nUnverified footage on social media appears to show the aftermath of the explosion, with people stood in a market area with dust particles in the air.\n\nNo group has admitted carrying out the explosion in Maiduguri - the state's capital - but militants have previously targeted mosques and crowded places in the area with suicide and improvised explosive device (IED) attacks.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 18:44:30 GMT", "fetched_at": "2025-12-24T18:58:47.222516"}
{"title": "Officials discover a million more documents potentially related to Epstein case", "link": "https://www.bbc.com/news/articles/czdgz84dn35o?at_medium=RSS&at_campaign=rss", "summary": "The US Department of Justice says reviewing the material could delay release by a \"few more weeks\".", "content": "Officials discover a million more documents potentially related to Epstein case\n\nUS authorities have discovered more than a million more documents potentially related to the late paedophile Jeffrey Epstein that they plan to release in the coming days and weeks, officials say.\n\nThe US Attorney for the Southern District of New York and the FBI have informed the Department of Justice (DoJ) about the discovery and turned over the documents for lawyers to review.\n\n\"We have lawyers working around the clock to review and make the legally required redactions to protect victims, and we will release the documents as soon as possible,\" the DoJ said on social media on Wednesday.\n\nThe department said that given the volume of material, the process could take \"a few more weeks\".", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 19:32:22 GMT", "fetched_at": "2025-12-24T19:40:47.915323"}
{"title": "Democratic board member muted during Kennedy Center vote sues to remove Trump's name", "link": "https://www.bbc.com/news/articles/c79x0x7v70go?at_medium=RSS&at_campaign=rss", "summary": "US Representative Joyce Beatty claims the renaming of the venue is illegal because the change requires \"an act of Congress\".", "content": "Democratic board member muted during Kennedy Center vote sues to remove Trump's name\n\n4 hours ago Share Save Madeline Halpert Share Save\n\nWatch: President Trump's name added to facade of Kennedy Center\n\nDemocratic US Representative Joyce Beatty has filed a lawsuit seeking to remove President Donald Trump's name from the John F. Kennedy Center for the Performing Arts. Last week, the board of the Kennedy Center - which Trump filled with allies - voted to rename the performing arts centre the Trump-Kennedy Center. Beatty is one of several Democratic lawmakers designated as members of the board by US law. She claimed in her lawsuit that the renaming was illegal because changing the name requires \"an act of Congress\". The suit says Beatty had called into the meeting about the name change but was muted when she tried to voice her opposition.\n\nBeatty argues that Congress intended for the centre to be a \"living memorial\" to former President Kennedy. \"[I]n scenes more reminiscent of authoritarian regimes than the American republic – the sitting President and his handpicked loyalists renamed this storied center after President Trump,\" the lawsuit states. In a statement provided to the BBC, the White House said Trump had \"stepped up\" and saved the Kennedy Center \"by strengthening its finances, modernizing the building, and ending divisive woke programming\". \"As a result, the Board of the Kennedy Center voted unanimously to rename it the Trump-Kennedy Center — a historic move that marks a new era of success, prestige, and restored grandeur for one of America's most iconic cultural institutions,\" White House spokesperson Liz Huston said. On Friday, the president's name was added to the exterior of the building, and the centre's website logo now reads \"The Trump Kennedy Center\". The name change has been met with harsh criticism, particularly in Washington DC where the centre has been an iconic landmark since it was built and named for Kennedy.\n\nBloomberg via Getty Images", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 18:11:10 GMT", "fetched_at": "2025-12-24T22:26:08.958858"}
{"title": "Trump-backed candidate Nasry Asfura wins Honduras presidential election", "link": "https://www.bbc.com/news/articles/cyvgz1jn368o?at_medium=RSS&at_campaign=rss", "summary": "It is not clear if Asfura's opponents will accept the result after saying the vote count was manipulated.", "content": "Trump-backed candidate Nasry Asfura wins Honduras presidential election\n\nNasry Asfura promised not to let Hondurans down\n\nUS Secretary of State Marco Rubio urged all parties to respect the result \"so that Honduran authorities may ensure a peaceful transition of authority\".\n\nIn a post on X, Asfura said, \"Honduras: I am ready to govern. I will not let you down.\"\n\nThe conservative National Party candidate - backed by US President Donald Trump - won with 40.3% of the vote, according to the National Electoral Council (CNE), edging out Salvador Nasralla of the centre-right Liberal Party, who got 39.5%.\n\nNasry Asfura has been declared the winner of Honduras's presidential election, after weeks of delays following technical problems and allegations of fraud.\n\nBut the president of the country's Congress, Luis Redondo, posted saying the result was \"completely illegal\".\n\nThe vote was held on 30 November but the count was delayed twice by technical outages, which electoral officials called \"inexcusable\".\n\nThe president of the CNE, Ana Paola Hall, blamed the private company tasked with tabulating the results for the delay.\n\nShe said the firm had carried out maintenance without warning or checking with the CNE.\n\nThe stoppage came a day after the portal displaying real-time results had crashed.\n\nResults of the election were tight and, due to the tumultuous nature of the processing system, around 15% of the tally sheets had to be counted by hand for the winner to be decided.\n\nThere have been tensions in Honduras as a result of the delays with protests held across the country last week.\n\nThousands of supporters of the governing Libre party demonstrated in the capital Tegucigalpa over what they considered fraud in the vote.\n\nThe outgoing President, Xiomara Castro, had alleged that an \"electoral coup\" was taking place and earlier this month said the election was being marred by \"interference\" from Trump.\n\nWhen he endorsed Asfura for president, Trump said there would be \"hell to pay\" if his very narrow lead was overturned in the count.\n\nHe also threatened to withdraw financial support from the US if Asfura didn't win.\n\nIn a surprise move, the US president also pardoned Juan Orlando Hernandez, a member of Asfura's National Party, who was serving 45 year jail sentence in the US on drug and weapons charges.\n\nXiomara Castro was barred by the constitution from standing for a second term.\n\nNine days after the vote, Nasralla accused \"corrupt people\" of manipulating the vote count in the Central American nation. He also said Trump's comments had damaged his chances of winning.\n\nIn his statement following the announcement of the result, Rubio said the US would \"look forward to working with his incoming administration to advance our bilateral and regional security co-operation\", adding the two countries would \"end illegal immigration to the United States\", while strengthening economic ties.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 22:25:29 GMT", "fetched_at": "2025-12-24T22:46:07.940016"}
{"title": "Sean 'Diddy' Combs files appeal asking for immediate prison release", "link": "https://www.bbc.com/news/articles/c5yqe4j15lzo?at_medium=RSS&at_campaign=rss", "summary": "Combs argues his sentence was improperly decided and asked that his conviction also be thrown out.", "content": "Sean 'Diddy' Combs files appeal asking for immediate prison release\n\nThe request is the latest attempt by his team to reduce his sentence or throw out his conviction.\n\nAttorney Alexandra Shapiro called Combs' 50-month prison sentence \"unlawful, unconstitutional, and a perversion of justice\". She asked an appeals court to order that Combs be resentenced, should the panel choose not to throw out his conviction in its entirety.\n\nIn a court filing for an expedited appeal, the rap mogul's attorney argued that he was improperly sentenced, and that the conduct that resulted in his conviction was not criminal in nature.\n\nSean \"Diddy\" Combs has asked an appeals court to release him from prison and overturn his conviction on two prostitution-related crimes.\n\nThe Southern District of New York, which prosecuted Combs, declined to comment on the request to the Second Circuit Court of Appeals.\n\nCombs' lawyers had previously said they would appeal his sentence and conviction.\n\nFederal prosecutors in New York accused Combs of using his money, power, and the threat of violence to coerce women into unwanted sexual encounters.\n\nDuring a high-profile trial this spring, the jury heard from two of Combs' ex-girlfriends, Cassie Ventura and a woman who testified as \"Jane Doe\". They said Combs abused them and forced them to participate in so-called \"freak-offs\" with male escorts.\n\nThe jury found Combs not guilty of the two most serious charges: racketeering conspiracy and sex trafficking. They convicted him of two counts of transportation to engage in prostitution.\n\nIn September, after his conviction, Combs asked Judge Arun Subramanian to consider an acquittal or new trial, citing objections over the way an anti-prostitution statute known as the Mann Act was used to prosecute Combs. That bid was not successful.\n\nAhead of his sentencing, Combs' attorneys argued he should receive a brief sentence that would essentially amount to time served, a request that would have paved the way for a swift release. Prosecutors, however, asked the judge to send Combs to prison for at least 11 years.\n\nUS District Judge Arun Subramanian ultimately sentenced Combs to more than four years in prison. He said he considered Combs' contributions to society and testimonials from family and friends, but \"a history of good works can't wash away your record\".\n\nCombs' appeal argues that Judge Subramanian did not properly follow sentencing guidelines when sending him to 50-months in prison.\n\nIt argues the judge \"flouted\" new guidelines and improperly considered conduct for which Combs had been acquitted when formulating his punishment. The filing argues the judge \"acted as a thirteenth juror\" in the case and calls the sentence \"draconian\".\n\nBefore Judge Subramanian issued his sentence, Combs apologized to Ms Ventura and \"Jane.\"\n\n\"My actions were disgusting, shameful, and sick,\" Combs said. \"I got lost in excess, I got lost in my ego.\"\n\nCombs is also facing dozens of pending civil lawsuits, which accuse him of sexual assault, rape and sexual exploitation. Many of the lawsuits allege that the rapper used his fame and power to silence accusers through threats. Some detail allegations that the rapper - or those who worked for him - drugged people at parties before alleged assaults.\n\nRepresentatives for Mr Combs have repeatedly said he \"never sexually assaulted or trafficked anyone - man or woman, adult or minor\".", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Wed, 24 Dec 2025 23:30:09 GMT", "fetched_at": "2025-12-24T23:42:54.851037"}
{"title": "Front-runner to be Bangladesh PM returns after 17 years in exile", "link": "https://www.bbc.com/news/articles/crk733k1k1eo?at_medium=RSS&at_campaign=rss", "summary": "Tarique Rahman, who has lived in London since 2008, arrives weeks before for pivotal elections are held.", "content": "Front-runner to be Bangladesh PM returns after 17 years in exile\n\nTarique Rahman, the front-runner to be the next prime minister of Bangladesh, has returned to the country after 17 years in exile ahead of landmark general elections.\n\nThe 60-year-old is the figurehead of the influential Zia family and the son of former prime minister Khaleda Zia.\n\nThe party he leads, the Bangladesh Nationalist Party (BNP), is eyeing a return to power when Bangladesh goes to the polls in the new year.\n\nRahman, who has lived in London since 2008, is expected to become the country's new leader if the BNP emerges as the largest party.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Thu, 25 Dec 2025 06:44:21 GMT", "fetched_at": "2025-12-25T07:02:11.926005"}
{"title": "Hundreds of thousands newly displaced as Islamic State insurgency expands in Mozambique", "link": "https://www.theguardian.com/world/2025/dec/25/displaced-islamic-state-insurgency-mozambique", "summary": "<p>Rising numbers of people flee jihadists, as violence against civilians increases and foreign aid dwindles</p><p>More than 300,000 people have been displaced by an Islamic State insurgency in Mozambique since July, amid growing fears that authorities lack a workable plan to end the fighting.</p><p>With wars in Ukraine, Gaza and Sudan attracting more attention and <a href=\"https://www.theguardian.com/global-development/global-development+aid\">foreign aid</a> falling, the grinding conflict in Mozambique has been largely ignored or forgotten. More than 1 million people have been displaced, many of them two, three or even four times.</p> <a href=\"https://www.theguardian.com/world/2025/dec/25/displaced-islamic-state-insurgency-mozambique\">Continue reading...</a>", "content": "More than 300,000 people have been displaced by an Islamic State insurgency in Mozambique since July, amid growing fears that authorities lack a workable plan to end the fighting.\n\nWith wars in Ukraine, Gaza and Sudan attracting more attention and foreign aid falling, the grinding conflict in Mozambique has been largely ignored or forgotten. More than 1 million people have been displaced, many of them two, three or even four times.\n\nNeither the Mozambican army nor a Rwandan intervention have managed to quell the insurgency, which has ravaged northern Mozambique since October 2017, when militants from Islamic State-Mozambique, an affiliate of the main IS group in the Middle East, carried out their first attacks, in Mocímboa da Praia in Cabo Delgado province in the north-east.\n\nThe group drew global attention in March 2021 with an attack on the town of Palma. More than 600 people were killed in the assault and the military’s subsequent recapturing of the town, according to Armed Conflict Location and Event Data, a non-profit conflict monitor, including foreign workers on a multibillion-dollar Total liquefied natural gas (LNG) project.\n\nRwanda, whose military is better equipped and trained than Mozambique’s, deployed 1,000 troops to Cabo Delgado in July 2021, initially pushing back the militants. Rwanda now has an estimated 4,000 to 5,000 military personnel in the country.\n\nHowever, violence against civilians has never fully abated and has increased this year, according to Acled.\n\nView image in fullscreen Rwandan troops leave for Mozambique to help combat the escalating insurgency. Photograph: Jean Bizimana/Reuters\n\nMore than 100,000 people were displaced in November alone, according to the International Organization for Migration, after Mozambican and Rwandan operations pushed IS fighters south, where the insurgents made their furthest incursion yet into Nampula province.\n\nAt the end of November, more than 350,000 people had been displaced, up from to 240,000 a year earlier.\n\nTomás Queface, a researcher for the independent conflict monitor Acled, said the insurgents had been “very audacious”, adding that Rwandan and Mozambican forces were not as “effective as they used to be … The Rwandans are not doing patrols like they used to do.\n\n“And more importantly, the government wants the Mozambican forces to take the lead in the conflict and then Rwanda stays in the back,” he said.\n\nSo far this year, Acled has recorded 549 deaths in 302 attacks, more than half of them civilians. The civilian death toll, at 290, is already 56% higher than last year. Since 2017, almost 2,800 civilians have been killed, 80% by IS and more than 9% by Mozambican forces.\n\nMozambique’s president, Daniel Chapo, who took office in January after hundreds of people were killed by security forces following disputed elections, told Al Jazeera in September that he wanted dialogue with the insurgents.\n\nView image in fullscreen Daniel Chapo at an election campaign in Maputo, Mozambique, last year. Photograph: José Coelho/EPA\n\nBorges Nhamirre, a researcher at the Institute for Security Studies, a South African thinktank, said dialogue – including with communities in the underdeveloped region – was the key to resolving the conflict.\n\nBut he was sceptical: “Most important is not what politicians say but what politicians do. After eight years … there are no effective initiatives of dialogue.”\n\nHe said much of the military effort was focused on securing the estimated $20bn LNG project, which Total said in October it would resume once it received government approval.\n\nNhamirre said: “First you need to ask what [objective] the Rwandan and Mozambican forces had. If it is to guarantee human security, then we can say that they have failed … But if the objective is to secure the LNG project, then they have achieved some success … The LNG project is definitely more secure than in 2021.”\n\nView image in fullscreen Displaced survivors of an attack by IS-linked militants arriving at Pemba port, Mozambique, in April 2021. Photograph: Luis Miguel Fonseca/EPA\n\nMeanwhile, IS has been abducting children for forced labour, marriage, or to fight. In June, Human Rights Watch (HRW) reported that there had been sharp increase in such kidnappings.\n\nSheila Nhancale, a researcher for HRW, said: “The displacement that is happening now is also increasing the risk of sexual violence, exploitation and abuse, particularly for women and children. Of the 100,000 displaced [in November], 70,000 are children.”\n\nPeople forced to flee are also facing shrinking support. Donors have given $195m to the humanitarian response this year – only 55% of the estimated need – compared with $246m last year, according to the UN’s Office for the Coordination of Humanitarian Affairs.\n\nSebastián Traficante, the head of operations for Médecins Sans Frontières in Mozambique, said displaced people “have to stay in places with very poor conditions, with very poor access to basic services … that are already affected by eight years of conflict.\n\n“They just want this to end. They just want to be able to go back to their homes, to do their farming – they want to have a normal life.”", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Thu, 25 Dec 2025 08:00:34 GMT", "fetched_at": "2025-12-25T08:35:36.838970"}
{"title": "Turkey arrests 115 IS suspects 'planning New Year's attacks'", "link": "https://www.bbc.com/news/articles/cn98w93l8plo?at_medium=RSS&at_campaign=rss", "summary": "Turkish authorities say firearms were seized and efforts to trace further suspected members are continuing.", "content": "Turkey arrests 115 IS suspects 'planning New Year's attacks'\n\n29 minutes ago Share Save Sean Seddon Share Save\n\nGetty Images Prosecutors in Istanbul say attacks targeting non-Muslims this week were being planned by the group\n\nTurkish authorities say they have disrupted planned attacks on Christmas and New Year's events after arresting more than 100 suspected members of the so-called Islamic State group. Mass raids were carried out at 124 addresses across Istanbul, the capital's chief prosecutor said, with firearms, ammunition and \"organisational documents\" seized. Officials said IS supporters had been actively planning attacks across Turkey this week, particularly against non-Muslims. Police detained 115 suspects but efforts are ongoing to trace a further 22, an official statement read.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Thu, 25 Dec 2025 10:19:28 GMT", "fetched_at": "2025-12-25T10:49:20.271454"}
{"title": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address", "link": "https://www.bbc.com/news/articles/cm21728nwxlo?at_medium=RSS&at_campaign=rss", "summary": "The pope also laments the condition of Palestinians during his address to worshippers at the Vatican.", "content": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address\n\nHis plea comes as US-led negotiations on a deal to end the fighting continues.\n\nSpeaking about Ukraine, the Pope said: \"May the clamour of weapons cease, and may the parties involved, with the support and commitment of the international community, find the courage to engage in sincere, direct and respectful dialogue.\"\n\nHe called for an end to conflicts around the world during his Urbi et Orbi address, which is traditionally delivered by the pontiff on Christmas Day to worshippers gathered in Vatican City.\n\nPope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Peter's square.\n\nThe US has sought to mediate between Kyiv and Moscow as it seeks to put together an agreement to end the fighting acceptable to both sides, but direct talks between the warring parties have not taken place during this latest round of diplomatic efforts.\n\nDuring an earlier Christmas Day sermon in St Peter's Basilica, Pope Leo lamented conditions for homeless people the world over, and the damage caused by conflicts.\n\n\"Fragile is the flesh of defenceless populations, tried by so many wars, ongoing or concluded, leaving behind rubble and open wounds,\" said the pope.\n\nHe said the story of the birth of Jesus showed that God had \"pitched his fragile tent\" among the people of the world. \"How, then,\" he asked, turning his attention to the conditions of Palestinians, \"can we not think of the tents in Gaza, exposed for weeks to rain, wind and cold?\"\n\nGaza has been devastated by Israeli bombardment in a two-year war, triggered by Hamas's attack on Israel.\n\nWinter storms have compounded the plight of the territory's 2.1m population, nearly all of whom have been displaced and their homes damaged or destroyed.\n\nAid agencies have called for Israel to allow more tents and urgently needed supplies into Gaza.\n\nCogat, the Israeli military body which controls Gaza's border crossings, has dismissed claims of deliberate aid restrictions, saying almost 310,000 tents and tarpaulins had been delivered since the start of the ceasefire in October.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Thu, 25 Dec 2025 11:41:39 GMT", "fetched_at": "2025-12-25T11:55:03.054791"}
{"title": "Brazil ex-President Jair Bolsonaro's surgery for hernia 'successful'", "link": "https://www.bbc.com/news/articles/c898zxyznxpo?at_medium=RSS&at_campaign=rss", "summary": "The former leader is serving a 27-year sentence for plotting a coup after losing the 2022 presidential election.", "content": "Brazil ex-President Jair Bolsonaro's surgery for hernia 'successful'\n\nAhead of the surgery, Jair Bolsonaro endorsed the candidacy of his eldest son, Flávio, for the 2026 presidential race.\n\nBrazil's Supreme Court granted permission for the 70-year-old to be transferred from the room in the federal police headquarters where he is serving his sentence to a hospital in the capital, Brasília, for the procedure.\n\nThe former leader is serving a 27-year sentence for plotting a coup after he lost the 2022 presidential election to his left-wing rival, Luiz Inácio Lula da Silva.\n\nThe jailed ex-president of Brazil, Jair Bolsonaro, has undergone a successful surgery for a double hernia, his wife Michelle says.\n\nFlávio Bolsonaro had already announced his intention to run for president, but his father's letter has confirmed he has the backing of the older Bolsonaro\n\nThe former president made his decision known in handwritten letter that was read out by Flávio Bolsonaro outside the hospital were his father is being treated.\n\n\"During my life, I have fought tough battles, paying a high price with both my health and my family, to defend what I think is best for our country,\" Bolsonaro wrote.\n\n\"I hand over what is most important in the life of a father - my own son for the mission of rescuing our country, Brazil.\"\n\nFlávio Bolsonaro, a 44-year-old senator, had already announced his decision to run for president for his father's Liberal Party.\n\nEalier this month, he said his father had entrusted him \"with the mission of continuing our national project\". But Jair Bolsonaro's letter, which has been published by Brazilian media, is confirmation the senator has his father's backing.\n\nThe incumbent, President Lula, has already announced he plans to run again in the presidential election scheduled for October 2026.\n\nIn 2022, the presidential election went into a run-off, which saw the older Bolsonaro take on ex-President Lula.\n\nWhen Lula narrowly won, Jair Bolsonaro refused to accept the result and plotted with top military leaders to prevent Lula from taking up office.\n\nWhile the plot failed to enlist enough support from the military to go ahead, it did culminate in the storming of government buildings by Bolsonaro's supporters on 8 January 2023.\n\nBolsonaro was found guilty of coup-plotting and sentenced in September this year.\n\nDespite the guilty verdict, the older Bolsonaro still wields considerable political influence.\n\nBrazil's Congress passed a bill last week to significantly shorten Bolsonaro's sentence but President Lula said he would veto it.\n\nJair Bolsonaro is expected to be transferred back to federal police headquarters as soon as doctors give the go-ahead.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Thu, 25 Dec 2025 18:24:38 GMT", "fetched_at": "2025-12-25T18:40:48.316947"}
{"title": "Zelensky hails 'new ideas' on peace after talks with US envoys", "link": "https://www.bbc.com/news/articles/c4g413yz9g5o?at_medium=RSS&at_campaign=rss", "summary": "Ukraine's leader gives an upbeat assessment after discussing the plan with Steve Witkoff and Jared Kushner.", "content": "Zelensky hails 'new ideas' on peace after talks with US envoys\n\nJust now Share Save Vanessa Buschschlüter Share Save\n\nEPA\n\nUkraine's President Volodymyr Zelensky has given a positive assessment of a conversation he had with US envoys on how to end the Russia-Ukraine war. Zelensky said Thursday's call with Steve Witkoff and Jared Kushner, which lasted nearky an hour, had yielded \"new ideas in terms of formats, meetings, and... timing on how to bring a real peace closer\". He spoke a day after giving details of an updated 20-point peace plan, agreed by US and Ukrainian envoys in Florida. Zelensky said he had asked Witkoff and Kushner to pass along Christmas greetings to US President Donald Trump \"and the entire Trump family\". The Kremlin said it was analysing proposals brought back from the US by a Russian envoy.\n\nTrump and his envoys have been holding talks with both Ukraine and Russia in an effort to reach a deal to end the war which was started by Russia's invasion of Ukraine in February 2022. There appears to have been some progress in recent days with Ukraine's president praising the \"good ideas\" put forward by Witkoff and Trump's son-in-law Kushner. Zelensky said it had been an \"active day\" for his country's diplomacy, as he went into details with the US envoys. He conceded that there was still \"work to be done on sensitive issues\" but added that \"together with the American team, we understand how to put all of this in place\". Zelensky added that the Ukrainian negotiator, Rustem Umerov, would speak again to the two envoys soon. The 20-point peace plan agreed by the US and Ukraine is seen as an update to a plan drafted by Witkoff and Russian negotiators weeks ago, which was widely seen as heavily geared towards Russia's demands. Describing the updated proposal on Wednesday, Zelensky had said it offered Russia the potential withdrawal of Ukrainian troops from the east and the creation of a demilitarised zone in their place. He said the plan now included security guarantees from the US, Nato and Europeans for a co-ordinated military response if Russia invaded Ukraine again. On the key question of Ukraine's eastern Donbas region, Zelensky said a \"free economic zone\" was a potential option. Any area that Ukrainian troops pulled out of would have to be policed by Ukraine, he stressed.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Thu, 25 Dec 2025 21:36:46 GMT", "fetched_at": "2025-12-25T21:42:51.675810"}
{"title": "Heavy rain storms in California leave three dead as of Christmas night", "link": "https://www.bbc.com/news/articles/c1lr3p7n87yo?at_medium=RSS&at_campaign=rss", "summary": "The storms have brought flash flooding and mudslides during a time of busy holiday travel.", "content": "Heavy rain storms in California leave three dead as of Christmas night\n\n18 minutes ago Share Save Madeline Halpert Share Save\n\nReuters\n\nAtmospheric rivers dumped heavy rains on large parts of California, causing floods and mudslides and leaving three dead as of Christmas night, according to local officials. The storms - which were expected to continue through Friday - brought 11 inches (27 cms) of rainfall to some parts of Los Angeles County, prompted evacuations and shut down major roads. Emergency responders have had to perform several rescues, including people stuck in vehicles as flood waters rise. California's Governor Gavin Newsom declared a state of emergency on Wednesday in Los Angeles and other southern California counties. About 100,000 people in the state were without power as of Thursday evening.\n\nHeavy rain threatens US west coast\n\nThe US Weather Prediction Center said on Thursday that \"Numerous flash flooding events are possible\". \"In addition, many streams may flood, potentially affecting larger rivers.\" A 64-year-old man from San Diego, California, was killed on Wedesday morning by a fallen tree, the police department told US media. Another person, a 74-year-old, died from flood waters over the weekend as police tried to rescue him from inside a vehicle in Redding, California, the town's mayor told local news. And on Monday, a woman in her 70s died after she \"was knocked off a rock by a large wave and swept into the ocean\" at MacKerricher State Park in Mendocino County, California, the sheriff's office said in a statement. Evacuation warnings were in effect for some residents of San Bernardino County in southern California, and flash food warnings were issued for those in the San Francisco Bay area on Thursday morning. Wind speeds in the Bay Area topped 100 mph (161kmh) at one observatory near San Jose, the San Francisco Chronicle reported.\n\nReuters\n\nIn Altadena, near Los Angeles, residents experienced a mudslide from flooding in a burn scar area that was less able to absorb water due to the wildfires that scorched the neighbourhood in January of this year, the BBC's US partner CBS News reported. Los Angeles Mayor Karen Bass has also declared an emergency from the storms and warned residents to be cautious on roads during a time of busy holiday travel. \"I am urging all Angelenos to stay safe and be extremely careful on the roads if you absolutely must travel,\" she said in a statement on Wednesday. \"Please do not take this storm lightly.\"", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Thu, 25 Dec 2025 22:39:57 GMT", "fetched_at": "2025-12-25T22:57:57.366865"}
{"title": "US carries out strikes on Nigeria targeting Islamic State militants, Trump says", "link": "https://www.theguardian.com/us-news/2025/dec/25/us-carries-out-airstrikes-against-islamic-state-terrorist-scum-in-nigeria-trump-says", "summary": "<p>President claims strikes targeted militants in country’s north-west, accusing group of attacking Christian communities</p><p>Donald Trump has said the US carried out airstrikes against Islamic State militants in north-west Nigeria on Thursday, after spending weeks decrying the group for targeting Christians.</p><p>The president said in a post on his Truth Social platform: “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!</p> <a href=\"https://www.theguardian.com/us-news/2025/dec/25/us-carries-out-airstrikes-against-islamic-state-terrorist-scum-in-nigeria-trump-says\">Continue reading...</a>", "content": "Donald Trump has said the US carried out airstrikes against Islamic State militants in north-west Nigeria on Thursday, after spending weeks decrying the group for targeting Christians.\n\nThe president said in a post on his Truth Social platform: “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing.”\n\nThe US military’s Africa Command said the strike was carried out in Sokoto state in coordination with the Nigerian authorities. An earlier statement posted by the command on X said the strike had been conducted at the request of Nigerian authorities, but that statement was later removed. Pentagon chief Pete Hegseth said he was “grateful for Nigerian government support + cooperation”.\n\nNigeria’s foreign ministry said the strikes were carried out as part of ongoing security cooperation with the US, involving intelligence sharing and strategic coordination to target militant groups. “This has led to precision hits on terrorist targets in Nigeria by air strikes in the North West,” the ministry said in a post on X.\n\nTrump has previously said he would launch a “guns-a-blazing” US military intervention in Nigeria, claiming that the country’s government has been inadequate in its efforts to prevent attacks on Christians by Islamist groups.\n\nNigeria is officially a secular country but its population is almost evenly divided between Muslims (53%) and Christians (45%). Violence against Christians has drawn significant international attention, especially among the religious right in America, and it has often been framed as religious persecution.\n\nHowever, Nigeria’s government rejects framing the country’s violence in terms of religious persecution, saying in the past that armed groups target both Muslims and Christians, and US claims that Christians face persecution do not represent a complex security situation and ignore efforts to safeguard religious freedom. But the government has previously agreed to work with the US to bolster its forces against militant groups.\n\nMany analysts say the situation is complex and has long roots in the region’s history. In some parts of the country, clashes between itinerant Muslim herders and predominantly Christian farming communities are rooted in competition over land and water.\n\nPriests and pastors have increasingly been kidnapped for ransom, but some experts say this may be a trend driven by criminal incentives rather than religious discrimination.\n\nTrump, who positioned himself as the “candidate of peace” in 2024, campaigned on the promise of extraditing the US from decades of “endless wars”. However his first year back in the White House has been notable for the number of military interventions overseas, with strikes on Yemen, Iran, Syria and others, as well as a huge military buildup in the Caribbean targeting Venezuela.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Thu, 25 Dec 2025 23:41:22 GMT", "fetched_at": "2025-12-26T02:20:46.646311"}
{"title": "US launches deadly strikes against Islamic State in Nigeria, says Trump", "link": "https://www.bbc.com/news/articles/cj69j8l918do?at_medium=RSS&at_campaign=rss", "summary": "The US president accuses the group of killing Christians, as Nigeria’s foreign minister tells the BBC the strikes were a \"joint operation\" and \"nothing to do\" with religion.", "content": "US launches deadly strikes against Islamic State in Nigeria, says Trump\n\nThe US defence department posted an unclassified short video that appears to show a missile being launched from a military vessel\n\nNigerian Foreign Minister Yusuf Maitama Tuggar told the BBC it was a \"joint operation\" targeting \"terrorists\", and it \"has nothing to do with a particular religion\".\n\nTrump said the US military \"executed numerous perfect strikes\", while the US Africa Command (Africom) later reported that Thursday's attack was carried out in co-ordination with Nigeria in the Sokoto state.\n\nThe US leader described IS as \" terrorist scum\", accusing the group of \"targeting and viciously killing, primarily, innocent Christians\".\n\nPresident Donald Trump has said the US launched a \"powerful and deadly strike\" against the Islamic State (IS) group in north-western Nigeria.\n\nTuggar did not rule out further strikes, saying this depended on \"decisions to be taken by the leadership of the two countries\".\n\n'We fear for our souls' - Nigerian farmers need armed guards to protect them from jihadists\n\nAre Christians being persecuted in Nigeria as Trump claims?\n\nMeanwhile, US Defence Secretary Pete Hegseth said on Thursday he was \"grateful for Nigerian government support & cooperation\".\n\nHe did not say at the time which killings he was referring to - but claims of a genocide against Nigeria's Christians have been circulating in recent months in some right-wing US circles.\n\nIn his post on Truth Social late on Thursday, Trump said that \"under my leadership, our Country will not allow Radical Islamic Terrorism to prosper\".\n\nPresident Trump last month ordered the US military to prepare for action in Nigeria\n\nThe US Department of Defense later posted an unclassified short video that appeared to show a missile being launched from a military vessel.\n\nOn Friday morning, the Nigerian foreign ministry said in a statement that the country's authorities \"remain engaged in structured security co-operation with international partners, including the United States of America, in addressing the persistent threat of terrorist and violent extremism.\n\n\"This has led to precision hits on terrorist targets in Nigeria by air strikes in the North West,\" the statement said.\n\nGroups monitoring violence say there is no evidence to suggest that Christians are being killed more than Muslims in Nigeria, which is roughly evenly divided between followers of the two religions.\n\nAn adviser to Nigerian President Bola Tinubu told the BBC at the time that any military action against the jihadist groups should be carried out together.\n\nDaniel Bwala said Nigeria would welcome US help in tackling the Islamist insurgents but noted that it was a \"sovereign\" country.\n\nHe also said the jihadists were not targeting members of a particular religion and that they had killed people from all faiths, or none.\n\nPresident Tinubu has insisted there is religious tolerance in the country and said the security challenges were affecting people \"across faiths and regions\".\n\nTrump earlier announced that he had declared Nigeria a \"Country of Particular Concern\" because of the \"existential threat\" posed to its Christian population. He said \"thousands\" had been killed, without providing any evidence.\n\nThis is a designation used by the US state department that provides for sanctions against countries \"engaged in severe violations of religious freedom\".\n\nFollowing this announcement, Tinubu said his government was committed to working with the US and the international community to protect communities of all faiths.\n\nJihadist groups such as Boko Haram and Islamic State West Africa Province have wrought havoc in north-eastern Nigeria for more than a decade, killing thousands of people - however most of these have been Muslims, according to Acled, a group which analyses political violence around the world.\n\nIn central Nigeria, there are also frequent clashes between mostly Muslim herders and farming groups, who are often Christian, over access to water and pasture.\n\nDeadly cycles of tit-for-tat attacks have also seen thousands killed - but atrocities have been committed on both sides.\n\nHuman rights groups say there is no evidence that Christians have been disproportionately targeted.\n\nLast week, the US said it had carried out a \"massive strike\" against IS in Syria,\n\nThe US Central Command (Centcom) said fighter jets, attack helicopters and artillery \"struck more than 70 targets at multiple locations across central Syria\". Aircraft from Jordan were also involved.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Fri, 26 Dec 2025 04:17:47 GMT", "fetched_at": "2025-12-26T05:01:10.279227"}
{"title": "Indonesians raise white flags as anger grows over slow flood aid", "link": "https://www.bbc.com/news/articles/ckgzwqjpzp4o?at_medium=RSS&at_campaign=rss", "summary": "Weeks after floods ravaged the island of Sumatra, many still do not have access to clean water and food.", "content": "Indonesians raise white flags as anger grows over slow flood aid\n\n6 hours ago Share Save Kelly Ng , Singapore , Riana Ibrahim , BBC Indonesian, Jakarta and Raja Eben Lumbanrau , BBC Indonesian, Jakarta Share Save\n\nAFP via Getty Images People in Indonesia's Aceh province are raising white flags as a call for international solidarity\n\nFor weeks now, angry and distressed residents in Indonesia's westernmost province have been raising white flags over the state's slow response to a series of deadly floods. Triggered by a rare cyclone in November, the deluge killed more than 1,000 people and displaced hundreds of thousands across the island of Sumatra. In Aceh, the worst-hit province which accounted for nearly half of the deaths, many still do not have ready access to clean water, food, electricity and medical supplies. In a sign of just how frustrating managing the crisis has become, the governor of North Aceh broke down publicly earlier this month. \"Does the central government not know [what we're experiencing]? I don't understand,\" a tearful Ismail A Jalil said in front of cameras. But President Prabowo Subianto has refused foreign aid, insisting the situation is \"under control\". \"Indonesia is capable of overcoming this disaster,\" he told his cabinet last week. Prabowo has also so far ignored calls to declare it a national disaster, which would unlock emergency funds and streamline relief efforts.\n\nPrabowo's administration has increasingly been criticised as reactive, disorganised and out of touch – adjectives that some analysts say have come to define his presidency, which he won in February 2024 on the back of populist pledges. Already this year, his flagship billion-dollar free school meals programme has been mired in controversy over mass food poisonings. In August and September, thousands of Indonesians took to the streets over unemployment and rising costs of living, in what were some of the biggest protests the country has seen in decades. And now his government's response to November's floods has become yet another challenge for the leader, even as his approval ratings have held steady at about 78%.\n\nAFP via Getty Images Many in Aceh still do not have ready access to clean water, food and electricity\n\nDesperate calls for help\n\nLast Thursday, dozens of protesters rallied in Aceh's capital, Banda Aceh, waving white flags and demanding that the central government opens the door to foreign aid. Standing among the crowd was a little girl holding a sheet of paper, which read: \"I am just three years old, I want to grow up in a safe and sustainable world.\" Though typically seen as a symbol for surrender, the white flags that have popped up across the province – on broken rooftops, along eroded riverbanks and outside mosques – are a call for international solidarity, protesters say. \"The flags do not mean we are giving in. They are a distress signal to grab the attention of friends outside, to let them know the conditions in Aceh today are very bad,\" Husnul Khawatinnissa, who was at the rally, tells the BBC. Entire villages have been wiped out, while widespread damage to roads and infrastructure has also isolated many communities. Survivors have spoken of sickness and starvation. \"How long more do we have to wash ourselves in mud and floodwaters,\" shouted Nurmi Ali, another demonstrator. Provincial authorities have reached out to the United Nations for support, with the Aceh governor declaring he welcomes help \"from anyone, anywhere\". Prabowo's administration has said relief efforts are under way on a \"national scale\", noting that it has disbursed some 60 trillion rupiah ($3.6bn) for reconstruction efforts.\n\nDisaster strikes again\n\nFor some in Aceh, the situation brings back painful memories of the 2004 Boxing Day tsunami, one of the worst natural disasters ever. A magnitude 9.1 undersea earthquake unleashed a tsunami that triggered waves up to 30m (100 feet) high which slammed into the Indian Ocean coastline that morning, killing an estimated 230,000 people in more than a dozen countries. Aceh, already ravaged by decades of civil war, was among the hardest-hit. Locals say they had only recently finished rebuilding their lives when disaster struck again in November. Relief arrived more quickly after the 2004 tsunami, even though it was far more devastating, they say. Various countries, multilateral agencies like the World Bank, and private organisations poured billions of dollars into the recovery effort. The Indonesian government then set up a dedicated agency to manage funds and aid projects. \"Everyone took action and the community recovered quickly after the tsunami. What we're suffering now is worse,\" said Rindu Majalina, who was a high-school student when the tsunami struck. The mother of three has been struggling to feed her children since the recent floods swallowed their home. Residents \"fight like zombies\" for every bit of supply delivered to her village \"because we are starving\", she added. Several countries have offered aid. The UAE, for instance, sent 30 tonnes of rice and 300 relief packages to Medan, another city hit by the floods – but it was all sent back by authorities following what they described as \"guidance\" from the central government.\n\nGetty Images Prabowo Subianto (centre) and his administration have increasingly been criticised as out of touch", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Thu, 25 Dec 2025 23:09:41 GMT", "fetched_at": "2025-12-26T05:01:10.478342"}
{"title": "Nigeria provided US with intelligence for strikes on Islamist militants, says foreign minister – US politics live", "link": "https://www.theguardian.com/us-news/live/2025/dec/26/us-nigeria-strikes-militants-donald-trump-zelenskyy-ukraine-epstein-us-politics-latest-news-updates", "summary": "<p>Strikes against group accused by Donald Trump of attacking Christian communities took place on Christmas Day in country’s north-west</p><p>Nigeria provided the US with intelligence on jihadists before the strikes that took place in the country on Christmas Day, its foreign ministry said on Friday.</p><p>On Thursday, the US president, <strong>Donald Trump</strong>, said the US military had <a href=\"https://www.theguardian.com/us-news/2025/dec/25/us-carries-out-airstrikes-against-islamic-state-terrorist-scum-in-nigeria-trump-says\">carried out strikes</a> against Islamic State militants in north-west Nigeria, after spending weeks decrying the group for targeting Christians.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/dec/26/us-nigeria-strikes-militants-donald-trump-zelenskyy-ukraine-epstein-us-politics-latest-news-updates\">Continue reading...</a>", "content": "Please turn on JavaScript to use this feature\n\nPlease turn on JavaScript to use this feature\n\nNigeria provided US with intelligence for strikes on militants, foreign minister says\n\n22m ago 06.00 EST Nigeria provided US with intelligence for strikes on militants, foreign minister says\n\nNigeria provided the US with intelligence on jihadists before the strikes that took place in the country on Christmas Day, its foreign ministry said on Friday.\n\nOn Thursday, the US president, Donald Trump, said the US military had carried out strikes against Islamic State militants in north-west Nigeria, after spending weeks decrying the group for targeting Christians.\n\nIn a post on his Truth Social platform, the president said: “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing.”\n\nNow, Nigerian foreign minister, Yusuf Tuggar, has told broadcaster ChannelsTV that he was on the phone with the US secretary of state, Marco Rubio, and that Nigeria “provided” the intelligence.\n\n“We spoke twice. We spoke for 19 minutes before the strike and then we spoke again for another five minutes before it went on,” Tuggar said.\n\nHe added that they spoke “extensively” and that President Bola Tinubu gave “the go-ahead” to launch the strikes.\n\nView image in fullscreen Nigeria’s foreign minister, Yusuf Tuggar. Photograph: Light Oriye Tamunotonye/AFP/Getty Images\n\nTuggar said the strikes would be an “ongoing process” that would also involve other countries. He gave no further details.\n\nTrump has previously said he would launch a “guns-a-blazing” US military intervention in Nigeria, claiming that the country’s government has been inadequate in its efforts to prevent attacks on Christians by Islamist groups.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Fri, 26 Dec 2025 11:00:50 GMT", "fetched_at": "2025-12-26T11:24:02.307121"}
{"title": "Two killed in suspected Palestinian ramming and knife attack in Israel", "link": "https://www.bbc.com/news/articles/c9d9znp22pyo?at_medium=RSS&at_campaign=rss", "summary": "Police say the attacker, from the occupied West Bank, ran over at least one person before stabbing another victim several miles away.", "content": "Two killed in suspected Palestinian ramming and knife attack in Israel\n\nThe attacker drove into people and then carried out a stabbing several miles away, police say\n\nTwo people have been killed in what police say was a \"rolling terror attack\" in northern Israel.\n\nPolice said the attacker ran over a pedestrian in the eastern city of Beit Shean, then drove on before stabbing a woman near Ein Harod, about 8 miles (12.5km) to the west.\n\nThe attacker was shot and wounded by a civilian bystander, the statement said, adding that the suspect was a Palestinian Authority resident in the occupied West Bank.\n\nIsrael's Magen David Adom emergency service said the victim killed in Beit Shean was a 68-year-old man, and the stabbing victim in Ein Harod was an 18-year-old woman.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Fri, 26 Dec 2025 12:32:48 GMT", "fetched_at": "2025-12-26T12:53:57.032356"}
{"title": "Thailand bombs Cambodian border area as ceasefire talks continue", "link": "https://www.bbc.com/news/articles/c4gk15x85jlo?at_medium=RSS&at_campaign=rss", "summary": "Cambodia accuses Thailand of \"indiscriminate attacks\", as negotiators meet for a third day to try to end weeks of renewed fighting.", "content": "Thailand bombs Cambodian border area as ceasefire talks continue\n\nFighting between Thailand and Cambodia broke out again earlier this month\n\nBoth countries have blamed each other for the breakdown of the truce.\n\nAt least 41 people have been killed and almost one million displaced since the hostilities resumed.\n\nFighting broke out again earlier this month after a fragile ceasefire in July halted five days of intense border clashes.\n\nThe Thai Air Force said it had hit a Cambodian \"fortified military position\" after civilians had left the area. Cambodia's defence ministry accused Thailand of \"indiscriminate attacks\" against civilian houses and injuring several people.\n\nThailand carried out air strikes on a disputed border area with Cambodia on Friday, as officials from both sides continued talks to try to end fighting.\n\nSince then, fighting has spread to nearly every province along the 500-mile (800km) border.\n\nCambodia's defence ministry said Friday's attacks were in the north-western Banteay Meanchey province. Up to 40 bombs were dropped by F-16 fighter jets, the ministry said in a Facebook post.\n\nThailand said the action was aimed at controlling Nong Chan village, and was \"carried out efficiently and successfully\".\n\nIt came as Thai and Cambodian negotiators held their third day of talks at a border checkpoint. Defence ministers from both sides are due to join the discussions on Saturday.\n\nThai Prime Minister Anutin Charnvirakul said on Friday that once both sides agreed to each other's conditions, a ceasefire agreement could be signed.\n\n\"I hope this time will be the last one we'd have to sign, so that peace can occur in the area,\" he said, \"[and] people can return to their homes.\"\n\nThe US and China have also been attempting to mediate a new ceasefire.\n\nThe dispute between Thailand and Cambodia dates back more than a century, and there have been sporadic clashes, with soldiers and civilians killed on both sides over the years.\n\nBut in May, tensions ramped up after a Cambodian soldier was killed in a clash. And on 24 July, the situation dramatically escalated after a Cambodian rocket barrage into Thailand, which was followed by Thai air strikes. That set off five days of intense fighting, which left dozens of soldiers and civilians dead.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Fri, 26 Dec 2025 12:18:26 GMT", "fetched_at": "2025-12-26T12:53:57.165597"}
{"title": "Zelensky plans to meet Trump on Sunday for talks on ending Russian war", "link": "https://www.bbc.com/news/articles/cp8zg25p26zo?at_medium=RSS&at_campaign=rss", "summary": "The Ukrainian leader says he will see the US president in Florida to discuss a US plan aimed at ending Russia's war.", "content": "Zelensky plans to meet Trump on Sunday for talks on ending Russian war\n\n6 minutes ago Share Save Sean Seddon Share Save\n\nEPA/Shutterstock Ukraine's president last met President Donald Trump at the White House in October\n\nUkrainian President Volodymyr Zelensky has said he will meet US President Donald Trump in Florida at the weekend, as talks continue on ending Russia's full-scale war. Zelensky said he expected the meeting to take place on Sunday and to focus on a US-brokered 20-point peace plan, as well as separate proposals for US security guarantees. Meanwhile, the Kremlin says President Vladimir Putin's senior aide has held further talks with US officials over the phone, and that Russia has committed to continuing with the negotiations. Russia has spoken of \"slow but steady progress\" in talks but has not commented on Zelensky's offer to withdraw troops from the eastern Donbas, if Russia pulls back too.\n\nUkraine has sought to secure guarantees from the US as part of a deal, and Zelensky has suggested that a demilitarised \"free economic zone\" is a potential option for areas of Donbas that Russia has failed to take by force. On Friday, Zelensky said he had received an update on the latest technical talks from his most senior negotiator, Rustem Umerov. He wrote on social media: \"We are not losing a single day. We have agreed on a meeting at the highest level – with President Trump in the near future. A lot can be decided before the New Year.\" A White House meeting between Zelensky and Trump in February, the first after the US president returned to office, descended into a hostile shouting match, though their most recent meeting at the White House in October was far more amicable.\n\nReuters Ukrainian soldiers were pictured eating a Christmas meal together as fighting continued along the front line\n\nConfirmation of planned top-level talks came after the Ukrainian leader said he had spoken to Trump's chief negotiators, special envoy Steve Witkoff and son-in-law Jared Kushner, for an hour over the phone on Christmas Day. He said the latest round of negotiations had generated \"new ideas\" on how to end the war, and described it as a \"really good conversation\". The White House has proposed establishing what would in effect be a demilitarised zone in eastern Ukraine where both sides agree not to deploy troops - a compromise that would avoid settling the intractable question of legal ownership over the contested territory. Zelensky signalled on Wednesday that if Ukraine were to pull back by up to 40km (25 miles) from the front line in the east to create an economic zone, then Russia would have to do the same from Russian-occupied parts of Ukraine's industrial heartland in the Donbas. Ukraine has secured a number of changes to an earlier 28-point draft plan, which was formulated by Steve Witkoff but widely seen as being favourable to Russia. Zelensky told reporters on Friday that the weekend talks in Florida would focus on several documents, including US security guarantees and a separate economic agreement. However, Zelensky has repeatedly said the question of territory has proved to be the most difficult issue to resolve, along with the future of the Zaporizhzhia nuclear power plant. The White House has proposed Ukraine and Russia split the energy generated by the plant, the largest in Europe. Russian troops currently control it.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Fri, 26 Dec 2025 14:21:38 GMT", "fetched_at": "2025-12-26T14:28:42.777382"}
{"title": "Ex-Malaysia PM Najib Razak given 15-year jail term over state funds scandal", "link": "https://www.bbc.com/news/articles/crk7y27vp1eo?at_medium=RSS&at_campaign=rss", "summary": "Najib was convicted for his role in the billion-dollar scandal involving the country's sovereign wealth fund 1MDB.", "content": "Ex-Malaysia PM Najib Razak given 15-year jail term over state funds scandal\n\nNajib Razak is already serving a six-year jail sentence for a separate case of embezzlement related to 1MDB\n\nThe former PM is already in jail after he was convicted years ago in another case related to 1MDB.\n\nOn Friday afternoon a judge found him guilty in four charges of abuse of power and 21 charges of money laundering.\n\nNajib, 72, was accused of misappropriating nearly 2.3 billion Malaysian ringgit ($569m; £422m) from the nation's sovereign wealth fund 1Malaysia Development Berhad (1MDB).\n\nFormer Malaysian Prime Minister Najib Razak has been jailed for 15 years for abuse of power and money laundering, in his second major trial for a multi-billion-dollar state funds scandal.\n\nFriday's verdict comes after seven years of legal proceedings, which saw 76 witnesses called to the stand.\n\nThe verdict, delivered in Malaysia's administrative capital Putrajaya, is the second blow in the same week to the embattled former leader, who has been imprisoned since 2022.\n\nHe was handed four 15-year sentences on abuse of power charges, as well as five years each on 21 money laundering charges. The jail terms run concurrently under Malaysian law.\n\nOn Monday, the court rejected his application to serve the remainder of his sentence under house arrest.\n\nBut the former prime minister retains a loyal base of supporters, who claim that he's a victim of unfair rulings and who have showed up at his trials calling for his release.\n\nOn Friday, dozens of people gathered outside the court in Putrajaya in support of Najib.\n\nThe 1MDB scandal made headlines across the world when it came to light a decade ago, embroiling prominent figures from Malaysia to Goldman Sachs and Hollywood.\n\nInvestigators estimated that $4.5bn was siphoned from the state-owned wealth fund into private pockets, including Najib's.\n\nNajib's lawyers claim that he had been misled by his advisers - in particular the financier Jho Low, who has maintained his innocence but remains at large.\n\nBut the argument has not convinced Malaysia's courts, which previously found Najib guilty of embezzlement in 2020.\n\nThat year, Najib was convicted of abuse of power, money laundering and breach of trust over 42 million ringgit ($10m; £7.7m) transferred from SRC International - a former unit of 1MDB - into his private accounts.\n\nHe was sentenced to 12 years in prison, but saw his jail term halved last year.\n\nThe latest case concerns a larger sum of money, also tied to 1MDB, received by his personal bank account in 2013. Najib said he had believed the money was a donation from the late Saudi King Abdullah - a claim rejected by the judge on Friday.\n\nSeparately Najib's wife, Rosmah Mansor, was sentenced to ten years in jail in 2022 for bribery. She is free on bail pending an appeal against her conviction.\n\nThe scandal has had profound repercussions on Malaysian politics. In 2018 it led to a historic election loss for Najib's Barisan Nasional coalition, which had governed the country since its independence in 1957.\n\nNow, the recent verdicts has highlighted fissures in Malaysia's ruling coalition, which includes Najib's party United Malays National Organisation (UMNO).\n\nNajib's failed house arrest bid on Monday was met with disappointment from his allies but celebrated by his critics within the same coalition.\n\nMalaysia's Prime Minister Anwar Ibrahim called for politicians on all sides to respect the court's decisions.\n\nFormer Malaysian lawmaker Tony Pua told the BBC's Newsday programme that the verdict would \"send a message\" to the country's leaders, that \"you can get caught for corruption even if you're number one in the country like the prime minister\".\n\nBut Cynthia Gabriel, founding director of Malaysia's Center to Combat Corruption and Cronyism, argued that the country has made little headway in anti-corruption efforts despite the years of reckoning after the 1MDB scandal.\n\nPublic institutions have not been strengthened enough to reassure Malaysians that \"the politicians they put into power would actually serve their interests\" instead of \"their own pockets\", she told Newsday.\n\n\"Grand corruption continues in different forms\", she added. \"We don't know at all if another 1MDB could occur, or may have already occurred.\"", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Fri, 26 Dec 2025 14:15:36 GMT", "fetched_at": "2025-12-26T14:28:42.917232"}
{"title": "Blast at Syrian mosque during Friday prayers leaves at least eight dead", "link": "https://www.bbc.com/news/articles/cx25387dj8no?at_medium=RSS&at_campaign=rss", "summary": "The explosion in Homs targeted a predominantly Alawite area, a sect that has faced crackdowns and violence since the fall of former-President Bashar al-Assad.", "content": "Blast at Syrian mosque during Friday prayers leaves at least eight dead\n\nThe mosque is in the Wadi al-Dhahab neighbourhood, where most people are part of the Alawite ethnoreligious group.\n\nOfficials believe that an explosive was detonated inside the building, Sana reports, citing a security source. While authorities are still searching for the perpetrators, jihadist group Saraya Ansar al-Sunnah has claimed responsibility.\n\nPictures from Syria's state-run news agency, Sana, show the inside of the Imam Ali ibn Abi Talib Mosque with black, scorched walls, smashed windows and blood on the carpet.\n\nAn explosion has killed at least eight people and injured 18 others during Friday prayers inside a mosque in the Syrian city of Homs, the health ministry has said.\n\nSyria's Foreign Ministry condemned the \"terrorist crime\", writing in a statement on X that the \"cowardly act is a blatant assault on human and moral values\" designed to \"undermine the security and stability\" of the country.\n\nSaraya Ansar al-Sunnah, a Sunni extremist group, has said it carried out the attack in collaboration with another unidentified group, using explosives planted at the site.\n\nThe group's vague origins and opaque affiliations, which came to prominence in June when it claimed responsibility for a deadly church bombing in Damascus, have raised questions about its true links and authenticity.\n\nSome observers have speculated that it could be a front for Islamic State group (IS) given the similarity in their messaging and type of targets.\n\nThe latest claim follows a months-long lull in Saraya Ansar al-Sunnah's claimed attacks, which have largely taken the form of alleged targeted killings of minorities and what the group describes as \"remnants\" of the former Syrian government of Bashar al-Assad.\n\nThe blast comes a year after Syrian rebel forces overthrew Assad, who is Alawite. The sect is an offshoot of Shia Islam whose members make up one of the country's biggest religious minorities.\n\nSince then, Syria has seen several waves of sectarian violence, with Alawites fearing reprisals and being subject to crackdowns. Assad fled to Russia, an ally of his regime, where he and his family have been given asylum.\n\nIn March, security forces were accused of killing dozens of Alawites in the coastal province of Latakia, war monitoring group Syrian Observatory for Human Rights (SOHR) reported.\n\nAdditional reporting by BBC Monitoring", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Fri, 26 Dec 2025 15:01:16 GMT", "fetched_at": "2025-12-26T15:27:37.501392"}
{"title": "US warns of more Nigeria strikes as Abuja talks of ‘joint ongoing operations’", "link": "https://www.theguardian.com/world/2025/dec/26/us-warns-of-more-nigeria-strikes-as-abuja-talks-of-joint-ongoing-operations", "summary": "<p>Pete Hegseth says ‘more to come’ as Nigerian minister confirms his country provided intelligence for first wave</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/dec/26/us-nigeria-strikes-militants-donald-trump-zelenskyy-ukraine-epstein-us-politics-latest-news-updates\">US politics live: latest news updates</a></p></li></ul><p>The US defence secretary, Pete Hegseth, has warned of new strikes against Islamic State targets in north-western Nigeria, hours after the US military took action against militant camps in what Donald Trump has characterised as efforts to stop the killing of Christians.</p><p>Hegseth <a href=\"https://x.com/PeteHegseth/status/2004332431542022289?s=20\">wrote on X</a>: “The president was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end. The [Pentagon] is always ready, so ISIS found out tonight – on Christmas. More to come …</p> <a href=\"https://www.theguardian.com/world/2025/dec/26/us-warns-of-more-nigeria-strikes-as-abuja-talks-of-joint-ongoing-operations\">Continue reading...</a>", "content": "The US defence secretary, Pete Hegseth, has warned of new strikes against Islamic State targets in north-western Nigeria, hours after the US military took action against militant camps in what Donald Trump has characterised as efforts to stop the killing of Christians.\n\nHegseth wrote on X: “The president was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end. The [Pentagon] is always ready, so ISIS found out tonight – on Christmas. More to come …\n\n“Grateful for Nigerian government support & cooperation. Merry Christmas!”\n\nNigeria’s foreign minister, Yusuf Tuggar, said on Friday that the US strikes, which came after Trump had accused Nigeria’s government of failing to stop Christians being killed in the country, were “part of joint ongoing operations”.\n\nNigeria is officially secular and its population is almost evenly split between Muslims (53%) and Christians (45%). Violence against Christians has drawn attention from the religious right in the US, which has framed it as persecution. Nigeria’s government has pointed out that armed groups target Christians and Muslims.\n\nNigeria provided the intelligence for the airstrikes in Sokoto state, Tuggar told the country’s Channels Television on Friday. He said he had spoken to his US counterpart, Marco Rubio, for 19 minutes, then called the Nigerian president, Bola Tinubu, to get his go-ahead, before speaking to Rubio again for another five minutes.\n\n“We have been working closely with the Americans,” Tuggar said. “This is what we’ve always been hoping for, to work with the Americans, to work with other countries, to combat terrorism, to stop the death of innocent Nigerians … It’s a collaborative effort.”\n\nThe US military’s Africa Command (Africom) said the strikes in Sokoto state had been carried out in coordination with Nigerian authorities. An earlier Africom statement posted on X and then removed said they had been conducted at the request of Nigerian authorities.\n\nTrump wrote on his Truth Social platform on Thursday: “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing.”\n\nNeither the US nor the Nigerian authorities have said if anyone was killed in the airstrikes. Asked if there would be more, Tuggar said: “You can call it a new phase of an old conflict. For us it is something that is ongoing.”\n\nUS planes conducted surveillance missions over the region earlier this month. It is believed they were using an airport in neighbouring Ghana as a base.\n\nForests in Sokoto, which is bordered by Niger to the north, have been used as bases by gangs of armed bandits and members of Islamic State – Sahel Province (ISSP) , known locally as Lakurawa. Some analysts say the IS branch started when a group of herders joined together to fight bandits in the absence of state support. The state is mostly Muslim.\n\nClashes between Muslim herders and predominantly Christian farming communities in parts of Nigeria have been aggravated by ethnicity and religion, but their roots lie in competition for land and water.\n\nPriests and pastors have increasingly been kidnapped for ransom but some experts say this may be a trend driven by criminal incentives rather than religious discrimination.\n\nTuggar said the operation was about “protecting Nigerians and innocent lives”, not one religion or another. “The president emphasised yesterday, before he gave it the go-ahead, that it must be made clear that … it is a joint operation,” he said. “It is not targeting any religion, nor is it simply in the name of one religion or another.”\n\nA day before the Sokoto strikes, a Christmas Eve suicide bombing at a mosque in north-east Nigeria killed at least five people and left more than 30 seriously injured. The Nigerian army attributed the attack to the jihadist group Boko Haram, which has waged an insurgency in the region for almost two decades, mostly separate to the violence in the north-west.\n\nThere have been almost 6,000 incidents of violence in Nigeria in 2025, about half of them attacks targeting civilians, according to Armed Conflict Location & Event Data (Acled), a non-profit conflict monitor. The state of Katsina, another Muslim-majority state two states to the east of Sokoto, had the highest number of incidents at 706. Sokoto had the fourth highest, 353.\n\nTrump positioned himself as the “candidate of peace” in the 2024 US presidential election, campaigning on a promise of extricating Washington from decades of “endless wars”.\n\nHowever, the first year of his second term in the White House has been notable for a number of military interventions overseas, with strikes on countries including Yemen, Iran and Syria, as well as a huge military buildup in the Caribbean targeting Venezuela.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Fri, 26 Dec 2025 14:41:45 GMT", "fetched_at": "2025-12-26T15:27:37.920127"}
{"title": "Israel becomes first country to recognise Somaliland as sovereign state", "link": "https://www.theguardian.com/world/2025/dec/26/israel-first-country-to-recognise-somaliland-sovereign-state", "summary": "<p>Diplomatic breakthrough comes more than three decades after declaration of independence from Somalia</p><p>Israel has become the first country in the world to recognise Somaliland as a sovereign state, a breakthrough in its quest for international recognition since it declared independence from Somalia 34 years ago.</p><p>The Israeli foreign minister, Gideon Sa’ar, announced on Friday that Israel and Somaliland had signed an agreement establishing full diplomatic relations, which would include the opening of embassies and the appointment of ambassadors.</p> <a href=\"https://www.theguardian.com/world/2025/dec/26/israel-first-country-to-recognise-somaliland-sovereign-state\">Continue reading...</a>", "content": "Israel has become the first country in the world to recognise Somaliland as a sovereign state, a breakthrough in its quest for international recognition since it declared independence from Somalia 34 years ago.\n\nThe Israeli foreign minister, Gideon Sa’ar, announced on Friday that Israel and Somaliland had signed an agreement establishing full diplomatic relations, which would include the opening of embassies and the appointment of ambassadors.\n\nThe recognition is a historic moment for Somaliland, which declared its independence from Somalia in 1991 but until now had failed to be recognised by any UN member states. Somaliland controls the north-west tip of Somalia, where it operates a de facto state, and is bordered by Djibouti to the north and Ethiopia to the west and south.\n\nThe Israeli prime minister’s office said the declaration was “in the spirit” of the Abraham accords, a series of normalisation agreements between Israel and mostly Arab states signed in 2020.\n\nIt posted a video of Benjamin Netanyahu speaking via video call with Somaliland’s president, Abdirahman Mohamed Abdullahi, in which he invited him to visit Israel and described the friendship between the two countries as “historic”. Abdullahi said he would be “glad to be in Jerusalem as soon as possible”.\n\nSa’ar said the recognition came after a year of dialogue between the two countries and that he had instructed Israel’s ministry of foreign affairs to immediately “institutionalise ties between the two countries”.\n\nIsraeli analysts have said that recognition of the breakaway state could be in Israel’s strategic interest, given Somaliland’s proximity to Yemen, where Israel has conducted extensive airstrikes against the Houthi rebels over the past two years.\n\nA report in November by the Institute for National Security Studies, an Israeli thinktank, said: “Somaliland’s territory could serve as a forward base for multiple missions: intelligence monitoring of the Houthis and their armament efforts; logistical support for Yemen’s legitimate government in its war against them; and a platform for direct operations against the Houthis.”\n\nThe Somaliland authorities already host a military base operated by the United Arab Emirates in Berbera, which has a military port and an airstrip for fighter jets and transport aircraft. Analysts have suggested that the base is a key part of the UAE’s anti-Houthi campaign in Yemen.\n\nSomaliland’s president revealed in May that US military officials, including the most senior officer in the Horn of Africa, had visited Somaliland and that another US delegation was expected to visit soon. “It’s a matter of time. Not if, but when and who will lead the recognition of Somaliland,” Abdullahi told the Guardian.\n\nProject 2025, which was published in 2023 and is alleged to have guided much of the doctrine of Donald Trump’s second administration, called for the recognition of Somaliland as a “hedge against the US’s deteriorating position in Djibouti”, where Chinese influence is growing.\n\nThis August, the Texas Republican senator Ted Cruz wrote to Trump asking him to recognise Somaliland. Cruz said Somaliland was an ally of Israel and that it had expressed support for the Abraham accords.\n\nThe US administration is reportedly split over the recognition of Somaliland, with some fearing such a move could endanger military cooperation with Somalia. The US has troops deployed there, where it supports Somali forces in their fight against the Islamist movement al-Shabaab.\n\nSomaliland has a population of a little more than 6.2 million. The breakaway state has a democratic system that has had peaceful transfers of power, though the Washington-based non-profit organisation Freedom House noted an “erosion of political rights and civic space” in recent years, with journalists and opposition figures facing repression from authorities.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Fri, 26 Dec 2025 17:34:20 GMT", "fetched_at": "2025-12-26T17:43:13.946860"}
{"title": "British-Egyptian activist Alaa Abd el-Fattah arrives in UK after travel ban lifted", "link": "https://www.theguardian.com/world/2025/dec/26/british-egyptian-activist-alaa-abd-el-fattah-arrives-in-uk-after-travel-ban-lifted", "summary": "<p>Family say campaigner, who has a son in Brighton, will be able to travel freely between UK and Cairo months after his release from Egyptian jail</p><p>The British-Egyptian dissident Alaa Abd el-Fattah has arrived in London after the Egyptian government lifted a travel ban that it had imposed on him despite <a href=\"https://www.theguardian.com/world/2025/oct/11/i-deserve-to-heal-freed-british-egyptian-activist-alaa-abd-el-fattah-on-his-prison-ordeal-and-next-steps\">releasing him from jail in September</a>.</p><p>Abd el-Fattah had been held in jail nearly continuously for 10 years, mainly due to expressing his opposition to the treatment of dissidents by the Egyptian government. He had been detained in jail two years beyond his five-year sentence as the Cairo authorities refused to recognise the period he held in pre-trial detention as part of his time served.</p> <a href=\"https://www.theguardian.com/world/2025/dec/26/british-egyptian-activist-alaa-abd-el-fattah-arrives-in-uk-after-travel-ban-lifted\">Continue reading...</a>", "content": "The British-Egyptian dissident Alaa Abd el-Fattah has arrived in London after the Egyptian government lifted a travel ban that it had imposed on him despite releasing him from jail in September.\n\nAbd el-Fattah had been held in jail nearly continuously for 10 years, mainly due to expressing his opposition to the treatment of dissidents by the Egyptian government. He had been detained in jail two years beyond his five-year sentence as the Cairo authorities refused to recognise the period he held in pre-trial detention as part of his time served.\n\nA previous attempt by Abd el-Fattah to leave Cairo for London in November after his release from jail, was blocked by the security forces a month ago. He has since been trying to negotiate an agreement whereby he is allowed to travel freely between Cairo and London and not be permanently excluded from Egypt if he came to the UK.\n\nHis arrival in London was announced by his mother, Laila Soueif, on Facebook.\n\nHis sister Mona Seif said: “I can’t believe it’s finally happened and Alaa has made it to London. We thought it was impossible, but here he is. Hundreds of people around the world did so much to help bring this moment about. Alaa is free and we can finally begin to heal as a family.”\n\nThe family believe the agreement will allow him to travel back and forth between the UK and Egypt.\n\nJames Lynch of FairSquare, a human rights organisation that has worked alongside Abd el-Fattah’s family for several years, said: “I’m delighted that Alaa has safely returned to the UK to be reunited with his son after such a lengthy ordeal lasting well over a decade. After everything Alaa and his family have been through, I’m hopeful this marks the beginning of a new chapter for them.”\n\n0:57 Egyptian-British activist Alaa Abd el-Fattah reunited with family after release from prison – video\n\nHis mother twice came close to death when she was admitted to hospital during an extended eight-month hunger strike designed to put pressure on the UK Foreign Office to do more to secure his release.\n\nThe British prime minister, Keir Starmer, made three calls to his Egyptian counterpart, Abdel Fatah al-Sisi, and the UK national security adviser, Jonathan Powell, also personally urged the Egyptians to end his detention. But the Egyptians never allowed British consular visits to jail, saying they did not recognise his dual citizenship status.\n\nChanges in the Egyptian embassy in London may have helped produce a less inflexible stance.\n\nAbd el-Fattah, from a family of human rights activists, became a leading voice during the Arab spring. He has a direct, perceptive, non-sectarian writing style that has won him awards.\n\nHe has a teenage son, Khaled, who lives in Brighton and attends a special educational needs school. The boy visited him in Cairo soon after his release, in what was regarded as a successful reunion.\n\nAbd el-Fattah’s sister, Sana, explained at the time he had been blocked from flying out of Cairo: “We’re really glad to have [Alaa] back in our lives partially free, but he needs to have freedom of movement to live with his son, reunited with him properly.”\n\n“Khaled needs his father. My nephew … is very, very comfortable in his school and his setup in Brighton. We can’t change. We can’t keep creating instability.”\n\nHe had already served a five-year jail sentence passed in September 2019 on charges of “spreading false news” after a much-criticised trial, yet last year his family were told he would not be released until January 2027.\n\nStarmer made no criticism of the justice of Abd el-Fattah’s sentencing. “I’m delighted that Alaa is back in the UK and has been reunited with his loved ones, who must be feeling profound relief,” the prime minister wrote on social media. “I want to pay tribute to Alaa’s family, and to all those that have worked and campaigned for this moment.\n\n“Alaa’s case has been a top priority for my government since we came to office. I’m grateful to President Sisi for his decision to grant the pardon.”", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Fri, 26 Dec 2025 17:57:22 GMT", "fetched_at": "2025-12-26T18:37:41.382868"}
{"title": "Trump supporters hail US strikes in Nigeria as ‘amazing Christmas present’", "link": "https://www.theguardian.com/us-news/2025/dec/26/trump-supporters-nigeria-airstrikes", "summary": "<p>Some even celebrated ‘mass killing’ and the president’s ‘resolve’ in attacking Islamic State targets </p><p>The US’s Christmas Day <a href=\"https://www.theguardian.com/world/2025/dec/26/us-warns-of-more-nigeria-strikes-as-abuja-talks-of-joint-ongoing-operations\">strikes</a> against Islamic State targets in <a href=\"https://www.theguardian.com/world/nigeria\">Nigeria</a> have been met with praise by <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> supporters who for months had been agitating for the president to respond forcefully to the killings of Christians in the country.</p><p>“I can’t think of a better way to celebrate Christmas than by avenging the death of Christians through the justified mass killing of Islamic terrorists,” the far-right political activist Laura Loomer posted on X. “You’ve got to love it! Death to all Islamic terrorists! Thank you.”</p> <a href=\"https://www.theguardian.com/us-news/2025/dec/26/trump-supporters-nigeria-airstrikes\">Continue reading...</a>", "content": "The US’s Christmas Day strikes against Islamic State targets in Nigeria have been met with praise by Donald Trump supporters who for months had been agitating for the president to respond forcefully to the killings of Christians in the country.\n\n“I can’t think of a better way to celebrate Christmas than by avenging the death of Christians through the justified mass killing of Islamic terrorists,” the far-right political activist Laura Loomer posted on X. “You’ve got to love it! Death to all Islamic terrorists! Thank you.”\n\nLoomer said she had been informed by the US defense department – which the Trump administration calls the war department – that the American cruise missile strikes carried out with the Nigerian government’s cooperation had been “a direct response to [IS] jihadi terrorists killing Christians in Nigeria”.\n\nThe US House member Randy Fine, a Florida Republican who in November supported a congressional resolution calling for Nigeria to be designated a “country of particular concern” due to its religious violence, described Thursday’s strikes as an “amazing Christmas present!”\n\n“With Muslim terrorists attacking Christians in Nigeria, Syria, and even Europe – simply for refusing to submit to Islam – the president is showing that we will no longer tolerate these barbarians,” Fine said on X, after suggesting earlier in December that “mainstream Muslims” should be “destroyed”.\n\nThe uniformity of the Republicans’ response comes in contrast to a campaign involving economic pressure as well as airstrikes on alleged drug boats that the Trump administration is waging on Venezuela to oust its president, Nicolás Maduro. Some Republicans have warned that the history of US “regime change” efforts are not promising and have warned against direct military strikes on Venezuela.\n\nAttacks on Christians by Islamic extremist groups in Nigeria such as Boko Haram had been drawing increased attention from US Christian groups that are generally aligned with Trump.\n\n“Do not test President Trump‘s resolved [sic] in this matter,” said a post from the Republican US House member Riley Moore of West Virginia, who introduced the Nigeria-related congressional resolution in November. “Tonight’s strike in coordination with the Nigerian government is just the first step to ending the slaughter of Christians and the security crisis affecting all Nigerians.”\n\nIn further comments on Friday, other Republican lawmakers praised Trump for carrying out the strikes. North Carolina senator Ted Budd, a Republican, said that IS “is responsible for the deaths of thousands of Christians & religious minorities in Nigeria”.\n\nBudd wrote that Trump’s “decisive strikes will save lives & protect religious freedom. May God bless our brave men & women in uniform.”\n\nCongressman Bill Huizenga, a Michigan Republican who recently led a delegation to Nigeria, said that attitudes within the Nigerian government were “beginning to turn in favor of protecting Christians – in addition to taking actions against those terrorizing Christians and moderate Muslims”.\n\nSenator Tom Cotton, an Arkansas Republican, said on X that he commended the Trump administration as well as American troops for “these strikes against bloodthirsty [IS] savages who are not only persecuting Christians, but also have killed many Americans”.\n\nPressure on the administration to act in Nigeria had been building since July, when the US Commission on International Religious Freedom issued an advisory that said the Nigerian government was “often unable to prevent or slow to react to violent attacks by Fulani herders, bandit gangs, and insurgent entities such as JAS/Boko Haram and the Islamic State West Africa Province (ISWAP)”.\n\nIn October, Ted Cruz – a Republican senator from Texas – said the US was able to identify the perpetrators of anti-Christian violence in Nigeria “and I intend to hold them accountable”. Cruz said that since 2009, “over 50,000 Christians in Nigeria have been massacred, and over 18,000 churches and 2,000 Christian schools have been destroyed”.\n\nAt the recent AmericaFest, a four-day gathering of US conservative organized by Turning Point USA, the Trinidadian rap star Nicki Minaj spoke with Charlie Kirk’s widow, Erika Kirk, on the oppression of Christians in Nigeria. She said she loved Nigeria in part because her pastor is Nigerian.\n\n“Hearing that people are being kidnapped – while they’re in church, people are being kidnapped, people are being killed, brutalized, all because of their religion – that should spark outrage in America, and that’s what it’s doing,” Minaj said.\n\nThursday’s strikes in Nigeria come less than a week after the US hit more than 70 Islamic State networks and infrastructure in Syria in response to an attack that killed two American military service members as well as a civilian.\n\nAdm Brad Cooper, commander of the American military’s Central Command (Centcom), said the Syrian strikes were “critical to preventing [IS] from inspiring terrorist plots and attacks against the US homeland”.\n\nHegseth on Friday warned of additional US strikes against IS targets in northern Nigeria.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Fri, 26 Dec 2025 17:50:21 GMT", "fetched_at": "2025-12-26T18:37:41.632250"}
{"title": "Thailand and Cambodia agree ceasefire after weeks of deadly clashes", "link": "https://www.bbc.com/news/articles/c0q5je8048xo?at_medium=RSS&at_campaign=rss", "summary": "Almost one million people have been displaced since hostilities resumed earlier this month.", "content": "Thailand and Cambodia agree ceasefire after weeks of deadly clashes\n\n47 minutes ago Share Save Tabby Wilson Share Save\n\nAP Almost one million people have been displaced since hostilities resumed earlier this month\n\nThailand and Cambodia have agreed to an immediate ceasefire, the defence ministers of the two countries said in a joint statement on Saturday. Both sides have agreed to freeze all troop movements and allow civilians living in border areas to return home, halting weeks of intense border clashes that have killed at least 41 people and displaced almost a million people. The ceasefire took effect at noon local time (05:00 GMT). Once it has held for 72 hours, 18 Cambodian soldiers held by Thailand will also be released, the statement said. The breakthrough came after Thai and Cambodian officials held several days of talks aimed at ending fresh fighting between the two countries.\n\nThe joint statement outlines the terms of \"de-escalation\", which includes ceasing \"attacks on civilians, civilian objects and infrastructures, and military objectives of either side\". \"Both sides must avoid unprovoked firing or advancement or movement of troops towards the other side's positions or troops,\" the statement said. The statement also said that the release of the 18 Cambodian soldiers held by Thailand would be conducted \"in the spirit of the Kuala Lumpur Declaration\", an agreement between the two countries signed at a ceremony attended by US President Donald Trump in October. That ceasefire agreement was broken earlier this month, when fresh clashes erupted. Both sides have since blamed each other for the breakdown of the truce. The Thai army said its troops had responded to Cambodian fire in Thailand's Ubon Ratchathani Province, and a Thai solider had been killed. Cambodia's defence ministry said it was Thai forces that had attacked first, in Preah Vihear province, and insisted that Cambodia did not retaliate. Clashes have continued throughout December. On Friday, Thailand carried out air strikes on a disputed border region in Cambodia. The Thai Air Force said it had hit a Cambodian \"fortified military position\" after civilians had left the area. Cambodia's defence ministry said the strikes were \"indiscriminate attacks\" against civilian houses.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sat, 27 Dec 2025 05:51:10 GMT", "fetched_at": "2025-12-27T06:39:02.238840"}
{"title": "'We will vote but not with our hearts': Inside the election staged by Myanmar's military rulers", "link": "https://www.bbc.com/news/articles/cwyxller1j5o?at_medium=RSS&at_campaign=rss", "summary": "This is the first election since the army's coup in early 2021 - and it is being widely condemned as a sham.", "content": "'We will vote but not with our hearts': Inside the election staged by Myanmar's military rulers\n\n8 hours ago Share Save Jonathan Head South East Asia correspondent, Mandalay, Myanmar Share Save\n\nJonathan Head/ BBC A campaign rally in Mandalay ahead of a controversial election being held by Myanmar's military rulers on 28 December\n\nOn a patch of rough ground near the Irrawaddy River, aspiring member of parliament and retired Lieutenant-General Tayza Kyaw tries to muster some enthusiasm from his audience with a speech promising them better times. He is the candidate for the Union Solidarity and Development Party (USDP), backed by Myanmar's military, in Aungmyaythazan, a constituency in the city of Mandalay. The crowd of 300-400 clutch the branded hats and flags they've been given, but soon wilt in the afternoon heat, some dozing off. Children run and play in between the rows of chairs. Many of these families are victims of the earthquake which badly damaged Mandalay and surrounding areas in March, and are hoping for a handout. They disappear the moment the rally finishes.\n\nA 'sham' election\n\nOn Sunday the people of Myanmar get their first opportunity to vote in an election since the military seized power in a coup nearly five years ago, setting off a devastating civil war. But the poll, already delayed many times by the ruling junta, is being widely condemned as a sham. The most popular party, the National League for Democracy, has been dissolved, and its leader, Aung San Suu Kyi, is locked up in an undisclosed prison. Voting, which will happen in three stages over a period of a month, will not even be possible in large parts of the country still consumed by war. Even where voting is taking place, it is marred by a climate of fear and intimidation.\n\nWhen the BBC tried asking people at the rally in Mandalay what they thought of the election, we were told not to by party officials. They might say the wrong thing, one man explained – they don't know how to speak to journalists. The number of plain-clothes military intelligence officers present there helps explain their nervousness. In a dictatorship which has criminalised liking Facebook pages criticising the election, or using the word revolution, even these staunchly pro-military party activists feared the consequences of allowing a foreign journalist the chance to ask uncensored questions. The same fear lingers on the streets of Mandalay. At a market stall selling fresh river fish the customers all refused to answer what they thought of the election. We have no choice, so we have to vote, one said. The fish seller shooed us away. \"You will bring me trouble,\" she said. Only one woman was brave enough to speak frankly, but we needed to find a private place to meet, and to conceal her identity, just to hear her view of the election. \"This election is a lie,\" she said. \"Everyone is afraid. Everyone has lost their humanity and their freedom. So many people have died, been tortured or fled to other countries. If the military keeps running the country, how can things change?\" She would not vote, she said, but she knew that decision carried risks.\n\nLulu Luo/ BBC Most people we encountered did not want to discuss the election\n\nThe military authorities imposed a new law in July criminalising \"any speech, organising, inciting, protesting, or distributing leaflets in order to destroy a part of the electoral process\". Earlier this month Tayzar San, a doctor and one of the first to organise a protest against the 2021 coup, was also among the first to be charged under the law, after he distributed leaflets calling for a boycott of the election. The junta has offered a reward for information leading to his arrest. In September three young people in Yangon were given sentences of 42 to 49 years each for posting stickers showing a bullet and a ballot box together.\n\nTayzar San/Facebook Tayzar San distributing leaflets boycotting the election\n\n\"Co-operate and crush all those harming the union,\" commands a large red poster looming over the families and couples enjoying a late afternoon stroll under the old red-brick walls of the royal palace in Mandalay. In this menacing climate anything approaching a free vote is unimaginable.\n\nA general's gambit\n\nYet the junta leader Min Aung Hlaing has a spring in his step these days. He seems confident this extraordinary election, where there will be no voting at all in as much as one half of the country, will give him the legitimacy he has failed to acquire during his five catastrophic years in power. He even attended a Christmas mass in Yangon's cathedral and condemned the \"hatred and resentment between individuals\" which led to \"domination, oppression, and violence in human communities\". This, from a man charged by the UN and human rights groups with genocide against Muslim Rohingyas, whose coup set off a civil war which, according to the data analysis group ACLED, has killed 90,000 people.\n\nAFP via Getty Images Myanmar's military ruler Min Aung Hlaing\n\nMin Aung Hlaing's election gambit has the full diplomatic support of China, which, bizarrely for a one-party state, is giving technical and financial support for this multi-party exercise. It is likely to be reluctantly accepted in the rest of Asia too. His army, newly equipped with Chinese and Russian weapons, has been regaining ground lost over the past two years to the various armed groups opposing the coup. He is clearly hoping to include more reconquered territory in the third stage of the election at the end of January. With Aung San Suu Kyi and her NLD out of the picture his USDP is all but guaranteed to win. In the last, free election in 2020, the USDP won only six percent of parliamentary seats. Some observers have noted that Min Aung Hlaing is not popular even within his own regime, or his own party, where his leadership qualities are questioned. He will probably keep the presidency after the election, but his power will, to some extent, be diluted by the resumption of parliamentary politics, albeit without most of the parties that won seats in the 2020 election. The election is clearly viewed by China as an off-ramp, a way for the military to get out of the destructive deadlock caused by its ill-judged coup.\n\n'No-one is ready to compromise'\n\nEven a short distance from the apparently peaceful city life of Mandalay, the deep scars left by Myanmar's civil war, which is still far from over, are visible. On the opposite side of the Irrawaddy River lies the spectacular temple complex at Mingun, once a popular tourist attraction. Getting there requires a short drive along a riverside road, but for the past four years this, like much of the area around Mandalay, has been contested territory, where volunteer People's Defence Forces control many villages and launch ambushes against army convoys. To reach Mingun we needed to get through several checkpoints. We sat in a tea shop with the local police commander to negotiate our passage. He was a young man, wearing the huge strain of his job on his face. He had a revolver stuck in the back of his trousers, and two even younger men – boys, perhaps - carrying military-issue assault rifles sat close by as his bodyguards.\n\nLulu Luo/ BBC Many young men have taken up arms on both sides of this conflict\n\nHe said he had to carry these weapons just to move about the village. On his phone were images of his opponents: young men, raggedly dressed, with an assortment of weapons they may have smuggled from border regions of Myanmar or obtained from dead soldiers and police officers. One group, calling itself the Unicorn Guerrilla Force, was his toughest adversary. They never negotiated, he said. \"If we see each other we always shoot. That's the way it is.\" The election, he added, would not be taking place in most of the villages to the north of him. \"Everyone here has taken sides in this conflict. It is so complicated and difficult. But no-one is ready to compromise.\" After an hour we were told it would be too dangerous to reach Mingun. The PDFs might not know you are journalists, he said.\n\nJonathan Head/ BBC Crowds outside the old royal palace in Mandalay", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Fri, 26 Dec 2025 23:01:59 GMT", "fetched_at": "2025-12-27T06:39:02.409289"}
{"title": "Thousands of US flights disrupted as winter storm looms", "link": "https://www.bbc.com/news/articles/c0je0l55zq3o?at_medium=RSS&at_campaign=rss", "summary": "Heavy snow is expected in New York and southern Connecticut during one of the busiest travel weekends of the year.", "content": "Thousands of US flights disrupted as winter storm looms\n\n5 hours ago Share Save Oliver O'Connell Share Save\n\nGetty Images Up to 9in (23cm) of snow could fall on New York City on Friday\n\nThousands of flights across the US have been cancelled or delayed as the north-east braces for a severe winter storm during the peak holiday travel season. As of Friday night, 1,600 flights across the US had been cancelled and 7,400 had been delayed, according to flight tracking website FlightAware. The most affected airports are John F Kennedy International, Newark Liberty, and LaGuardia, which all serve the New York area. Boston, Chicago, and Toronto, Canada, are also impacted. The National Weather Service issued a winter storm warning from 16:00 local time (21:00 GMT) on Friday until 13:00 on Saturday, with as much as 9in (23cm) of snow expected in New York and southern Connecticut.\n\nJetBlue Airways had cancelled 229 flights, while Delta Air Lines scrapped 241 flights. Republic Airways and Southwest Airlines cancelled 180 and 151 flights respectively. About 100 scheduled flights by American Airlines and United Airlines were also cancelled. On social media, airports were warning travellers to check with their airline to determine the status of their flights.\n\nBloomberg via Getty Images Passengers have been stranded at LaGuardia airport in Queens, New York City\n\nThe heaviest snow was expected between 18:00 local time (23:00 GMT) and midnight. Drivers were warned of hazardous conditions and advised to bring an emergency supply kit. New York Governor Kathy Hochul said people should avoid unnecessary trips, but if they had to travel, they should \"plan ahead, take it slow, and leave plenty of time to get to where you need to go safely\". There were similar warnings from the governors of New Jersey and Connecticut.\n\nThis will be the second significant snowfall of the season for New York City, which was blanketed with several inches on 14 December. Mayor Eric Adams asked people who drove to work on Friday to leave early or consider taking public transport home. Snow ploughs were deployed and ready to begin clearing streets once two inches had accumulated.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sat, 27 Dec 2025 01:36:28 GMT", "fetched_at": "2025-12-27T06:39:02.543168"}
{"title": "Opposition anger as Guinea’s junta leader is frontrunner to be elected president", "link": "https://www.theguardian.com/world/2025/dec/27/guinea-junta-leader-mamady-doumbouya-frontrunner-president-election", "summary": "<p>Mamady Doumbouya accused of betraying his promise to be the restorer of democracy after leading 2021 coup</p><p>In September 2021, a tall, young colonel in the Guinean army announced that he and his comrades had <a href=\"https://www.theguardian.com/world/2021/sep/06/guinea-president-held-in-military-detention-say-army-coup-leaders\">forcibly seized power</a> and toppled the longtime leader Alpha Condé.</p><p>“The will of the strongest has always supplanted the law,” Mamady Doumbouya said in a speech, stressing that the soldiers were acting to restore the will of the people.</p> <a href=\"https://www.theguardian.com/world/2025/dec/27/guinea-junta-leader-mamady-doumbouya-frontrunner-president-election\">Continue reading...</a>", "content": "In September 2021, a tall, young colonel in the Guinean army announced that he and his comrades had forcibly seized power and toppled the longtime leader Alpha Condé.\n\n“The will of the strongest has always supplanted the law,” Mamady Doumbouya said in a speech, stressing that the soldiers were acting to restore the will of the people.\n\nNot long after, Doumbouya announced a 36-month timeline for transition to civilian rule in the resource-rich west African nation on the Atlantic coast, shrugging off pressure from the Economic Community of West African States (Ecowas), which wanted a swifter return to democracy. His actions triggered widespread protests and criticism from opposition groups and civil society, most of whom doubted his vow not to personally run for office.\n\nOn Sunday, 6.7 million eligible voters in Guinea will head to the ballot box for the first presidential election since the 2021 coup. Among the nine candidates are the former minister Abdoulaye Yéro Baldé of the Democratic Front of Guinea and the former junta supporter turned critic Faya Millimono of the Liberal Bloc party.\n\nBut thanks to a controversial referendum in September that led to the adoption of a new constitution allowing him to run and extending presidential terms from five to seven years, the clear frontrunner is Doumbouya.\n\nThe opposition coalition Forces vives de Guinée has called his candidacy a betrayal. “The man who presented himself as the restorer of democracy chose to become its gravedigger,” it said in a statement last month after Doumbouya officially deposited his intent to run with the supreme court.\n\nPolitical upheavals have been a recurring feature in west Africa, a region that has earned the moniker of “coup belt” after seven successful coups and several unsuccessful attempts since 2020. While Guinea has remained under the Ecowas umbrella, fellow juntas in Burkina Faso, Mali and Niger, angered by its post-coup sanctions, have split from the regional bloc to form the pro-Russian Alliance of Sahel States (AES). If it holds, the Guinean election will be the first in any of the junta-run states since 2020.\n\nView image in fullscreen A campaign billboard in Conakry of the Guinean presidential candidate Abdoulaye Yéro Baldé of the Democratic Front of Guinea. Photograph: Souleymane Camara/Reuters\n\nWithin Guinea, many believe the general’s victory is a foregone conclusion, given his consolidation of power since ascending to the presidency and promoting himself to a general. Even now, the presidential race is notable not for those who are on the ballot, but for those who are not.\n\nThe biggest opposition parties remain suspended, and their most prominent leaders have been detained, barred from running or – like the former prime minister Cellou Dalein Diallo of the Union of Democratic Forces of Guinea, are in exile. Many say a climate of fear pervades the country due to the junta’s crackdown against its critics, with several dissidents in jail.\n\nConversely, Doumbouya pardoned the former dictator Moussa Dadis Camara who was given a 20-year sentence for his role in one of Guinea’s most serious human rights atrocities: the 2009 massacre and mass rape of protesters at a stadium in Conakry. The pardon, granted before the final hearing, prompted several human rights groups to write a joint open letter to the junta leader alongside families of victims, urging him to reconsider. That process is now in limbo.\n\nAhead of the vote, Doumbouya has been accumulating goodwill.This month, the shiny new Simandou mine, which has the world’s largest untapped reserve of iron ore, was launched after nearly three decades of delays caused by political instability and corruption. Doumbouya’s government is touting the project as a bridge to prosperity for Guinea and a sign of incoming development, despite mass job losses and environmental complaints.\n\nThe election stakes are high: in the coming years, the multi-layered Simandou mine project – which also includes the construction of ports and a railway – is expected to transform the economy of Guinea, where half of the population lives on below $2 a day. Given existential concerns around transparency, many are waiting to see what the winning government does after the election.\n\n“Our salvation lies in a return to the [proper] constitutional order,” said Abdoulaye Koroma, a presidential candidate for the Rally for Renaissance and Development party.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sat, 27 Dec 2025 08:00:33 GMT", "fetched_at": "2025-12-27T08:34:44.488389"}
{"title": "Poland scrambles jets as Russia strikes Kyiv before US-Ukraine peace talks", "link": "https://www.bbc.com/news/articles/c1dzvpg1341o?at_medium=RSS&at_campaign=rss", "summary": "Poland's military says its air force took a \"preventative\" response to secure its airspace.", "content": "Poland scrambles jets as Russia strikes Kyiv before US-Ukraine peace talks\n\n32 minutes ago Share Save Adam Goldsmith and Tiffany Wertheimer Share Save\n\nReuters A multi-storey building in Ukraine's capital, Kyiv, was one of several damaged overnight\n\nPolish fighter jets have been scrambled on its border with Ukraine, after the Ukrainian capital Kyiv was hit by Russian missiles and drones overnight. Poland's military said its air force took a \"preventative\" response to secure its airspace, after at least one person was killed and 28 others were injured in Kyiv, Ukraine's State Emergency Service reported. As the fighting continues, so does the work to get a peace deal that all sides can agree to. Ukrainian President Volodymyr Zelensky is set to meet Donald Trump in Florida on Sunday. But following the latest Russian strikes, Zelensky has repeated his claim that Russia does \"not want to end the war and is trying to use every opportunity to inflict more pain on Ukraine\".\n\nWriting on Telegram, Zelensky said that Russia directed almost 500 drones and 40 missiles towards Kyiv, targeting energy and civilian infrastructure. Pictures show apartment buildings with gaping holes and homes on fire following the strikes.\n\nReuters A house in Kyiv was also hit, Ukraine's emergency services said\n\nThousands of buildings have had their power cut, Kyiv Mayor Vitali Klitschko said, and many are without heating, as temperatures plummet to below freezing. Ukraine's State Emergency Service said that 68 people were evacuated from a retirement home in the eastern Darnytskyi district. \"Russian representatives are having long conversations, but in reality the Daggers [missiles] and Shaheds [drones] are speaking for them,\" Zelensky wrote on Telegram, saying that Vladimir Putin does not want to end the war. \"This sick activity can only be responded to with really strong steps. America has this opportunity, Europe has this opportunity, many of our partners have this opportunity,\" he wrote, urging allies to show strength against Russian aggression.\n\nThe strikes saw Poland, which shares a 530km-long (320-miles) border with western Ukraine, ready its fighter jets, ground-based air defence systems and radar reconnaissance. The move was \"aimed at securing and protecting the airspace, especially in areas adjacent to the threatened regions,\" Poland's Armed Forces said. Later on Saturday morning, it concluded that there had been no violation of the country's airspace. Meanwhile, Russia's defence ministry said its air defences destroyed seven Ukrainian drones overnight.\n\nReuters The aftermath of the damage in Kyiv", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sat, 27 Dec 2025 09:52:05 GMT", "fetched_at": "2025-12-27T10:26:40.572784"}
{"title": "Nine arrested in Italy for allegedly raising millions for Hamas", "link": "https://www.bbc.com/news/articles/cqxq59np394o?at_medium=RSS&at_campaign=rss", "summary": "Police say the suspects raised around €7m (£6m) for the militant group over more than two years.", "content": "Nine arrested in Italy for allegedly raising millions for Hamas\n\n17 minutes ago Share Save Ian Aikman Share Save\n\nStefano Guidi/Getty Images\n\nItalian police have arrested nine people accused of raising around €7m (£6m) for Hamas over more than two years. The money was ostensibly collected as humanitarian aid for Palestinian civilians, a police statement said, but was instead sent to the militant group via a \"complex fundraising system\". Alongside the arrests, police say they have seized more than €8m (£7m) in assets as part of the investigation. Police say the suspects are \"specifically accused of carrying out financing operations believed to have contributed to terrorist activities\".", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sat, 27 Dec 2025 15:25:18 GMT", "fetched_at": "2025-12-27T15:42:56.668480"}
{"title": "Central African Republic goes to polls as president seeks third term", "link": "https://www.theguardian.com/world/2025/dec/28/central-african-republic-goes-to-polls-as-president-seeks-third-term", "summary": "<p>Opposition hopes to tap into frustrations of people living in country where conflict remains a daily reality</p><p>Central African Republic goes to the polls on Sunday with the president, Faustin-Archange Touadéra, seeking a third term.</p><p>As many as 2.3 million registered voters will cast ballots for what observers are calling a quadruple election: votes for the presidency and parliament as well as local and municipal offices.</p> <a href=\"https://www.theguardian.com/world/2025/dec/28/central-african-republic-goes-to-polls-as-president-seeks-third-term\">Continue reading...</a>", "content": "Central African Republic goes to the polls on Sunday with the president, Faustin-Archange Touadéra, seeking a third term.\n\nAs many as 2.3 million registered voters will cast ballots for what observers are calling a quadruple election: votes for the presidency and parliament as well as local and municipal offices.\n\nSeven candidates are on the ballot for president, including the former prime ministers Anicet Georges Dologuélé and Henri-Marie Dondra, who were given clearance to stand by the constitutional court after initially being banned. Dologuélé was the runner-up in the last two elections – 2015 and 2020 – while Dondra briefly served under the president.\n\nThe opposition hopes to tap into the frustrations of people living in a country where conflict is a daily reality. More than half a million people remain internally displaced within CAR, with a similar number living as refugees in neighbouring countries.\n\nHowever, Touadéra, a former mathematics professor who has been in power since 2016, is widely expected to extend his run in office.\n\nHe went from an academic to a statesman after the then-president, François Bozizé, appointed him prime minister in 2008. Touadéra stayed in that role until 2013, when the administration was toppled by a rebel coalition, as sectarian violence triggered a civil war.\n\nAfter a chaotic three-year transition, Touadéra ran for office, and the perception that he was neutral, independent of the ex-Séléka and anti-Balaka militias, powered his second-round victory.\n\nA peace accord was signed in April with the two main rebel groups, and there is hope the country might be slowly stabilising. There had been “tangible progress to establish peace”, said Lewis Mudge, the central Africa director at Human Rights Watch.\n\nAbdou Abarry, the head of the UN regional 0ffice for central Africa (Unoca) agreed, although added there were still challenges. “This is an opportunity to commend the remarkable recovery of the country, which is laying the foundations for peace consolidation among domestic actors and has undertaken measures to secure its borders, notably with Chad and Cameroon,” he told the UN security council this month.\n\nStill, there are concerns that supply-chain issues and violence could disrupt the vote, especially in some rural areas. The UN peacekeeping mission Minusca, whose mandate was recently renewed until next year, is providing the security and logistical support the state’s crumbling infrastructure cannot manage.\n\nThere are claims the voter list was only published online, and not physically, even though most people have no internet access or electricity. The electoral issues have led to a band of opposition politicians announcing a boycott.\n\nAccording to Mudge, the irregularities could “disenfranchise large segments of the population” and undercut the integrity of the process.\n\nMany people worry that another Touadéra term – a 2023 constitutional referendum not only scrapped term limits but extended presidential mandates from five to seven years – would mean more free roaming for outside interests.\n\nAfter taking office, Touadéra put faith in the Russian mercenary firm Wagner, which provides part of his private security, while Minusca and Rwandan troops helped secure the countryside. Since its arrival in 2018, Wagner’s influence within CAR has grown such that despite the founder Yevgeny Prigozhin’s death, Touadéra has resisted Moscow’s calls to integrate the military contractors within Africa Corps, its successor entity.\n\nRwanda, where the government often mentions the need for “African solutions to African problems”, has taken a different approach from Russia, focusing on smaller business interests in CAR.\n\nIn August, a pro-opposition media outlet claimed the government had evicted its own soldiers from a World Bank-funded youth training centre in Nzila, a village on the outskirts of the capital, Bangui, to clear the way for Rwandan troops to engage in a large livestock farming operation.\n\n“Touadéra is determined to sell off the country piece by piece and sacrifice the youth of the Central African Republic,” the editorial read.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 28 Dec 2025 05:00:00 GMT", "fetched_at": "2025-12-28T05:30:45.412106"}
{"title": "War-torn Myanmar voting in widely criticised 'sham' election", "link": "https://www.bbc.com/news/articles/cy7vly6gm76o?at_medium=RSS&at_campaign=rss", "summary": "Observers say the vote, accompanied by a renewed crackdown on dissent, is meant to entrench the junta's power.", "content": "War-torn Myanmar voting in widely criticised 'sham' election\n\n2 hours ago Share Save Kelly Ng and BBC Burmese , Mandalay Share Save\n\nEPA Myanmar's military is holding a phased election over the next month\n\nMyanmar is voting in an election widely dismissed as a sham, with major political parties dissolved, many of their leaders jailed and as much as half the country not expected to vote because of an ongoing civil war. The military government is holding a phased ballot nearly five years after it seized power in a coup, which sparked widespread opposition and spiralled into a civil war. Observers say the junta, with China's support, is seeking to legitimise and entrench its power as it seeks a way out of the devastating stalemate. More than 200 people have been charged for disrupting or opposing the polls under a new law which carries severe punishments, including the death penalty.\n\nPolling began on Sunday after reports of explosions in at least two regions of Myanmar. Three people were taken to hospital following a rocket attack on an uninhabited house in the Mandalay region in the early hours of Sunday, the chief minister of the region confirmed to the BBC. One of those people is in a serious condition. Separately, more than ten houses were damaged in the Myawaddy township, near the border with Thailand, following a series of explosions late on Saturday. A local resident told the BBC that a child was killed in the attack, and three people were taken to hospital in an emergency condition. Voters have told the BBC that the election feels more \"disciplined and systematic\" than those previously. \"The experience of voting has changed a lot,\" said Ma Su ZarChi, who lives in the Mandalay region. \"Before I voted, I was afraid. Now that I have voted, I feel relieved. I cast my ballot as someone who has tried their best for the country.\" First-time voter Ei Pyay Phyo Maung, 22, told the BBC she was casting her ballot because she believed that voting is \"the responsibility of every citizen\". \"My hope is for the lower classes - right now, the prices of goods are skyrocketing, and I want to support someone who can bring them down for those struggling the most,\" she said. \"I want a president who provides equally for all people.\"\n\nThe Burmese junta has rejected criticism of the polls, maintaining that it aims to \"return [the country] to a multi-party democratic system\". After casting his vote at a highly fortified polling station in the capital, junta chief Min Aung Hlaing told the BBC that the election would be free and fair. \"I am the Commander-in-Chief of the Armed Forces, a civil servant. I can't just say that I want to be president,\" he said, stressing that there are three phases of the election. Earlier this week, he warned that those who refuse to vote are rejecting \"progress toward democracy\".\n\nWin Kyaw Thu/BBC Junta chief Min Aung Hlaing cast his ballot in the capital Nay Pyi Taw\n\nFilm director Mike Tee, actor Kyaw Win Htut and comedian Ohn Daing were among the prominent figures convicted under the law against disrupting polls, which was enacted in July. They were each handed a seven-year jail term after criticising a film promoting the elections, state media reported. \"There are no conditions for the exercise of the rights of freedom of expression, association or peaceful assembly,\" the United Nations' top human rights official Volker Türk said. Civilians are \"being coerced from all sides\", Mr Türk said in a statement on Tuesday, noting that armed rebel groups have issued their own threats asking people to boycott the polls. The military has been fighting on several fronts, against both armed resistance groups who oppose the coup, as well as ethnic armies which have their own militias. It lost control of large parts of the country in a series of major setbacks, but clawed back territory this year following relentless airstrikes enabled by support from China and Russia. The civil war has killed thousands of people, displaced millions more, destroyed the economy and left a humanitarian vacuum. A devastating earthquake in March and international funding cuts have made the situation far worse.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 05:00:19 GMT", "fetched_at": "2025-12-28T06:39:13.904654"}
{"title": "BBC visits Myanmar polling station as civil war rages on", "link": "https://www.bbc.com/news/videos/cwyv4gwyxxwo?at_medium=RSS&at_campaign=rss", "summary": "Voters in Myanmar's election say the poll is taking place in a \"climate of fear\", the \nBBC's South East Asia Correspondent Jonathan Head reports.", "content": "BBC News South East Asia Correspondent Jonathan Head visited a polling station in Myanmar as the country votes in what has widely been called a \"sham\" election.\n\nMajor political parties have been dissolved and many of their leaders jailed almost five years after the military seized power in a coup.\n\nThis sparked widespread opposition, spiralling into the ongoing civil war.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 04:23:42 GMT", "fetched_at": "2025-12-28T06:39:14.064852"}
{"title": "Snow-capped Mount Etna erupts as skiers glide down slopes", "link": "https://www.bbc.com/news/videos/cz7n4px7e41o?at_medium=RSS&at_campaign=rss", "summary": "Scientists say volcanic activity at the site, which frequently erupts, had intensified this week, with craters continuously emitting ash.", "content": "Huge plumes of ash and smoke were filmed erupting from Mount Etna, Sicily on 27 December as skiers used the slopes below.\n\nScientists at the Istituto Nazionale di Geofisica e Vulcanologia said volcanic activity at the site, which frequently erupts, had intensified, with craters continuously emitting ash.\n\nIn response, scientists issued a red Volcano Observatory Notice for Aviation, its highest level, though authorities said flights would continue to operate normally at a nearby airport unless ashfall increased.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 01:40:21 GMT", "fetched_at": "2025-12-28T06:59:49.469941"}
{"title": "Cruise ship hits reef on first trip since leaving passenger on island", "link": "https://www.bbc.com/news/articles/cd9z1k4g40jo?at_medium=RSS&at_campaign=rss", "summary": "The Coral Adventurer is under investigation for the death of Suzanne Rees, who was found dead on a remote island after being left behind by the ship.", "content": "Cruise ship hits reef on first trip since leaving passenger on island\n\n2 hours ago Share Save Tabby Wilson Sydney Share Save\n\nCoral Expeditions\n\nA cruise ship has run aground in Papua New Guinea (PNG), on its first trip following the death of an elderly passenger in late October. The Coral Adventurer is currently under investigation for the death of Suzanne Rees, 80, who died on a remote Australian island after being left behind by the ship. On Saturday, the vessel suffered a \"grounding incident\" off the eastern coast of Papua New Guinea, around 30km (18 miles) from city of Lae, a spokesperson for the ship said. All passengers and crew aboard the cruise ship have been reported safe, and initial inspections have not revealed any damage to the hull. Further inspections will take place on Sunday.\n\nIn a statement to the BBC, a spokesperson for the Australian Maritime Safety Authority (AMSA) said they had not received a distress call from the Coral Adventurer. It added they were monitoring the situation and would support PNG authorities if necessary. No decisions have been made about the current 12-day voyage, which was due to finish on 30 December. There were 80 passengers and 43 crew members aboard the ship at the time of the incident. The 12-day voyage was due to finish on 30 December.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 04:35:10 GMT", "fetched_at": "2025-12-28T06:59:49.608949"}
{"title": "Two killed in Sweden as major storm sweeps across Nordic countries", "link": "https://www.bbc.com/news/articles/cdj817m37rgo?at_medium=RSS&at_campaign=rss", "summary": "Thousands of homes in parts of Finland, Sweden and Norway have been left without power.", "content": "Two killed in Sweden as major storm sweeps across Nordic countries\n\n33 minutes ago Share Save Thomas Mackintosh Share Save\n\nGetty Images The Swedish Meteorological and Hydrological Institute issued alerts for strong winds across large parts of northern Sweden as Storm Johannes hit\n\nTwo people have died in Sweden after a powerful winter storm swept across Nordic countries, causing travel disruption and power outages. The Swedish Meteorological and Hydrological Institute issued alerts for strong winds for large parts of the northern half of the country as Storm Johannes hit. One man in his 50s died after being struck by a tree in the Kungsberget ski resort in the country's south, local media and police reported; while regional utility company, Hemab, said that one of its employees died in an accident \"in the field\". Tens of thousands of homes in Sweden, Norway and Finland have been left without power.\n\nIn Sweden, more than 40,000 homes were affected by power outages and numerous rail services were cancelled, Swedish news agency TT reported. Several flights, rail and ferry services across parts of the Nordic nations have been cancelled. Roads and rail services have also been disrupted due to the storm conditions. In Norway's Nordland region, one of the most northerly counties in the country, the fire department responded to more than 200 weather‑related incidents, broadcaster NRK reported. Storm Johannes cut power to around 23,000 homes in Nordland and a further 9,000 were without electricity in the Inland region, NRK said.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 08:55:35 GMT", "fetched_at": "2025-12-28T09:29:38.682768"}
{"title": "Brigitte Bardot: The blonde bombshell who revolutionised cinema in the 1950s", "link": "https://www.bbc.com/news/articles/c888rzkd0dzo?at_medium=RSS&at_campaign=rss", "summary": "The cocktail of kittenish charm and continental sensuality who swept away the cinematic cobwebs of the 1950s.", "content": "Brigitte Bardot: The blonde bombshell who revolutionised cinema in the 1950s\n\n7 minutes ago Share Save Sam Woodhouse Share Save\n\nHulton Archive/Getty Images Ruthlessly marketed as a sex symbol, Brigitte Bardot put French cinema on the map\n\nBrigitte Bardot, who has died at the age of 91, swept away cinema's staid 1950s' portrayal of women - coming to personify a new age of sexual liberation. On screen, she was a French cocktail of kittenish charm and continental sensuality. One publication called her \"the princess of pout and the countess of come hither\", but it was an image she grew to loathe. Ruthlessly marketed as a hedonistic sex symbol, Bardot was frustrated in her ambition to become a serious actress. Eventually, she abandoned her career to campaign for animal welfare. Years later, her reputation was damaged when she made homophobic slurs and was fined multiple times for inciting racial hatred. Her son also sued her for emotional damage after she said she would have preferred to \"give birth to a little dog\". It was a scar on the memory of an icon, who - in her prime - put the bikini, female desire, and French cinema on the map.\n\nLido/Shutterstock Bardot helped to make the bikini socially acceptable in the 1950s\n\nBrigitte Anne-Marie Bardot was born in Paris on 28 September 1934. She and her sister, Marie-Jeanne, grew up in a luxurious apartment in the plushest district of the city. Her Catholic parents were wealthy and pious, and demanded high standards of their children. The girls' friendships were closely policed. When they broke their parent's favourite vase, they were whipped as a punishment.\n\nRoger Viollet via Getty Images Her parents wanted Brigitte Bardot to become a ballet dancer\n\nWith German troops occupying Paris during World War II, Bardot spent most of her time at home, dancing to records. Her mother encouraged her interest and enrolled her in ballet classes from the age of seven. Her teacher at the Paris Conservatoire described her as an outstanding pupil, and she went on to win awards.\n\nLife as a 'jeune fille'\n\nBut Bardot found life claustrophobic. By the age of 15, she later recalled, \"I was seeking something, perhaps a fulfilment of myself.\" A family friend persuaded her to pose for the cover of Elle, the leading women's magazine in France, and the photographs caused a sensation.\n\nBettmann Archive/Getty Images Brigitte Bardot's early magazine covers redefined fashion and the concept of beauty\n\nAt the time, fashionable women had short hair, carefully matched their accessories, and sported tailored jackets and silky evening wear. Brigitte's hair flowed around her shoulders. With the lithe, athletic body of the ballerina, she was nothing like her fellow models. Pictured in a series of young, modish outfits, she became the personification of a new \"jeune fille\" (young girl) style. At the age of 16, she found herself the most famous cover girl in Paris. Her pictures caught the attention of the film director Marc Allegret, who instructed his assistant, Roger Vadim, to track her down.\n\nQUINIO/Gamma-Rapho via Getty Images Bardot was infatuated with aspiring director Roger Vadim\n\nThe screen tests were not successful, but Vadim - who was six years older - took her on, first as his protégé and then as his fiancée. They began an intense affair, but when Bardot's parents found out, they threatened to send her away to England.\n\nS.N. Pathe Cinema/Getty Images Roger Vadim helped his teenage wife launch her film career\n\nRoger Vadim, her 'wild wolf'\n\nIn retaliation, she attempted to take her own life, but was discovered and stopped just in time. Brigitte was infatuated with the aspiring director. He seemed to her as a \"wild wolf\". \"He looked at me, scared me, attracted me, and I didn't know where I was anymore,\" she later explained.\n\nHulton Archive/Getty Images Bardot and Vadim on their wedding day at the Church of Passy, Paris, 12 December 1952. Vadim sold the pictures of the ceremony to Paris-Match\n\nUnder such pressure, her parents relented, but forbade the couple from marrying until Brigitte was 18. As soon as that milestone was passed, the couple walked down the aisle.\n\nBecoming an icon\n\nVadim began to mould Bardot into the star that he believed she could be. He sold the pictures of their wedding to Paris-Match and instructed her in how to perform in public. He helped his new wife find small roles in a dozen minor films, often playing pouty-yet-innocent female love interests. But, until 1956, she was chiefly famous for posing in bikinis - until then a garment banned in Spain, Italy and much of America for being on the razor edge of decency - and popularising a beehive hairdo. Then came peroxide, and the part that made her a star. That year, Vadim's debut film, And God Created Woman, opened in Paris. It failed to make money in France, but caused uproar in the United States.\n\nMarka/Universal Images Group via Getty Images Bardot created uproar in And God Created Woman\n\nIn a country used to Doris Day, Bardot was a sensation. Her character pursues her sexual appetites, without shame, as men do. She dances barefoot in a trance, her skin glowing with sweat, with her hair worn wild and loose. Her lack of inhibition causes social order to collapse; outside the cinema, the reaction was just as intense. The existentialist Simone de Beauvoir hailed her as an icon of \"absolute freedom\" - raising Brigitte to the status of a philosophy. But the American moral majority mobilised. The film was banned in some states, and newspapers denounced its depravity. To audiences, Bardot became indistinguishable from the character she played. Paris-Match branded her \"immoral from head to toe\". And when Bardot ran off with her co-star, Jean-Louis Trintignant, her image as a wanton libertine was inescapable.\n\nAtlantis Films/Pictorial Parade/Courtesy of Getty Images Existentialist philosophers hailed Bardot as an icon of \"absolute freedom\"\n\nShe divorced Vadim, who reacted as only a Frenchman could. \"I prefer to have that kind of wife,\" he said, \"knowing she is unfaithful, rather than possess a woman who just loved me and no-one else.\" He went on to work with Bardot again, and later live with Catherine Deneuve and marry Jane Fonda.\n\nA reluctant mother\n\nIn 1959, Brigitte - after several love affairs - married the actor Jacques Charrier, with whom she starred in Babette Goes To War. The couple had a son, Nicolas, but Bardot resented her pregnancy: repeatedly punching herself in the stomach and begging a doctor for morphine to induce a miscarriage. \"I looked at my flat, slender belly in the mirror like a dear friend upon whom I was about to close a coffin lid,\" she later recalled.\n\nAFP via Getty Images Bardot resented her pregnancy and was later sued by her son for emotional damage\n\nAfter the inevitable divorce, Nicolas did not see his mother for decades. He sued Bardot for emotional damage when she published an autobiography in which she stated that she would have preferred to \"give birth to a little dog\". Brigitte was now the highest paid actress in France, with some suggesting that she was more valuable in terms of foreign trade than the country's car industry. But she wanted to be taken seriously as an actress. \"I have not had very much chance to act,\" she complained, \"mostly I have had to undress.\" She began to attract the attention of Europe's most respected film-makers, winning critical acclaim in Jean-Luc Godard's powerful, New Wave drama, Le Mépris (Contempt). But the overall quality of her output was mixed, especially when she ventured outside France and into Hollywood. A third marriage, to a millionaire German playboy, was followed by a string of lovers - although, uncharacteristically, she did reject Sean Connery.\n\nBettmann Archive/Getty Images Bardot grew tired of her sex kitten image and quit acting to campaign for animal welfare. \"I have not had very much chance to act,\" she complained, \"mostly I have had to undress.\"\n\nShe made dozens of records, alongside Serge Gainsbourg and Sacha Distel. With Gainsbourg, she recorded the raunchy Je T'aime... Moi Non Plus, although she begged him not to release it. A year later, he re-recorded the song with the British actress, Jane Birkin. It became a huge hit all over Europe, with Bardot's version remaining under wraps for 20 years.\n\nAnimal rights campaigner\n\nAfter nearly 50 films, she announced she was retiring to devote her life to animal welfare in 1973. \"I gave my beauty and my youth to men\", she said. \"I'm going to give my wisdom and experience to animals\".\n\nPhilippe Caron/Sygma/Getty Images\n\nShe raised 3m francs (then about £300,000) to establish the Brigitte Bardot Foundation, by auctioning off her jewellery and film memorabilia. Bardot - or B.B. as she was known in France - campaigned against the annual seal cull in Canada, and irritated some of her countrymen by condemning the eating of horse meat. She became a vegetarian, attacked the Chinese government for \"torturing\" bears, and spent hundreds of thousands on a programme to sterilise Romanian stray dogs.\n\nSygma via Getty Images Bardot campaigned against the culling of seals and the fur trade, among other issues\n\nA troubled end to a troubled life\n\nIn her later years, she was prosecuted on multiple occasions for racial hatred. She objected to the way the Islamic and Jewish faiths slaughter animals for food. But the way she voiced her criticism was unforgivable, and - indeed - illegal. In 1999, she wrote that \"my homeland is invaded by an overpopulation of foreigners, especially Muslims\". This landed Bardot with a huge fine. She went on to criticise interracial marriages and insult gay men who, in her words, \"jiggle their bottoms, put their little fingers in the air, and with their little castrato voices moan about what those ghastly heteros put them through\". Bardot was in court so often that, in 2008, the prosecutor declared that he was \"weary\" of charging her.\n\nGilles BASSIGNAC/Gamma-Rapho via Getty Images Bardot was in court so often that the prosecutor said he was \"weary\" of charging her", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 10:18:57 GMT", "fetched_at": "2025-12-28T10:27:02.614782"}
{"title": "Executions in Iran more than double in 2025, report says", "link": "https://www.bbc.com/news/articles/c3v1g227p4xo?at_medium=RSS&at_campaign=rss", "summary": "The Iran Human Rights (IHR) group says it has verified at least 1,500 executions up until the start of December.", "content": "Executions in Iran more than double in 2025, report says\n\nThe number of executions in Iran in 2025 has more than doubled compared to the amount which took place across the country in 2024.\n\nNorwegian-based Iran Human Rights (IHR) group told the BBC it had verified at least 1,500 executions up until the start of December, adding that many more have taken place since.\n\nLast year, IHR was able to verify 975 executions - although the exact number is never completely clear as Iranian authorities do not give official figures.\n\nHowever, the analysis shows another significant annual rise, and the figures chime with those provided by other monitoring groups.\n\nIran's government has previously defended its use of the death penalty, saying it is limited to only \"the most severe crimes\".", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 12:02:13 GMT", "fetched_at": "2025-12-28T12:52:09.830868"}
{"title": "French cinema actress Brigitte Bardot dies aged 91", "link": "https://www.bbc.com/news/articles/cly92pr8qryo?at_medium=RSS&at_campaign=rss", "summary": "The actress was a symbol of sexual liberation in the 1950s but became increasingly controversial after making homophobic and racist slurs.", "content": "French cinema actress Brigitte Bardot dies aged 91\n\n49 minutes ago Share Save Noor Nanji Culture correspondent Share Save\n\nThomas Samson via Getty Images Brigitte Bardot - pictured here in 2006 - gave up acting to concentrate on animal welfare at the age of 39\n\nFrench actress Brigitte Bardot, who revolutionised 1950s French cinema and became a symbol of sexual liberation, has died age 91. The cinema icon - BB as she was known in her home country - acted in almost 50 films, including And God Created Woman, but retired in 1973 to devote her life to animal welfare. Paying tribute, President Emmanuel Macron said France is mourning \"a legend of the century\", while the Brigitte Bardot Foundation remembered her as a \"world-renowned actress\". Later in life, Bardot's reputation was damaged after she made homophobic slurs and was fined multiple times for inciting racial hatred.\n\nIn a statement, the animal welfare foundation she established said it was announcing her death with \"immense sadness\". The Brigitte Bardot Foundation said she was \"a world-renowned actress and singer, who chose to abandon her prestigious career to dedicate her life and energy to animal welfare and her foundation.\" It did not specify where or when Bardot died. In a tribute on social media, President Macron wrote: \"Her films, her voice, her dazzling glory, her initials, her sorrows, her generous passion for animals, her face that became Marianne, Brigitte Bardot embodied a life of freedom. \"French existence, universal brilliance. She touched us. We mourn a legend of the century.\" Another who paid tribute was French far-right politician Marine Le Pen: \"France loses an exceptional woman, through her talent, her courage, her frankness, her beauty.\" Bardot's husband, whom she married in 1992, was Bernard d'Ormale, a former adviser to the late far-right politician Jean-Marie Le Pen - the father of Marine.\n\nHerbert Dorfman/Corbis via Getty Images Bardot tore up the rule book of French cinema in the 1950s\n\nBrigitte Anne-Marie Bardot was born in Paris in 1934 to a wealthy family, who wanted her to become a ballerina. She was discovered in her teens after posing on the cover of Elle magazine, swiftly becoming a sensation in her home country, and was persuaded to enter the cinema world. She played iconic roles, the most notable in the 1956 film And God Created Woman, directed by her then-husband Roger Vadim, in which she played a sexually liberated woman. The film scandalised the American public and was banned in some US states, while the French existentialist philosopher Simone de Beauvoir hailed her as an icon of \"absolute freedom\".\n\nThrough the late 1950s and 1960s, she became a global phenomenon with roles in The Truth, earning critical acclaim for her dramatic depth; Contempt, a Jean-Luc Godard masterpiece; and Viva Maria!, showcasing her comedic flair alongside Jeanne Moreau. Beyond her most iconic roles, Bardot showcased her versatility in films like Love on a Pillow, where she portrayed a complex, emotionally-torn character, and Two Weeks in September, a romantic drama that highlighted her ability to convey vulnerability. In The Bear and the Doll, she brought playful charm to a comedic role, proving her range across genres. These films, though less celebrated, underscored her ability to captivate audiences in diverse narratives. As well as her work in film, Bardot will also be remembered as a fashion icon, with her blonde tousled hair and bold eyeliner setting beauty trends worldwide. After wearing an off-the-shoulder number in Cannes in 1953, similar styles became known as the Bardot neckline. She was married four times and had one son, Nicolas, with French actor and film producer Jacques Charrier, who died in September. Nicolas later sued his mother for emotional damage after she wrote in an autobiography that she would have preferred to \"give birth to a little dog\".\n\nKeystone-France/Gamma-Keystone via Getty Images Bardot, Jacques Charrier and their three-day-old son Nicolas in 1960\n\nRuthlessly marketed as a hedonistic sex symbol, Bardot was frustrated in her ambition to become a serious actress. At the height of her fame, she announced she was retiring at the age of 39 to devote her life to animal welfare. \"I gave my youth and beauty to men, I give my wisdom and experience to animals,\" Bardot famously declared. In 1986, she launched the Brigitte Bardot Foundation, which works to protect wild and domestic animals. She became a vegetarian, and in 2013 even threatened to apply for Russian citizenship in protest against plans to kill two sick elephants in a French zoo. Reacting to her death, France's oldest animal protection association - The Société Protectrice des Animaux - paid tribute to an \"iconic and passionate figure for the animal cause\".\n\nCharly Hel/Prestige/Getty Images Bardot, pictured here in 2001, became an increasingly controversial figure in her later life", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 13:34:26 GMT", "fetched_at": "2025-12-28T14:24:54.688115"}
{"title": "Spaniards hurl flour, eggs and fireworks in mock battle", "link": "https://www.bbc.com/news/videos/c05834pp6jno?at_medium=RSS&at_campaign=rss", "summary": "The annual food fight festival ''Els Enfarinats'' has left the Spanish town of Ibi covered in flour and egg shells.", "content": "The annual food fight festival ''Els Enfarinats'' has left the Spanish town of Ibi covered in flour and egg shells.\n\nEvery year participants wear military-style costumes and stage a fake coup using eggs, flour and firecrackers.\n\nThe eggers go around asking for \"taxes\" - donations to charity - from local people and if you don't pay you could end up getting splatted.\n\nThe festival, held in the province of Alicante, is more than 200 years old and takes place on the 28 December each year to coincide with the Day of the Innocents - Spain's equivalent of April Fools' Day.\n\nVideo edited by Zahra Fatima and Jack Burgess", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Sun, 28 Dec 2025 17:10:19 GMT", "fetched_at": "2025-12-28T18:40:35.773204"}
{"title": "Kosovo's ruling party wins election after months of political deadlock", "link": "https://www.bbc.com/news/articles/ce3z3w4wy0go?at_medium=RSS&at_campaign=rss", "summary": "The decisive victory for the Albanian nationalist Vetevendosje party means a third term for leader Albin Kurti.", "content": "Kosovo's ruling party wins election after months of political deadlock\n\nVetevendosje won elections in February, but without a majority, and Kosovo has been without a functioning government since then.\n\nThe two main opposition parties, the centre-right Democratic Party of Kosovo (PDK) and the Democratic League of Kosovo (LDK), were on 20.98% and 13.89%, respectively.\n\nWith 90% of the votes counted, the party, whose name means \"self determination\", was on 50.8%, meaning a third term in power for its leader, Albin Kurti.\n\nThe impasse meant there was one big question hanging over this second parliamentary election of the year.\n\nWould voters punish Kurti for the long months of deadlock in the country's National Assembly – or the opposition parties who refused to countenance a coalition with Kurti's left-wing movement?\n\nThe electorate has given a clear answer. This will not be quite enough to deliver enough seats for Kurti to govern without coalition partners. But he should not find it difficult to find support among the MPs from the ethnic minority parties who are guaranteed 20 of the 120 seats in the National Assembly.\n\nIt is the fourth successive victory in parliamentary elections for Vetevendosje. The result is vindication after the opposition parties blocked his attempts to form a government following the previous polls on February 9.\n\nKurti claimed it was \"the greatest victory in the history of the country\" – and said he expected opposition parties to cooperate, rather than frustrate, this time around.\n\nArben Gashi, of the third-placed Democratic League of Kosovo (LDK), indicated that could be possible. \"When voters speak, the result cannot be ignored,\" he posted on social media. \"Reflection and responsible action are required,\" he added.\n\nThere is plenty at stake. Kosovo has missed out on hundreds of millions of euros' worth of European Union funds because of the lack of a functioning government. Kurti also cited potential agreements with the World Bank which would bring the total sum to more than €1bn.\n\nRepairing relations with Kosovo's strongest international supporters, the EU and the US, should also be on the agenda. Kurti angered Brussels and Washington by repeatedly targeting institutions serving Kosovo's Serb minority – from post offices to healthcare facilities. This increased tensions in majority-Serb north Kosovo.\n\nThe EU has finally agreed to remove the punitive measures it imposed in 2023. But it will be looking for Kurti to take a pragmatic approach to the long-stalled normalisation dialogue with Serbia, rather than stick to his usual dogmatic line. Given his frosty relations with Serbia's president, Aleksandar Vucic, this may be a vain hope.\n\nThe fact that Kosovo's voters have resoundingly endorsed such a polarising figure reflects their jaundiced view of the alternatives. Parties connected to the Kosovo Liberation Army dominated government in the decade following 2008's unilateral declaration of independence – but failed to deliver on their promises of prosperity.\n\nOne analyst, Artan Muhaxhiri, noted Vetevendosje's \"countless violations of the constitution, the lack of economic development and the breakdown of relations with allies\" over its years in power.\n\nBut he concluded that \"despite all the shortcomings, citizens have considered the opposition to be more harmful\".", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 00:27:02 GMT", "fetched_at": "2025-12-29T02:22:43.143033"}
{"title": "China to hold military drills around Taiwan as warning to 'separatist forces'", "link": "https://www.bbc.com/news/articles/c87l7xjp235o?at_medium=RSS&at_campaign=rss", "summary": "The drills come days after the US announced the sale of one of its largest weapons packages to Taiwan.", "content": "China to hold military drills around Taiwan as warning to 'separatist forces'\n\n27 minutes ago Share Save Koh Ewe Share Save\n\nReuters Since 2022 Beijing has ramped up military drills in the Taiwan Strait\n\nChina has announced it will hold military drills around Taiwan simulating the seizure and blockade of the island's key areas, as a warning against \"separatist forces\". The army, navy, air force and rocket force would be dispatched for the drills scheduled for Tuesday, which include live-fire exercises, the Chinese military said. Codenamed \"Justice Mission 2025\", the drills are taking place days after the US announced the sale of one of its largest weapons packages to Taiwan worth $11bn (£8.2bn). That move drew sharp protest from Beijing which in turn sanctioned US defence firms. Taiwan's push to ramp up its defence this year has also angered Beijing, which claims the self-ruled island as its territory.\n\nTaiwan's presidential office has criticised the upcoming Chinese drills, calling them a challenge to international norms. Taiwan's defence ministry said that they detected Chinese aircraft and ships around Taiwan on Monday morning, and have deployed their own forces and missile systems to monitor the situation. Its forces are on \"high alert\" to defend Taiwan and \"protect our people\", the ministry said. In a post on Weibo, the Chinese military's Eastern Theater Command - in charge of the Taiwan Strait - described the upcoming military exercise as a \"shield of justice\". \"All those plotting independence will be annihilated upon encountering the shield!\" the post read. While China has long called for the \"peaceful reunification\" with Taiwan, it also has a law stating it will resort to \"non-peaceful means\" to prevent the island's \"secession\". Beijing has accused Taiwan's president Lai Ching-te of pursuing \"Taiwan independence\". The president maintains Taiwan is already a sovereign nation and therefore has no need to formally declare independence. On Sunday, Lai said in a local television interview that Taiwan needed to \"keep raising the difficulty so [China] can never meet the standard\" for an invasion. He also said that his administration was committed to \"maintaining the status quo\" and would not provoke China - though he added that peace relies on \"real strength\". Polls consistently show that most Taiwanese people want the \"status quo\", meaning they neither want to unify with China, nor to formally declare independence.\n\nCCTV Chinese state media published a map released by the military showing Tuesday's drill locations around Taiwan\n\nSince 2022 Beijing has ramped up military drills in the Taiwan Strait, usually in response to what it deems as threats such as former US Speaker Nancy Pelosi's visit to Taiwan in 2022 and Lai's inauguration in 2024. China's last live-fire exercise in the Taiwan Strait, held in April, simulated strikes on key ports and energy facilities, the People's Liberation Army said at the time. Along with the drills, the Chinese military released a series of cartoons depicting Lai as a \"parasite\". This week's military drills are the first to be held under Yang Zhibin, the new chief of the Eastern Theater Command who assumed his role in October. Taiwan holds military exercises of its own, both to prepare its population for an attack and showcase its defences to Beijing. This year's Han Kuang exercise, which took place over 10 days, was the largest and longest one yet. Since taking office, Lai has vowed to boost defence spending and enhance the island's defence capabilities in the face of increasing tensions with Beijing. In October, the Taiwanese president announced the building of a dome-like air defence system to guard against \"hostile threats\" - though he did not explicitly mention China.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 03:33:51 GMT", "fetched_at": "2025-12-29T04:01:43.098359"}
{"title": "John Simpson: 'I've reported on 40 wars but I've never seen a year like 2025'", "link": "https://www.bbc.com/news/articles/cj4qp17e1lqo?at_medium=RSS&at_campaign=rss", "summary": "2025 has been a year of multiple major conflicts and it is becoming clear that one of them has geopolitical implications of unparalleled importance.", "content": "John Simpson: 'I've reported on 40 wars but I've never seen a year like 2025'\n\n57 minutes ago Share Save John Simpson BBC world affairs editor Share Save\n\nBBC\n\nSensitive content: This article contains a graphic description of death that some readers may find upsetting I've reported on more than 40 wars around the world during my career, which goes back to the 1960s. I watched the Cold War reach its height, then simply evaporate. But I've never seen a year quite as worrying as 2025 has been - not just because several major conflicts are raging but because it is becoming clear that one of them has geopolitical implications of unparalleled importance. Ukraine's President Volodymyr Zelensky has warned that the current conflict in his country could escalate into a world war. After nearly 60 years of observing conflict, I've got a nasty feeling he's right.\n\nAFP via Getty Images Ukraine's President has warned that the current conflict in Ukraine could escalate into a world war\n\nNato governments are on high alert for any signs that Russia is cutting the undersea cables that carry the electronic traffic that keeps Western society going. Their drones are accused of testing the defences of Nato countries. Their hackers develop ways of putting ministries, emergency services and huge corporations out of operation. Authorities in the west are certain Russia's secret services murder and attempt to murder dissidents who have taken refuge in the West. An inquiry into the attempted murder in Salisbury of the former Russian intelligence agent Sergei Skrypal in 2018 (plus the actual fatal poisoning of a local woman, Dawn Sturgess) concluded that the attack had been agreed at the highest level in Russia. That means President Putin himself.\n\nThis time feels different\n\nThe year 2025 has been marked by three very different wars. There is Ukraine of course, where the UN says 14,000 civilians have died. In Gaza, where Israel's prime minister, Benjamin Netanyahu promised \"mighty vengeance\" after about 1,200 people were killed when Hamas attacked Israel on 7 October 2023 and 251 people were taken hostage. Since then, more than 70,000 Palestinians have been killed by Israeli military action, including more than 30,000 women and children according to Gaza's Hamas-run health ministry – figures the UN considers reliable. Meanwhile there has been a ferocious civil war between two military factions in Sudan. More than 150,000 people have been killed there over the past couple of years; around 12 million have been forced out of their homes. Maybe, if this had been the only war in 2025, the outside world would have done more to stop it; but it wasn't. \"I'm good at solving wars,\" said US President Donald Trump, as his aircraft flew him to Israel after he had negotiated a ceasefire in the Gaza fighting. It's true that fewer people are dying in Gaza now. Despite the ceasefire, the Gaza war certainly doesn't feel as though it's been solved. Given the appalling suffering in the Middle East it may sound strange to say the war in Ukraine is on a completely different level to this. But it is.\n\nAFP via Getty Images \"I'm good at solving wars,\" said US President Donald Trump\n\nThe Cold War aside, most of the conflicts I've covered over the years have been small-scale affairs: nasty and dangerous, certainly, but not serious enough to threaten the peace of the entire world. Some conflicts, such as Vietnam, the first Gulf War, and the war in Kosovo, did occasionally look as though they might tip over into something much worse, but they never did. The great powers were too nervous about the dangers that a localised, conventional war might turn into a nuclear one. \"I'm not going to start the Third World War for you,\" the British Gen Sir Mike Jackson reportedly shouted over his radio in Kosovo in 1999, when his Nato superior ordered British and French forces to seize an airfield in Pristina after the Russian troops had got there first. In the coming year, 2026, though, Russia, noting President Trump's apparent lack of interest in Europe, seems ready and willing to push for much greater dominance. Earlier this month, Putin said Russia was not planning to go to war with Europe, but was ready \"right now\" if Europeans wanted to. At a later televised event he said: \"There won't be any operations if you treat us with respect, if you respect our interests just as we've always tried to respect yours\".\n\nGetty Images Putin said Russia was not planning to go to war with Europe, but was ready \"right now\" if Europeans wanted to\n\nBut already Russia, a major world power, has invaded an independent European country, resulting in huge numbers of civilian and also military deaths. It is accused by Ukraine of kidnapping at least 20,000 children. The International Criminal Court (ICC) has issued an arrest warrant for Russian President Vladimir Putin for his involvement in this, something Russia has always denied. Russia says it invaded in order to protect itself against Nato encroachment, but President Putin has indicated another motive: the desire to restore Russia's regional sphere of influence.\n\nAmerican disapproval\n\nHe is gratefully aware that this last year, 2025, has seen something most Western countries had regarded as unthinkable: the possibility that an American president might turn his back on the strategic system which has been in force ever since World War Two. Not only is Washington now uncertain it wants to protect Europe, it disapproves of the direction it believes Europe is heading in. The Trump administration's new national security strategy report claims Europe now faces the \"stark prospect of civilisational erasure\". The Kremlin welcomed the report, saying it is consistent with Russia's own vision. You bet it is. Inside Russia, Putin has silenced most internal opposition to himself and to the Ukraine war, according to the UN special rapporteur focusing on human rights in Russia. He's got his own problems, though: the possibility of inflation rising again after a recent cooling, oil revenues falling, and his government having had to raise VAT to help pay for the war.\n\nGetty Images US President Donald Trump and Ukraine's President Volodymyr Zelensky clashed during a meeting at the White House in February 2025\n\nThe economies of the European Union are 10 times bigger than Russia's; even more than that if you add the UK. The combined European population of 450 million, is over three times Russia's 145 million. Still, Western Europe has seemed nervous of losing its creature comforts, and was until recently reluctant to pay for its own defence as long as America can be persuaded to protect it. America, too, is different nowadays: less influential, more inward-looking, and increasingly different from the America I've reported on for my entire career. Now, very much as in the 1920s and 30s, it wants to concentrate on its own national interests. Even if President Trump loses a lot of his political strength at next year's mid-term elections, he may have shifted the dial so far towards isolationism that even a more Nato-minded American president in 2028 might find it hard to come to Europe's aid. Don't think Vladimir Putin hasn't noticed that.\n\nThe risk of escalation\n\nThe coming year, 2026, does look as though it'll be important. Zelensky may well feel obliged to agree to a peace deal, carving off a large part of Ukrainian territory. Will there be enough bankable guarantees to stop President Putin coming back for more in a few years' time? For Ukraine and its European supporters, already feeling that they are at war with Russia, that's an important question. Europe will have to take over a far greater share of keeping Ukraine going, but if the United States turns its back on Ukraine, as it sometimes threatens to do, that will be a colossal burden.\n\nGlobal Images Ukraine via Getty Images If the United States turns its back on Ukraine, that will be a colossal burden for Europe\n\nBut could the war turn into a nuclear confrontation? We know President Putin is a gambler; a more careful leader would have shied away from invading Ukraine in February 2022. His henchmen make bloodcurdling threats about wiping the UK and other European countries off the map with Russia's vaunted new weapons, but he's usually much more restrained himself. While the Americans are still active members of Nato, the risk that they could respond with a devastating nuclear attack of their own is still too great. For now.\n\nChina's global role\n\nAs for China, President Xi Jinping has made few outright threats against the self-governed island of Taiwan recently. But two years ago the then director of the CIA William Burns said Xi Jinping had ordered the People's Liberation Army to be ready to invade Taiwan by 2027. If China doesn't take some sort of decisive action to claim Taiwan, Xi Jinping could consider this to look pretty feeble. He won't want that. You might think that China is too strong and wealthy nowadays to worry about domestic public opinion. Not so. Ever since the uprising against Deng Xiaoping in 1989, which ended with the Tiananmen massacre, Chinese leaders have monitored the way the country reacts with obsessive care. I watched the events unfold in Tiananmen myself, reporting and even sometimes living in the Square.\n\nAFP via Getty Images, Sputnik, Pool President Xi Jinping (centre) has made few outright threats against Taiwan recently\n\nThe story of 4 June 1989 wasn't as simple as we thought at the time: armed soldiers shooting down unarmed students. That certainly happened, but there was another battle going on in Beijing and many other Chinese cities. Thousands of ordinary working-class people came out onto the streets, determined to use the attack on the students as a chance to overthrow the control of the Chinese Communist Party altogether. When I drove through the streets two days later, I saw at least five police stations and three local security police headquarters burned out. In one suburb the angry crowd had set fire to a policeman and propped up his charred body against a wall. A uniform cap was put at a jaunty angle on his head, and a cigarette had been stuck between his blackened lips. It turns out the army wasn't just putting down a long-standing demonstration by students, it was stamping out a popular uprising by ordinary Chinese people. China's political leadership, still unable to bury the memories of what happened 36 years ago, is constantly on the look-out for signs of opposition - whether from organised groups like Falun Gong or the independent Christian church or the democracy movement in Hong Kong, or just people demonstrating against local corruption. All are stamped on with great force. I have spent a good deal of time reporting on China since 1989, watching its rise to economic and political dominance. I even came to know a top politician who was Xi Jinping's rival and competitor. His name was Bo Xilai, and he was an anglophile who spoke surprisingly openly about China's politics. He once said to me, \"You'll never understand how insecure a government feels when it knows it hasn't been elected.\" As for Bo Xilai, he was jailed for life in 2013 after being found guilty of bribery, embezzlement and abuse of power.\n\nJohn Simpson has spent a good deal of time reporting on China since 1989 (pictured in Tiananmen Square, 2016)\n\nAltogether, then, 2026 looks like being an important year. China's strength will grow, and its strategy for taking over Taiwan - Xi Jinping's great ambition - will become clearer. It may be that the war in Ukraine will be settled, but on terms that are favourable to President Putin. He may be free to come back for more Ukrainian territory when he's ready. And President Trump, even though his political wings could be clipped in November's mid-term elections, will distance the US from Europe even more. From the European point of view, the outlook could scarcely be more gloomy. If you thought World War Three would be a shooting-match with nuclear weapons, think again. It's much more likely to be a collection of diplomatic and military manoeuvres, which will see autocracy flourish. It could even threaten to break up the Western alliance. And the process has already started. Top picture credits: AFP / Getty Images", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 03:03:56 GMT", "fetched_at": "2025-12-29T04:01:43.308732"}
{"title": "Mexico train crash kills 13 and injures almost 100", "link": "https://www.bbc.com/news/articles/cx2328e70y7o?at_medium=RSS&at_campaign=rss", "summary": "An investigation is under way after the train derailed as it rounded a bend near the town of Nizanda.", "content": "Mexico train crash kills 13 and injures almost 100\n\n2 hours ago Share Save Harry Sekulich Share Save\n\nAFP via Getty Images The train derailed while rounding a bend near the town of Nizanda, Oaxaca.\n\nAt least 13 people died and almost 100 were injured after a train derailed in Mexico's south-western Oaxaca region, the Mexican navy said. The train, which was travelling between the Gulf of Mexico and the Pacific Ocean, was carrying 241 passengers and nine crew members. A total of 98 were injured, of whom 36 were being treated in hospital, the navy said. The train derailed as it rounded a bend near the town of Nizanda, officials said. Mexico's Attorney General confirmed an investigation was under way.\n\nMexican President Claudia Sheinbaum said five of those injured were in a serious condition. She said top level officials, including the Secretary of the Navy, were travelling to the site of the crash. Photos from the site of the crash showed rescue workers helping passengers alight the train, which had fallen off the rail tracks and partly tilted over the side of a cliff. The Interoceanic train, which connects the Pacific port of Salina Cruz with Coatzacoalcos on the Gulf Coast, had two locomotives and four passenger cars, the navy said. Mexico's navy operates the country's railway network.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 02:15:36 GMT", "fetched_at": "2025-12-29T04:01:43.451758"}
{"title": "Trump says progress made in Ukraine talks but 'thorny issues' remain", "link": "https://www.bbc.com/news/articles/c36z615y443o?at_medium=RSS&at_campaign=rss", "summary": "Both the US president and Zelensky describe talks in Florida as \"great\" and \"terrific\" but the issue of territory remains \"unresolved\".", "content": "Trump says progress made in Ukraine talks but 'thorny issues' remain\n\n5 hours ago Share Save Bernd Debusmann Jr , Washington DC and Harry Sekulich Share Save\n\nReuters\n\nDonald Trump and Volodymyr Zelensky said progress had been made to end the Ukraine war during Florida talks but the US leader added \"one or two very thorny issues\" remained. While both the US and Ukrainian presidents described the talks as \"great\", Trump reiterated that a key sticking point was the question of territory. Russia has previously demanded that Ukraine hand over more land. Addressing reporters at Mar-a-Lago, Zelensky said they had come to an agreement on \"90%\" of a 20-point peace plan, while Trump said a security guarantee for Ukraine was \"close to 95%\" done. Zelensky later said US and Ukrainian teams would meet next week for further talks on issues aimed at ending Russia's nearly four-year war in Ukraine.\n\nReuters\n\n\"We had a substantive conversation on all issues and highly value the progress that the Ukrainian and American teams have made over the past weeks,\" Zelensky said in a statement on the Telegram messaging app. Russia launched a full-scale invasion of Ukraine in February 2022, and Moscow currently controls about 20% of Ukrainian territory. A proposal to turn the Donbas region in eastern Ukraine, which Russia largely controls, into a demilitarised zone remains \"unresolved\", Trump said. \"Some of that land has been taken,\" he told reporters after the meeting. \"Some of that land is maybe up for grabs, but it may be taken over the next period of a number of months.\" Moscow currently controls about 75% of the Donetsk region, and some 99% of the neighbouring Luhansk. The regions are collectively known as Donbas. Russia wants Ukraine to pull back from the small part of the territory it still controls in Donbas, while Kyiv has insisted the area could become a free economic zone policed by Ukrainian forces. The US president has repeatedly changed his own position on Ukraine's lost territories, and in September stunned observers by suggesting that Ukraine might be able to take it back. He later reversed course. \"[That] is a very tough issue,\" he said. \"One that will get resolved.\" Security guarantees for Ukraine are \"95% done\", Trump said, without formally committing to logistical support or troop deployment to help protect Ukraine from future attacks. Trump floated the possibility of trilateral talks between the US, Russia, and Ukraine, saying it could happen \"at the right time\". While the US president is keen to add the Ukraine-Russia war to the list of conflicts he claims to have ended, he cautioned that stalled or scrapped talks that go \"really badly\" could mean that the war continues.\n\nTrump: Agreement on Donbas 'unresolved' but 'getting closer'", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 02:06:51 GMT", "fetched_at": "2025-12-29T06:50:56.089553"}
{"title": "'There are many challenges': Syrians in Turkey consider return after fall of Assad", "link": "https://www.bbc.com/news/articles/cd74pxvrp10o?at_medium=RSS&at_campaign=rss", "summary": "Syrians in Turkey are weighing up whether it is the right time to return to their homeland.", "content": "'There are many challenges': Syrians in Turkey consider return after fall of Assad\n\n42 minutes ago Share Save Orla Guerin Senior International Correspondent in Gaziantep, Turkey Share Save\n\nBBC Aya Mustafa wants to return home but not yet\n\nThe pull of home can be strong – even when it is a place you can't remember. That is how it is for Ahmed, 18. He emerges from a mosque in the heart of Gaziantep in south-east Turkey - not far from the Syrian border - wearing a black T-shirt with \"Syria\" written on the front. His family fled his homeland when he was five years old, but he is planning to go back in a year or two at most. \"I am impatient to get there,\" he tells me. \"I am trying to save money first, because wages in Syria are low.\" Still, he insists the future will be better there. \"Syria will be rebuilt and it will be like gold,\" he says.\n\nIf he goes back, he will be following in the footsteps of more than half a million Syrians who have left Turkey since the ousting of Syria's long-time dictator, Bashar al-Assad, in December 2024. Many had been here since 2011, when civil war began devouring their country. In the years that followed, Turkey became a safe haven, taking in more Syrians than any other country. The number reached 3.5 million at its peak, causing political tension and - on occasion - xenophobic attacks. Officially, no Syrian will be forced to go, but some feel they are being pushed - by bureaucratic changes, and by a waning welcome. Civil society organisations \"are getting the message from the authorities that it's time to go\", says a Syrian woman who did not want to be named. \"I have a lot of good Turkish friends. Even they and my neighbours have asked why I am still here. Of course we will go back, but in an organised way. If we all go back together, it will be chaos.\"\n\nGetty Images Bashar al-Assad was overthrown in December 2024\n\nAya Mustafa, 32, is eager to leave - but not yet. We meet under a winter sun by the stone walls of a castle, which has towered over Gaziantep since the Byzantine era. Her hometown, Aleppo, is less than two hours' drive away. She says going back is a constant topic of conversation in the Syrian community. \"Every day, every hour, we speak about this point,\" says Aya, whose family were lawyers and teachers back home, but had to start again in Turkey, baking and hairdressing to earn a living. \"We are talking about how we can return, and when, and what we can do. But there are many challenges, to be honest. Many families have children who were born here and can't even speak Arabic.\" Then there is the level of destruction in new Syria - where war has done its worst - and where the interim president, Ahmed Al Sharaa, is a former senior leader of Al Qaeda who has worked to reinvent his image. Aya saw the ruins of Aleppo for herself when she went back to visit. Her family home is still standing but now occupied by someone else. \"It's a big decision to go back to Syria,\" she says, \"especially for people with elderly relatives. I have my grandmother and my disabled sister. We need the basics like electricity and water and jobs to survive there.\" For now, she says, her family can't survive in Syria, but they will return in time. \"We believe that day will come,\" she says, with a broad smile. \"It will take some years [to rebuild]. But in the end, we will see everyone in Syria.\"\n\nAFP via Getty Images Syria's interim President, Ahmed Al Sharaa, is a former leader of Al Qaeda who has worked to reinvent his image\n\nA short drive away, we get a very different view from a Syrian family of four - father, mother and two teenage sons. The father - who does not want to be named - runs an aid organisation helping his fellow countrymen. Over glasses of tea and helpings of baklava, I ask if he and his family would move back. His response is swift and adamant. \"No, not for me and for my family,\" he says. \"And the same goes for my organisation. We have projects inside Syria, and we hope to extend that activity. But my family and my organisation will stay here in Turkey.\" Asked why, he lists problems with the economy, security, education and the health system. Syria's interim government \"hasn't any experience to deal with the situation\", he tells me. \"Some ask us to give them a chance, but one year has passed and the indications are not good.\" He too has visited the new Syria, and, like Aya, was not reassured. \"The security situation is very bad,\" he says. \"Every day there are killings. Regardless of who the victims are, they have souls.\" His voice softens when he speaks of his 80-year-old father in Damascus, who hasn't seen his grandsons for 12 years, and may never see them again. For now, he and his family can remain in Turkey, but he's already making contingency plans in case government policy changes. \"Plan A is that we will stay here in Turkey,\" he says. \"If we cannot, I'm thinking about plan B, C and even D. I am an engineer, always planning.\" None of those plans involve a return to Syria.\n\nIf going home is hard, staying in Turkey isn't easy either. Syrians have \"temporary protection\" that comes with restrictions. They are not supposed to leave the cities where they are first registered. Work permits are hard to get, and many are in low paid jobs, living on the margins. Turkish President Recep Tayyip Erdogan - who backed the uprising against Assad - has insisted that no Syrian will be driven out, but refugee advocates say there are growing pressures beneath the surface. They point to the ending of free medical care for Syrians from January, and new government regulations which make it more expensive to hire them. \"These new elements cast a shadow over how voluntary returns are,\" says Metin Corabatir, who heads an independent Turkish research centre on asylum and migration, IGAM. And he says presidential and parliamentary elections – due by 2028 – may be another threat for Syrians here. \"Normally President Erdogan is their main protector,\" Mr Corabatir tells me. \"He says they can stay as long as they want. And he repeated this after the regime changed. But if there is an election, and a political gain for the AKP [ruling party] to make, there might be some policy changes.\"\n\nGetty Images More than half a million Syrians have left Turkey since the ousting of Assad", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 06:05:53 GMT", "fetched_at": "2025-12-29T06:50:56.249882"}
{"title": "Thailand accuses Cambodia of breaking newly signed ceasefire deal", "link": "https://www.bbc.com/news/articles/c9w7wgrk01do?at_medium=RSS&at_campaign=rss", "summary": "The ceasefire took effect at noon local time (05:00 GMT) on Saturday.", "content": "Thailand accuses Cambodia of breaking newly signed ceasefire deal\n\n18 minutes ago Share Save Yvette Tan Share Save\n\nGetty Images The Thai army said than more than 250 unmanned aerial vehicles (UAVs) were detected flying from the Cambodian side\n\nThailand's army has accused Cambodia of breaching a newly-signed ceasefire deal reached after weeks of deadly clashes that forced nearly one million people from their homes. In a statement, the Thai army said than more than 250 unmanned aerial vehicles (UAVs) were detected flying from the Cambodian side on Sunday night. The ceasefire took effect at noon local time (05:00 GMT) on Saturday. Both sides agreed to freeze the front lines where they are now, ban reinforcements and allow civilians living in border areas to return as soon as possible. It had been seen as a breakthrough, which came after days of talks between both countries, with diplomatic encouragement from China and the US.\n\nIn a statement on Monday, the Royal Thai Army said Cambodia's actions \"constitute provocation and a violation of measures aimed at reducing tensions\", adding that they were \"inconsistent\" with the terms of the ceasefire. It also said it \"may need to reconsider\" the release of 18 Cambodian soldiers held in Thailand since July. Thailand would be \"obliged to act in accordance... [if] violations of agreements and national sovereignty continue\", it added. Cambodia has not yet commented. It comes just hours after China's Foreign Minister Wang Yi praised the \"hard-won\" ceasefire, and US President Donald Trump praised the \"rapid and fair conclusion\".", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 10:38:29 GMT", "fetched_at": "2025-12-29T10:57:21.442494"}
{"title": "Trump to meet Netanyahu in Florida as focus turns to Middle East issues", "link": "https://www.bbc.com/news/articles/cwypyq9dvggo?at_medium=RSS&at_campaign=rss", "summary": "They are set to discuss Iran, Lebanon, Syria and Gaza, where the Trump administration wants to see the ceasefire enter its second stage in January.", "content": "Trump to meet Netanyahu in Florida as focus turns to Middle East issues\n\n1 hour ago Share Save Emir Nader Jerusalem Share Save\n\nReuters\n\nUS President Donald Trump will turn his focus to the Middle East on Monday, as he hosts Israeli Prime Minister Benjamin Netanyahu in Florida for talks that are expected to cover Gaza and a range of other pressing issues. Any decisions made could have a potentially momentous impact on questions that determine the future of the region. The US has been Israel's strongest military and political backer throughout two years of war in Gaza and many are now looking to the meeting as a test of the leaders' relationship and how aligned they are on key topics. It will be their sixth meeting since Trump's return to office 11 months ago.\n\nAmong the expected points of discussion is the future of relations with Syria's new government, Iranian rearmament, and Hezbollah's role in Lebanon. Perhaps most critically, they will discuss progress of the Gaza ceasefire deal, where Israel's government has taken several positions diverging from those of the US government.\n\nThe talks will take place as storms continue to lash Gaza, where hundreds of thousands of displaced Palestinians remain living in basic tents that offer little protection from the cold and flooding. On Monday, the death of a two-month-old baby due to the severe cold was reported by the Hamas-run health ministry, bringing the total killed by the wintry weather since 10 December to three, while another 17 people have been killed by damaged buildings collapsing in the storms. The UN and numerous aid agencies have accused Israel of not meeting its ceasefire obligations by continuing to restrict full access to basic supplies and equipment. Israel has said it is meeting its obligations in facilitating an increase in aid deliveries. The Trump administration wants to see the ceasefire progress to its second phase in January, whereby a Palestinian technocratic government would be established alongside the deployment of an international security force, Hamas would disarm, Israeli troops would withdraw, and the reconstruction of the devastated territory would begin. Critics have suggested that Netanyahu may instead seek to delay the progress of the ceasefire, saying he does not want to engage seriously with questions of a political future for Palestinians and will instead push for Hamas to fully disarm before Israeli troops withdraw from Gaza. Hamas officials have repeatedly said that its full disarmament should take place alongside progress towards an independent Palestinian state. The 20-point peace plan promoted by Trump and signed by both Israel and Hamas recognises Palestinian aspirations to a sovereign state, however Netanyahu and his ministers have consistently rejected Palestinian statehood since the ceasefire came into effect in October. Last week, Defence Minister Israel Katz said his country would build settlements in Gaza and would \"never fully withdraw\" from the territory even if Hamas disarms, despite this being a key tenet of the ceasefire deal.\n\nReuters Recent winter weather in Gaza has reportedly caused 20 deaths due to the collapse of damaged buildings or exposure to cold", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Mon, 29 Dec 2025 11:52:16 GMT", "fetched_at": "2025-12-29T13:03:28.384765"}
