{"title": "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/index.html", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 12:44:51 GMT", "fetched_at": "2025-12-23 14:27:33.271814"}
{"title": "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/h_8d51e3ae2714edaa0dace837305d03b8", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "2025-12-23 14:27:33.271818", "fetched_at": "2025-12-23 14:27:33.271821"}
{"title": "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory", "link": "https://www.cnn.com/2023/04/17/media/dominion-fox-news-allegations/index.html", "description": "• Fox-Dominion trial delay 'is not unusual,' judge says\n• Fox News' defamation battle isn't stopping Trump's election lies", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Mon, 17 Apr 2023 16:01:11 GMT", "fetched_at": "2025-12-23 14:27:33.271826"}
{"title": "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'", "link": "https://www.cnn.com/2023/04/18/media/fox-dominion-settlement/index.html", "description": "The judge just announced in court that a settlement has been reached in the historic defamation case between Fox News and Dominion Voting Systems.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 08:28:17 GMT", "fetched_at": "2025-12-23 14:27:33.271832"}
{"title": "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement", "link": "https://www.cnn.com/videos/politics/2023/04/18/jake-tapper-dominion-lawsuit-settlement-fox-news-statement-lead-vpx.cnn", "description": "A settlement has been reached in Dominion Voting Systems' defamation case against Fox News, the judge for the case announced. The network will pay more than $787 million to Dominion, a lawyer for the company said.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Tue, 18 Apr 2023 21:17:44 GMT", "fetched_at": "2025-12-23 14:27:33.271838"}
{"title": "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/index.html", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 12:44:51 GMT", "fetched_at": "2025-12-23 14:31:55.018968"}
{"title": "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell", "link": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/h_8d51e3ae2714edaa0dace837305d03b8", "description": "No summary", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "2025-12-23 14:31:55.018974", "fetched_at": "2025-12-23 14:31:55.018976"}
{"title": "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory", "link": "https://www.cnn.com/2023/04/17/media/dominion-fox-news-allegations/index.html", "description": "• Fox-Dominion trial delay 'is not unusual,' judge says\n• Fox News' defamation battle isn't stopping Trump's election lies", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Mon, 17 Apr 2023 16:01:11 GMT", "fetched_at": "2025-12-23 14:31:55.018982"}
{"title": "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'", "link": "https://www.cnn.com/2023/04/18/media/fox-dominion-settlement/index.html", "description": "The judge just announced in court that a settlement has been reached in the historic defamation case between Fox News and Dominion Voting Systems.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Wed, 19 Apr 2023 08:28:17 GMT", "fetched_at": "2025-12-23 14:31:55.018988"}
{"title": "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement", "link": "https://www.cnn.com/videos/politics/2023/04/18/jake-tapper-dominion-lawsuit-settlement-fox-news-statement-lead-vpx.cnn", "description": "A settlement has been reached in Dominion Voting Systems' defamation case against Fox News, the judge for the case announced. The network will pay more than $787 million to Dominion, a lawyer for the company said.", "category": "politics", "source": "http://rss.cnn.com/rss/cnn_topstories.rss", "published": "Tue, 18 Apr 2023 21:17:44 GMT", "fetched_at": "2025-12-23 14:31:55.018993"}
{"title": "Three killed after Russia launches 'massive' attack across Ukraine", "link": "https://www.bbc.com/news/articles/cr4d99p63y4o?at_medium=RSS&at_campaign=rss", "summary": "Several regions are without power after missile and drone strikes targeted several cities.", "content": "Three killed after Russia launches 'massive' attack across Ukraine\n\n30 minutes ago Share Save Alex Smith and Mohamed Madi , Kyiv Share Save\n\nWatch: BBC correspondent at the scene of Kyiv drone attack\n\nRussia carried out a \"massive\" overnight attack on several Ukrainian cities, President Volodymyr Zelensky has said, a day after he warned of strikes over the Christmas period. At least three people were killed, according to Ukrainian officials, including a four-year-old child, while energy infrastructure was also targeted, leaving several regions without power. Russia launched 635 drones and 38 missiles, Ukraine's air force said, adding that 621 of them were downed. Zelensky said \"people simply want to be with their families, at home, and safe\" in the run-up to Christmas, and said the strikes sent \"an extremely clear signal about Russia's priorities\" despite ongoing peace talks.\n\nHe added that Russian President Vladimir Putin \"still cannot accept that he must stop killing. And that means that the world is not putting enough pressure on Russia\". Zelensky had previously warned it was in the Kremlin's \"nature\" to \"carry out massive attacks\" during the festive period. Russia launched a full-scale invasion of Ukraine in February 2022, and Moscow currently controls about 20% of Ukrainian territory.\n\nLocal authorities in the central Zhytomyr region confirmed a child's death. Regional head Vitaly Bunechko said the child \"was taken to hospital, doctors fought for (the child's) life but could not save (the child) in the end\". Five others were injured in the strike, he added. Meanwhile, a 76-year-old woman was killed and three people injured when a house in the Kyiv region was struck, according to Ukraine's state emergencies service. An attack in Khmelnytskyy, western Ukraine, killed a 72-year-old, regional administration head Serhiy Tyurin said. Polish fighter jets were scrambled in response to missiles and drones targeting west Ukraine. The Russian defence ministry said it had targeted Ukrainian \"military-industrial complex plants and supporting energy facilities\". It added that all the designated targets had been hit. Meanwhile, Ukraine reportedly struck a petrochemical plant in Stravropol, southern Russia. Videos shared by Russian media channels online showed large flames rising from the direction of the plant. The region's governor, Vladimir Vladimirov, said a Ukrainian drone hit the plant and sparked a fire. No casualties were reported and residential buildings were left undamaged.\n\nReuters Emergency responders work at the site of a Russian drone strike on an apartment building in the Ukrainian capital\n\nWith temperatures expected to fall to as low as -7C on Wednesday, Ukraine's energy operator warned of emergency power shutdowns \"in all regions\" and urged people to use energy \"sparingly\". Acting energy minister Artem Nekrasov said it was the ninth large attack on Ukraine's energy system this year, and that supply in the Rivne, Ternopil and Khmelnytsky regions has been \"almost completely\" lost. Ukrainian MP Oleksandr Merezhko told the BBC World Service that some areas could be without power \"for days\". The main focus of Russian attacks in recent days has been the southern port city of Odesa, which comes after Vladimir Putin threatened to sever Ukraine's access to the Black Sea. The Russian president made the threat in retaliation for Ukrainian drone attacks on tankers belonging to Russia's \"shadow fleet\", vessels used to move goods including oil which are under Western sanctions.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 14:11:18 GMT", "fetched_at": "2025-12-23T14:42:57.119660"}
{"title": "'A miracle': Officer shot in head during Bondi attack home from hospital", "link": "https://www.bbc.com/news/articles/cd0kxrr2jyko?at_medium=RSS&at_campaign=rss", "summary": "The Christmas homecoming of Jack Hibbert, who was shot in the head and shoulder, is a \"miracle\", his family say.", "content": "'A miracle': Officer shot in head during Bondi attack home from hospital\n\n9 hours ago Share Save Yang Tian Sydney Share Save\n\nPA Media Jack Hibbert had been working as a police officer for just months before he was shot\n\nA young police officer who was shot in the head during the Bondi Beach attack has been released from hospital. Probationary Constable Jack Hibbert - who is just four months into the job - was patrolling a Hanukkah event when two gunmen opened fire, injuring over 40 people and killing 15. The 22-year-old, who was also hit in the shoulder, has lost vision in one of his eyes but is now recovering at home, his family confirmed in a statement. \"As a family, we couldn't ask for anything more - having our Jack home, especially for Christmas, truly feels like a miracle.\"\n\nThey thanked the public for their \"overwhelming support\" and praised medical staff for their \"exceptional\" care and dedication. \"While he is home, he is still recovering and will need space, support, and continued positive thoughts during this time,\" the statement added. Even after he was shot during the attack, Constable Hibbert continued to help festival attendees until he physically could no longer do so, his family previously said. \"Many of his colleagues who were present on the night of the incident have visited in hospital and given testaments to Jack's bravery during the incident... They described how Jack acted, he moved toward people in need, not away from danger,\" they said. He was one of two police officers injured in the shooting, with the second officer Constable Scott Dyson, 25, still recovering from his injuries in hospital, according to the last police update.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 06:06:34 GMT", "fetched_at": "2025-12-23T14:42:57.255092"}
{"title": "Trump says US will keep or sell oil seized from Venezuela", "link": "https://www.bbc.com/news/articles/c87lnn09yj8o?at_medium=RSS&at_campaign=rss", "summary": "The US president also says the US intends to keep the tankers it has intercepted off the coast of Venezuela.", "content": "Trump says US will keep or sell oil seized from Venezuela\n\n5 hours ago Share Save Rachel Hagan Share Save\n\nANDREW CABALLERO-REYNOLDS / AFP/ Getty Images\n\nDonald Trump has said the US will keep or sell the crude oil contained on tankers it has seized off the coast of Venezuela, as well as the vessels themselves. The US president's comments came as Washington continues to pressure the South American country's leader Nicolás Maduro to stand down. Speaking to reporters in Florida on Monday, Trump said of the oil \"we're going to keep it\", adding: \"Maybe we will sell it, maybe we will keep it. Maybe we'll use it in the Strategic Reserves. We're keeping the ships also.\" The Trump administration has accused Venezuela of using oil revenues to fund drug-related crime, while Caracas has condemned the seizures as \"piracy\".\n\nThe US military has seized two oil tankers this month, including one on Saturday. Trump issued his latest warning as the US Coast Guard continued to pursue a third oil tanker, which authorities described as part of a Venezuelan \"dark fleet\" used to evade US sanctions. \"It's moving along, and we'll end up getting it,\" Trump said. Separately on Monday, the US military said it carried out a strike on what it said was a suspected trafficking vessel in international waters in the eastern Pacific. US Southern Command said one person was killed.\n\nRos Atkins on… the oil tanker being pursued by the US", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 09:51:47 GMT", "fetched_at": "2025-12-23T14:42:57.387900"}
{"title": "Israel extends order allowing closure of foreign broadcasters", "link": "https://www.bbc.com/news/articles/c2k47wg2j90o?at_medium=RSS&at_campaign=rss", "summary": "A bill passed by parliament expands temporary powers introduced during the Gaza war to shutter outlets seen as a security threat.", "content": "Israel extends order allowing closure of foreign broadcasters\n\nAl Jazeera was forced to close its office in Ramallah, in the occupied West Bank, in September 2024\n\nOriginally dubbed the \"Al Jazeera Law\", the powers were used to shut down the Qatari-owned channel's offices and block its broadcasts in May 2024.\n\nIt allows the government for the next two years to cease operations of a foreign outlet even in peace time and without the need for a court order.\n\nThe legislation, passed by 22 votes to 10, expands temporary powers introduced during the Gaza war to shutter outlets seen as a threat to national security.\n\nIsrael's parliament has extended an order allowing the government to shut down foreign broadcasters operating in the country.\n\nIsrael accused Al Jazeera - which has been a strong critic of Israel's military campaign in Gaza - of anti-Israel bias and of supporting Hamas in its coverage.\n\nAl Jazeera denied the accusations and condemned Israel's actions, calling it a \"criminal act\" and an attack on press freedom.\n\nThe Association for Civil Rights in Israel (ACRI) said last year that the temporary order violated \"freedom of expression, the right to information and freedom of the press, and blocks citizens and residents from receiving a variety of information that does not fit the Israeli narrative or is not broadcast on Israeli media channels\".\n\nThe legislation extending the order was passed hours after the Israeli cabinet approved a plan to shut down Army Radio, or Galei Tzahal (GLZ), a state-funded station that is operated by the Israel Defense Forces (IDF) but is editorially independent.\n\nUnder the plan proposed by Defence Minister Israel Katz, the station will cease operations by 1 March 2026.\n\nKatz argued that Army Radio, which employs both active duty soldiers and civilians, \"no longer serves as a mouthpiece and ear for soldiers and broadcasts political and divisive content that is not in line with IDF values\".\n\nPrime Minister Benjamin Netanyahu told the cabinet meeting that a station broadcasting under the authority of the military was highly unusual.\n\n\"I think it exists in North Korea and maybe a few other countries, and we probably don't want to be counted among them,\" he said.\n\nThe Union of Journalists and Journalists' Organisations said they would petition the High Court of Justice against the decision, calling it \"a severe and unlawful infringement on freedom of expression and freedom of the press\".\n\nThe Israel Democracy Institute (IDI) think tank said shutting Army Radio constituted a serious violation of freedom of expression and effectively wiped out half of Israel's independent public radio news broadcasts.\n\n\"The decision to shut down a public media organisation is not an isolated move. It is part of a broader and worrying pattern of ongoing harm to Israeli democracy,\" it warned.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 11:55:57 GMT", "fetched_at": "2025-12-23T14:42:57.521126"}
{"title": "US regulator approves pill form of Wegovy weight-loss drug", "link": "https://www.bbc.com/news/articles/ce86le5dyxyo?at_medium=RSS&at_campaign=rss", "summary": "Wegovy becomes first pill of its kind to be approved, shifting weight-loss drugs beyond injections.", "content": "US regulator approves pill form of Wegovy weight-loss drug\n\nThe US Food and Drug Administration (FDA) has approved a pill version of the weight-loss drug Wegovy, according to pharmaceutical giant Novo Nordisk.\n\nIt is the first pill of its kind to receive approval from the regulator, marking a new era for weight-loss drugs.\n\nWegovy's Danish makers Novo Nordisk said the once-daily pill was a \"convenient option\" to the injectable and would provide the same weight loss as the shot. It comes after Wegovy was approved by the FDA specifically for weight loss.\n\nOthers like Ozempic, which has similar weight-loss effects, were primarily approved for the treatment of Type 2 diabetes.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 01:29:07 GMT", "fetched_at": "2025-12-23T14:42:57.649999"}
{"title": "Freed Nigerian schoolchildren to be reunited with families", "link": "https://www.theguardian.com/world/2025/dec/22/freed-nigerian-schoolchildren-set-to-be-reunited-with-families", "summary": "<p>Month-long ordeal ends but no details released on how they regained their freedom or who was behind abduction</p><p>A final group of 130 kidnapped Nigerian schoolchildren <a href=\"https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria\">freed by the government on Sunday</a> are expected to be reunited with their families in the central Niger state on Monday, ending a month-long ordeal that drew global concern.</p><p>Last month, unknown gunmen took hundreds of schoolchildren and 12 teachers from St Mary’s Catholic school, Papiri community in Niger state, which runs west from the capital, Abuja, to neighbouring Benin.</p> <a href=\"https://www.theguardian.com/world/2025/dec/22/freed-nigerian-schoolchildren-set-to-be-reunited-with-families\">Continue reading...</a>", "content": "A final group of 130 kidnapped Nigerian schoolchildren freed by the government on Sunday are expected to be reunited with their families in the central Niger state on Monday, ending a month-long ordeal that drew global concern.\n\nLast month, unknown gunmen took hundreds of schoolchildren and 12 teachers from St Mary’s Catholic school, Papiri community in Niger state, which runs west from the capital, Abuja, to neighbouring Benin.\n\nFifty children escaped not long after, and another 100 were released on 7 December.\n\n“Another 130 abducted Niger state pupils released, none left in captivity,” the presidential spokesperson Sunday Dare posted on X on Sunday.\n\nThe last group of children were reportedly released near Nigeria’s border with Benin but as with the previous release, there was no mention of how they regained freedom or what group was behind the abduction. Other details also remain unclear.\n\nKidnap-for-ransom abductions represent one angle of Nigeria’s multifaceted security crises. Gangs of armed bandits roam the vast countryside in the north, while jihadists operate with external support from surrounding areas in the Sahel. The abundance of non-state actors has left rural areas particularly vulnerable, and Nigeria’s under-equipped security agencies continue to be stretched.\n\nThe Papiri incident was the second mass abduction in the west African country in a week, and the second in Niger state in four years, after a May 2021 abduction of 135 pupils from an Islamic seminary. The most high-profile mass abduction remains the infamous 2014 kidnapping of more than 200 schoolgirls from the town of Chibok in north-east Nigeria, which spurred a global campaign supported by dozens of celebrities including Michelle Obama and Elton John.\n\nAccording to the Lagos-based geopolitical advisory SBM Intelligence, there were at least 4,722 victims of kidnappings across Nigeria between July 2024 and June 2025, with at least 762 people killed and about $1.66m paid as ransom in total.\n\nThe deteriorating security situation has led to the US president, Donald Trump, to threaten military action in Nigeria. The Trump administration has designated Nigeria as a country of particular concern, citing a “Christian genocide” – a framing that Abuja has repeatedly rejected as being an oversimplification of a complex crisis.\n\nReuters contributed to this report", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Mon, 22 Dec 2025 12:00:34 GMT", "fetched_at": "2025-12-23T14:42:57.907347"}
{"title": "Another 130 kidnapped schoolchildren released in Nigeria", "link": "https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria", "summary": "<p>Presidential spokesperson says all those abducted from a Catholic school in Niger state last month are now free</p><p>Nigerian authorities say they have secured the release of a further 130 schoolchildren kidnapped from a Catholic school in November, after <a href=\"https://www.theguardian.com/world/2025/dec/07/release-secured-of-100-kidnapped-nigerian-schoolchildren-but-many-still-being-held\">100 were freed earlier this month</a>.</p><p>“Another 130 abducted Niger state pupils released, none left in captivity,” presidential spokesperson Sunday Dare said on X, in a post accompanied by a photo of smiling children.</p> <a href=\"https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria\">Continue reading...</a>", "content": "Nigerian authorities say they have secured the release of a further 130 schoolchildren kidnapped from a Catholic school in November, after 100 were freed earlier this month.\n\n“Another 130 abducted Niger state pupils released, none left in captivity,” presidential spokesperson Sunday Dare said on X, in a post accompanied by a photo of smiling children.\n\nIn late November, gunmen kidnapped hundreds of students and staff from St Mary’s co-educational boarding school in the country’s north-central Niger state.\n\nNigeria has recently seen a new wave of mass abductions, reminiscent of the kidnapping of schoolgirls in the town of Chibok by the militant group Boko Haram in 2014.\n\nA UN source said the remaining schoolchildren would be taken to Minna, the capital of Niger state, on Tuesday.\n\nView image in fullscreen The exact number of students and staff kidnapped from St Mary’s school remains unclear. Photograph: Afolabi Sotunde/EPA\n\nThe exact number of people taken and how many have remained in captivity has been unclear since the kidnapping in the rural hamlet of Papiri.\n\nThe Christian Association of Nigeria (CAN) said that a total of 315 students and staff were kidnapped. Some 50 escaped immediately afterwards, and on 7 December the government secured the release of about 100 more.\n\nA statement from President Bola Tinubu then put the number of people still being held at 115 – about 50 fewer than the initial CAN figure would suggest.\n\nIt has not been made public who seized the children, or how the government secured their release.\n\nThough kidnappings for ransom are a common way for criminals and armed groups to make money, a spate of mass abductions in Nigeria has put an uncomfortable spotlight on the country’s already grim security situation.\n\nIn November, assailants kidnapped two dozen Muslim schoolgirls, 38 church worshippers and a bride and her bridesmaids, with male farm workers, women and children also taken hostage.\n\nThe kidnappings come as Nigeria faces a diplomatic offensive from the United States, where President Donald Trump has alleged that mass killings of Christians in the west African country amount to a “genocide”.\n\nThe Nigerian government and independent analysts reject that framing, which has long been used by the Christian right in the US and Europe.\n\nThe religiously diverse country of 230 million people has myriad security concerns, from jihadists in the north-east to armed “bandit” gangs in the north-west, and its multiple conflicts have seen Christians and Muslims killed.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 20:05:09 GMT", "fetched_at": "2025-12-23T14:42:58.007511"}
{"title": "Manchester Museum seeks help to uncover hidden histories of African collection", "link": "https://www.theguardian.com/uk-news/2025/dec/21/manchester-museum-uncover-hidden-histories-africa-hub", "summary": "<p>New Africa Hub confronts colonial-era silences by asking visitors to share insights on 40,000 objects</p><p>It’s a rare thing for a museum to talk about what it doesn’t know. But unanswered questions and archival silences are at the heart of the new Africa Hub at Manchester Museum, north-west England, which is inviting people around the world to help fill the gaps.</p><p>The museum holds more than 40,000 items from across Africa, many of which were traded, collected, looted or preserved during the era of the British empire.</p> <a href=\"https://www.theguardian.com/uk-news/2025/dec/21/manchester-museum-uncover-hidden-histories-africa-hub\">Continue reading...</a>", "content": "It’s a rare thing for a museum to talk about what it doesn’t know. But unanswered questions and archival silences are at the heart of the new Africa Hub at Manchester Museum, north-west England, which is inviting people around the world to help fill the gaps.\n\nThe museum holds more than 40,000 items from across Africa, many of which were traded, collected, looted or preserved during the era of the British empire.\n\nAs a result, the names of makers, the cultural significance of objects and the people to which they once belonged are largely unknown to curators in Manchester; in many cases, only the name of the donor or the collection from which an item came is recorded.\n\nThe new Africa Hub will display “beautifully crafted” items that have been in storage for years, the museum says.\n\nView image in fullscreen A view of a carved wooden figure, one of the objects at Manchester Museum. Photograph: Manchester Museum/Reuters\n\nIt is inviting visitors to the collections on Oxford Road, in the city’s university district, as well as those exploring the collections online, to share stories about the objects’ provenance.\n\nCurators say this could lead to the restitution of items, as well as new partnerships in the African diaspora. And community collaboration has already begun. A display at the heart of Africa Hub draws on the knowledge of Manchester’s Igbo community, one of the oldest Nigerian diaspora communities in the UK.\n\nLucy Edematie, the curator of African collections from colonial contexts at Manchester Museum, worked with the Igbo Community Greater Manchester (ICM) organisation to research objects and celebrate Igbo heritage.\n\nSylvia Mgbeahurike, the vice-chair of ICM Women, said: “Some of these objects were given, some were stolen, some were taken forcefully out of conquest. It is important that we start bringing them together again. It shows inclusiveness. It shows there is strength in diversity. It shows we are one people, irrespective of our colour or where we are from.”\n\nEdematie said: “Unlike most galleries or exhibitions, which represent the culmination of years of research and collaboration, Africa Hub is the beginning. It builds on work the museum has already been doing to engage with both diasporic communities and communities in Africa but provides an opportunity to extend this even further.\n\n“It is a chance to do our thinking in public, with honesty and transparency, and to involve people in that process from the start.”\n\nThe museum says the Africa Hub will be an “evolving space for reflection, dialogue and shared learning and its future direction will be shaped by public contribution”.\n\nView image in fullscreen The objects from across Africa include animals, cultural heritage items, minerals and plants. Photograph: Manchester Museum\n\nA spokesperson added: “We’re supposed to know everything there is to know about the collections we care for, ready to communicate the wisdom of the world through a series of carefully written object labels.\n\n“Well, sometimes the reality is slightly different. And, on this occasion, we need your help, as visitors and communities, to uncover the stories that museum records cannot tell or have suppressed.\n\n“Mostly, Africa Hub means being honest about what we don’t know. Manchester Museum holds over 40,000 objects from across Africa, cultural heritage items, plants, animals and minerals … much of their story remains untold.\n\n“We’re laying our lack of knowledge bare and extending an invitation to you, to come and view these collections, either in person or online, and share your own knowledge, experience and perspectives to create richer narratives.”", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 15:00:01 GMT", "fetched_at": "2025-12-23T14:42:58.134892"}
{"title": "Sweden and Germany slash aid budgets to focus on Ukraine and defence spending", "link": "https://www.theguardian.com/global-development/2025/dec/21/sweden-and-germany-slash-aid-budgets-to-focus-on-ukraine-and-defence-spending", "summary": "<p>Echoing the dismantling of USAID, other countries are changing funding priorities and health and hunger programmes in Africa will lose out </p><p>The notion of humanitarian aid being used to combat poverty and hunger is being replaced in Europe with geopolitical “games” as states redirect aid to Ukraine and to defence spending, analysts warn after recent announcements by Sweden and Germany.</p><p>Earlier this year, humanitarian groups called for European donors to fill the gap as President Donald Trump dismantled the USAID programme, but instead other nations are further pulling back from their commitments around the world.</p> <a href=\"https://www.theguardian.com/global-development/2025/dec/21/sweden-and-germany-slash-aid-budgets-to-focus-on-ukraine-and-defence-spending\">Continue reading...</a>", "content": "The notion of humanitarian aid being used to combat poverty and hunger is being replaced in Europe with geopolitical “games” as states redirect aid to Ukraine and to defence spending, analysts warn after recent announcements by Sweden and Germany.\n\nEarlier this year, humanitarian groups called for European donors to fill the gap as President Donald Trump dismantled the USAID programme, but instead other nations are further pulling back from their commitments around the world.\n\nIn December, Sweden announced a 10bn kronor (£800m) cut in development funding to Mozambique, Zimbabwe, Liberia, Tanzania and Bolivia. Germany’s humanitarian budget of €1.05bn (£920m) for 2026 will be less than half of last year’s, with spending refocused on areas deemed a priority to Europe.\n\n“I think we are losing a consensus of solidarity and responsibility which has been established for a while now,” said Ralf Südhoff, director of the Berlin-based Centre for Humanitarian Action.\n\n“Germany this year has started to phase out Latin America, decreased engagement in Asia and say they want to focus now on crises which have an impact on Europe,” he said, noting that while Ukraine was in need of funding because of Russia’s invasion, its location in Europe meant it was saved from the cuts developing countries have experienced.\n\nThe UK also announced earlier this year that it would be cutting aid to fund defence spending. Norway has increased its civilian support to Ukraine by 2.5bn kroner (£185m), to a quarter of its aid budget, but has been accused of making Africa pay for that rise with a 355m kroner cut (£26m).\n\nFrance’s budget for 2026 will also see a €700m cut to aid spending, with a 60% reduction in food aid, while increasing defence spending by €6.7bn.\n\n“It’s a broader geopolitical trend and there’s a misleading belief by European actors that they have to play this game now in the same way as Moscow, Beijing, Washington,” said Südhoff, suggesting aid will be more “transactional” and directed to where donors see direct benefits for themselves. “The reaction now is not to fill the gap or attempt to do so but to follow the [American] cuts.”\n\nAnalysis of Germany’s 2026 aid budget by Venro, a coalition of German NGOs, shows that the country is slashing funding to traditional development and poverty-reduction programmes, with a 20% cut for the World Food Programme and 33% for the Gavi vaccine alliance.\n\nOne of the few elements of the budget not cut is Germany’s partnerships with the private sector in developing countries.\n\nAnita Kattakuzhy, director of policy at Near, a coalition of civil society groups in the global south, said a wider pattern is emerging among donors.\n\n“Budgets are being reshaped under political pressure, and the communities who bear the consequences have no way to shape those decisions,” said Kattakuzhy.\n\n“Cutting funding in this way may meet short-term priorities in donor capitals, but it destabilises the local systems that are keeping crises from getting worse.”\n\nAmong the countries most affected by aid cuts is Mozambique, which has suffered from cyclones and droughts as well as a resurgent conflict in the country’s Cabo Delgado province that has displaced more than 300,000 people since July.\n\nThe country has received only $31m of $222m funding required this year, leading to food distribution happening only every two months and covering 39% of caloric needs, according to the UN.\n\nThe cutting of development funding by Sweden will directly hit programmes used to rehabilitate and provide healthcare and education to people displaced by the insurgency in the Cabo Delgado region, which began in 2017.\n\nAll four of the African countries removed from Sweden’s development funding have seen cuts for HIV/Aids services, as experts warn there will be a reversal of years of progress in fighting the disease.\n\nMozambique, Zimbabwe and Tanzania are among six countries, along with Nigeria, South Africa and Zambia – that could bear the brunt of cuts to health programmes tackling HIV/Aids, according to analysis by the Boston Consultant Group.\n\nIlaria Manunza, country director for Save the Children Mozambique, said aid cuts have already made 2025 very difficult: “Every cut compounds the risk of long-term developmental setbacks, particularly in education and child protection,” said Manunza. “If current trends continue, 2026 will be extremely challenging … there is a real risk that progress made over the past decade could be reversed.”", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 14:00:05 GMT", "fetched_at": "2025-12-23T14:42:58.250661"}
{"title": "Gunmen kill nine in Johannesburg township in South Africa’s second mass shooting this month", "link": "https://www.theguardian.com/world/2025/dec/21/gunmen-johannesburg-township-in-south-africas-second-mass-shooting-within-weeks", "summary": "<p>Attackers wound 10 others in Bekkersdal after opening fire at people in a bar and ‘randomly’ shooting in the street, police say</p><p>Nine people have been killed after gunmen opened fire at a bar near Johannesburg in the second mass shooting in South Africa this month.</p><p>Ten more were wounded in the early morning attack at the tavern in the impoverished Bekkersdal township in a gold mining area about 25 miles (40km) south-west of Johannesburg.</p> <a href=\"https://www.theguardian.com/world/2025/dec/21/gunmen-johannesburg-township-in-south-africas-second-mass-shooting-within-weeks\">Continue reading...</a>", "content": "Nine people have been killed after gunmen opened fire at a bar near Johannesburg in the second mass shooting in South Africa this month.\n\nTen more were wounded in the early morning attack at the tavern in the impoverished Bekkersdal township in a gold mining area about 25 miles (40km) south-west of Johannesburg.\n\nIt comes after a shooting at a tavern near Pretoria on 6 December when gunmen killed 12 people, including a three-year-old child.\n\nPolice initially said 10 people were killed when the Bekkersdal bar was attacked just before 1am, but later revised the toll.\n\nMost of the attackers were armed with pistols and one had an AK-47 rifle, the deputy provincial police commissioner Maj Gen Fred Kekana told SABC television from the scene.\n\n“They entered the tavern and randomly shot at the patrons, unprovoked,” he said.\n\nView image in fullscreen Police put up crime scene tape outside the bar in Bekkersdal. Photograph: Emmanuel Croset/AFP/Getty Images\n\nThree people were killed inside the bar and others were killed as they fled the scene, he said, adding: “It’s also reported that after they shot the people, they searched them. They took their valuables, including cell phones.”\n\nThe dead included a driver from an online car-hailing service who was driving past.\n\n“It’s pure criminality,” Kekana said. Police launched a manhunt for the attackers and appealed for public assistance.\n\nSouth Africa, the continent’s most industrialised nation, is grappling with a high crime rate, much of it driven by organised networks and gangs. The country is awash with legal and illegal firearms and shootings are common, often fuelled by gang rivalry and competition between informal businesses.\n\nThe tavern hit in the Pretoria attack this month was an unlicenced outlet in a hostel for migrant workers at Saulsville township. The dead included children age three, 12 and 16.\n\nThe country was also shocked by the daylight killing in central Johannesburg last week of a popular former radio presenter known as DJ Warras. The 40-year-old, whose real name was Warris Stock, was shot on 16 December outside a building he had been visiting as part of his work with a private security company.\n\nIn another high-profile killing, a witness in a corruption inquiry was shot dead in front of his family on 5 December just weeks after testifying against a municipal police chief. The murder of Marius Van der Merwe, 41, reignited a debate about the targeting of whistleblowers who provide information related to crime and corruption.\n\nSouth Africa has one of the highest murder rates in the world, with an average of 63 people a day killed between April and September this year, according to police data.\n\nIn one of the worst mass shootings in recent years, 18 relatives were shot dead at a rural homestead in the Eastern Cape province in September 2024. The victims, who had gathered for a traditional ceremony, were age 14 to 64, and 15 were women. Several men have been arrested.", "language": "en", "category": "politics", "source": "https://www.theguardian.com/world/rss", "published": "Sun, 21 Dec 2025 12:12:54 GMT", "fetched_at": "2025-12-23T14:42:58.355180"}
{"title": "US economy grows at fastest pace in two years", "link": "https://www.bbc.com/news/articles/c62n9ynzrdpo?at_medium=RSS&at_campaign=rss", "summary": "Strong consumer spending helps the US economy grow at a faster rate than expected.", "content": "US economy grows at fastest pace in two years\n\n2 hours ago Share Save Natalie Sherman Business reporter Share Save\n\nBloomberg via Getty Images\n\nThe US economy picked up speed over the three months to September, as consumer spending jumped and exports increased. The world's largest economy expanded at an annual rate of 4.3%, up from 3.8% in the previous quarter. That was better than expected, and marked the strongest growth in two years. The report, which had been delayed by the US government shutdown, sheds light on an economy that has been buffeted by dramatic changes to trade and immigration policies, as well as persistent inflation and cuts to government spending. But while that has led to sharp swings in some areas, such as imports and exports, the underlying economy has maintained solid momentum, outperforming many forecasts.\n\n\"This is an economy that has defied doom and gloom expectations basically since the beginning of 2022\", said Aditya Bhave, senior economist at Bank of America. Speaking to the BBC's Business Today programme, Mr Bhave described the economy as \"very very resilient\". \"I don't see why that wouldn't continue going forward,\" he added. The overall growth figure for the third quarter of the year was much stronger than expected, with most analysts expecting an annual pace of about 3.2%. It was lifted by consumer spending that rose at an annual rate of 3.5%, compared with 2.5% in the previous quarter, despite a slowing job market, as households spent more on health care services. Imports - which count against growth - continued to decline, reflecting the wave of taxes on shipments entering the US that President Donald Trump announced this spring. Meanwhile exports, which had dropped sharply, bounced back, surging by 7.4%. Government spending also rebounded, driven by defence outlays. Those gains helped to overcome a slowdown in business investment, including in intellectual property, and a housing market struggling under the weight of still-high interest rates, which have heightened affordability issues and supply constraints.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 15:56:57 GMT", "fetched_at": "2025-12-23T17:32:09.831119"}
{"title": "Gunmen abduct 28 Muslim travellers in central Nigeria", "link": "https://www.bbc.com/news/articles/czj0ll7ppewo?at_medium=RSS&at_campaign=rss", "summary": "The victims, including women and children, were ambushed on their way to a religious festival.", "content": "Gunmen abduct 28 Muslim travellers in central Nigeria\n\nNews of the abductions comes just a day after the Nigerian authorities announced the release of the remaining 130 schoolchildren and teachers from a separate mass kidnapping at a Catholic boarding school in Niger state last month.\n\nPolice spokesperson Alabo Alfred said the authorities have \"deployed assets\" to the affected area to ensure that those abducted are rescued.\n\nThe victims, including women and children, were ambushed in their bus on Sunday night as it was driving between villages.\n\nArmed men have kidnapped 28 people travelling to an annual Islamic event in Nigeria's central Plateau state, local police told the BBC.\n\nA journalist based in Plateau state said the families of the latest victims had begun receiving ransom demands.\n\nThe police have not said anything about the identity of the possible perpetrators.\n\nKidnapping for ransom by criminal gangs, known locally as bandits, has become common across parts of northern and central Nigeria.\n\nAlthough the handing over of cash in order to release those being held is illegal, it is thought that this is how many cases are resolved and seen as a way for these gangs to raise money.\n\nThe incident in Plateau state is unrelated to the long-running Islamist insurgency in the country's north-east, where jihadist groups have been battling the state for more than a decade.\n\nThe insecurity in Nigeria received renewed international attention in November after US President Donald Trump threatened to send troops to \"that now disgraced country, 'guns-a-blazing'\". He alleged that Christians were being targeted.\n\nNigeria's federal government has acknowledged the security problems but has denied that Christians are being singled out.\n\nOn Monday, Information Minister Mohammed Idris said that recent tensions with the US over insecurity and alleged persecution of Christians had been \"largely resolved\", resulting in stronger relations with Washington.\n\nHe added that trained and equipped forest guards will be deployed to secure forests and other remote areas used as hideouts by criminal groups to supplement army operations.\n\nAdditional reporting by Abayomi Adisa and BBC Monitoring", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 14:10:19 GMT", "fetched_at": "2025-12-23T17:54:00.587844"}
{"title": "Trump travelled on Epstein's plane more than previously thought, prosecutor says", "link": "https://www.bbc.com/news/articles/c74xgp81pqgo?at_medium=RSS&at_campaign=rss", "summary": "The US president has long denied any wrongdoing in relation to late convicted sex offender Jeffrey Epstein.", "content": "Trump travelled on Epstein's plane more than previously thought, prosecutor says\n\n8 minutes ago Share Save Alex Smith and Anthony Reuben , BBC Verify Share Save\n\nDavidoff Studios/Getty Images A file photo of Jeffrey Epstein and Donald Trump, then a real estate developer, at Trump's Mar-a-Lago estate in Palm Beach, Florida in 1997\n\nUS President Donald Trump was listed as a passenger on the private jet of late convicted sex offender Jeffrey Epstein eight times between 1993 and 1996, a new email released by the US Department of Justice (DOJ) says. \"Donald Trump traveled on Epstein's private jet many more times than previously has been reported (or that we were aware),\" reads the 7 January 2020 email from an assistant US attorney. Trump's name on the flight record does not indicate wrongdoing. In 2024, Trump wrote: \"I was never on Epstein's Plane\". He has denied any wrongdoing in relation to Epstein. The DOJ says some files released on Tuesday \"contain untrue and sensationalist claims\" against Trump.\n\nTrump was a friend of Epstein's for years, but the president has said they fell out in about 2004 - years before Epstein was first arrested. The latest release of documents - running to more than 30,000 pages - is part of the so-called Epstein files the DOJ was legally required to publish in their entirety by last Friday. Live: What the newly-released files contain and reaction In a statement on Tuesday, the DOJ said: \"Some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election. To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already.\" \"Nevertheless, out of our commitment to the law and transparency, the DOJ is releasing these documents with the legally required protections for Epstein's victims,\" the DOJ statement on X said.\n\nThe prosecutor's email was sent on 7 January 2020 and is part of an email chain which includes the subject heading: \"RE: Epstein flight records.\" The sender and recipient are redacted, but the bottom of the email says assistant US attorney, Southern District of New York - with the name redacted. The email states that Trump \"is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which [Epstein's associate Ghislaine] Maxwell was also present. He is listed as having traveled with, among others and at various times, Marla Maples, his daughter Tiffany, and his son Eric.\" \"On one flight in 1993, he and Epstein are the only two listed passengers; on another, the only three passengers are Epstein, Trump, and then-20-year-old...\" - the rest of the sentence has been redacted. It continues: \"On two other flights, two of the passengers, respectively, were women who would be possible witnesses in a Maxwell case.\" In 2022, Ghislaine Maxwell was sentenced to 20 years in prison for crimes including conspiracy to entice minors to travel to engage in illegal sex acts and sex trafficking of a minor. Epstein died in a New York prison cell in 2019 as he awaited his trial on sex trafficking charges.\n\nUS Department of Justice An extract from the 2020 email, released by the US Department of Justice", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 19:46:42 GMT", "fetched_at": "2025-12-23T19:55:18.018097"}
{"title": "Libya's army chief killed in air crash in Turkey", "link": "https://www.bbc.com/news/articles/cyvgzyepdqno?at_medium=RSS&at_campaign=rss", "summary": "Signal was earlier lost with a jet that took off from Ankara with Gen Mohammed Ali Ahmed al-Haddad and four others on board.", "content": "Libya's army chief killed in air crash in Turkey\n\nLibya's Gen Mohammed Ali Ahmed al-Haddad (left) died just hours after holding talks with Turkish Defence Minister Yasar Guler\n\nThe Libyan army chief has been killed in an air crash in Turkey.\n\nGen Mohammed Ali Ahmed al-Haddad and four others were on board a Falcon 50 aircraft flying out of the Turkish capital, Ankara.\n\nIn a post on X, Turkish Interior Minister Ali Yerlikaya said signal with the business jet was lost at 20:52 local time (17:52 GMT) - about 42 minutes after it took off from Ankara's airport.\n\nThe Tripoli-bound jet had issued an emergency landing request before contact was lost.", "language": "en", "category": "politics", "source": "https://feeds.bbci.co.uk/news/world/rss.xml", "published": "Tue, 23 Dec 2025 20:18:23 GMT", "fetched_at": "2025-12-23T20:29:24.155552"}
