"https://feeds.theverge.com/theverge/index.xml"
"https://feeds.wired.com/feed/rss/wired"
"https://feeds.techcrunch.com/"
"https://feeds.9to5google.com/9to5google/feed"
{"title": "The Vergecast RAM Holiday Spec-tacular", "link": "https://www.theverge.com/podcast/849551/ram-explainer-holiday-spectacular-vergecast", "summary": "Happy Holidays! As we like to do on The Vergecast, we take this time of year to see our families, relax and recharge, and go extremely deep into a specific technology that matters right now. This year, we picked the tiny chip in all your devices that is suddenly a precious and expensive commodity: RAM. [&#8230;]", "content": "Happy Holidays! As we like to do on The Vergecast, we take this time of year to see our families, relax and recharge, and go extremely deep into a specific technology that matters right now. This year, we picked the tiny chip in all your devices that is suddenly a precious and expensive commodity: RAM.\n\nOn this episode, David and Nilay are joined by The Verge’s Sean Hollister to get a primer on all things Random Access Memory. The hosts talk through the history of the technology, what RAM made possible in our computers, how it became utterly ubiquitous in practically every electronic device we own, and why it’s so hard to get right now. (Here’s a very 2025 spoiler alert: it’s about AI.) Then, with the help of producer Travis Larchuk, we play some RAM-related games, which go… well, they go.\n\nAfter that, Sean and David chat with Dylan Patel from Semianalysis, who explains why the chip market in general is so overwhelmed right now — and why even in boom times, some companies might be reluctant to invest too heavily in scaling up. He also explains how the AI companies have cornered the market on RAM, whether the data center boom will end anytime soon, and what it all means for the prices of our devices.\n\nThank you so much to everyone who has listened to, watched, and talked with us about The Vergecast this year. Have a happy, restful, memory-filled holiday, and we’ll see you in 2026! Maybe even at our CES live show in Las Vegas!\n\nIn the meantime, if you want to know more about everything we discuss in this episode, here are some links to get you started:", "language": "en", "category": "tech", "source": "https://www.theverge.com/rss/index.xml", "published": "2025-12-23T09:35:49-05:00", "fetched_at": "2025-12-23T14:42:38.419329"}
{"title": "How AI broke the smart home in 2025", "link": "https://www.theverge.com/tech/845958/ai-smart-home-broken", "summary": "This morning, I asked my Alexa-enabled Bosch coffee machine to make me a coffee. Instead of running my routine, it told me it couldn't do that. Ever since I upgraded to Alexa Plus, Amazon's generative-AI-powered voice assistant, it has failed to reliably run my coffee routine, coming up with a different excuse almost every time [&#8230;]", "content": "is a senior reviewer with over twenty years of experience. She covers smart home, IoT, and connected tech, and has written previously for Wirecutter, Wired, Dwell, BBC, and US News.\n\nThis morning, I asked my Alexa-enabled Bosch coffee machine to make me a coffee. Instead of running my routine, it told me it couldn’t do that. Ever since I upgraded to Alexa Plus, Amazon’s generative-AI-powered voice assistant, it has failed to reliably run my coffee routine, coming up with a different excuse almost every time I ask.\n\nIt’s 2025, and AI still can’t reliably control my smart home. I’m beginning to wonder if it ever will.\n\nThe potential for generative AI and large language models to take the complexity out of the smart home, making it easier to set up, use, and manage connected devices, is compelling. So is the promise of a “new intelligence layer” that could unlock a proactive, ambient home.\n\nBut this year has shown me that we are a long way from any of that. Instead, our reliable but limited voice assistants have been replaced with “smarter” versions that, while better conversationalists, can’t consistently do basic tasks like operating appliances and turning on the lights. I want to know why.\n\nI’m still waiting on the promise of voice assistants that can seamlessly control my smart home. Photo by Jennifer Pattison Tuohy / The Verge\n\nThis wasn’t the future we were promised.\n\nIt was back in 2023, during an interview with Dave Limp, that I first became intrigued by the possibilities of generative AI and large language models for improving the smart home experience. Limp, then the head of Amazon’s Devices & Services division that oversees Alexa, was describing the capabilities of the new Alexa they were soon to launch (spoiler alert: it wasn’t soon).\n\nAlong with a more conversational assistant that could actually understand what you said no matter how you said it, what stood out to me was the promise that this new Alexa could use its knowledge of the devices in your smart home, combined with the hundreds of APIs they plugged into it, to give the assistant the context it needed to make your smart home easier to use.\n\nFrom setting up devices to controlling them, unlocking all their features, and managing how they can interact with other devices, a smarter smart home assistant seemed to hold the potential to not only make it easier for enthusiasts to manage their gadgets but also make it easier for everyone to enjoy the benefits of the smart home.\n\nFast-forward three years, and the most useful smart home AI upgrade we have is AI-powered descriptions for security camera notifications. It’s handy, but it’s hardly the sea change I had hoped for.\n\nIt’s not that these new smart home assistants are a complete failure. There’s a lot I like about Alexa Plus; I even named it as my smart home software pick of the year. It is more conversational, understands natural language, and can answer many more random questions than the old Alexa.\n\nWhile it sometimes struggles with basic commands, it can understand complex ones; saying “I want it dimmer in here and warmer” will adjust the lights and crank up the thermostat. It’s better at managing my calendar, helping me cook, and other home-focused features. Setting up routines with voice is a huge improvement over wrestling with the Alexa app — even if running them isn’t as reliable.\n\nGoogle’s new Gemini for Home AI-powered smart home assistant won’t fully launch until next spring, when its new smart speaker arrives. Photo by Jennifer Pattison Tuohy / The Verge\n\nThe problem is that the new assistants aren’t as consistent at controlling smart home devices as the old ones. While they were often frustrating to use, the old Alexa and Google Assistant (and the current Siri) would generally always turn on the lights when you asked them to, provided you used precise nomenclature.\n\nToday, their “upgraded” counterparts struggle with consistency in basic functions like turning on the lights, setting timers, reporting on the weather, playing music, and running the routines and automations on which many of us have built our smart homes.\n\nWhy is this, and will it ever get better? To understand the problem, I spoke with two professors in the field of human-centric artificial intelligence with experience with agentic AI and smart home systems. My takeaway from those conversations is that, while it’s possible to make these new voice assistants do almost exactly what the old ones did, it will take a lot of work, and that’s possibly work most companies just aren’t interested in doing.\n\nBasically, we’re all beta testers for the AI.\n\nConsidering there are limited resources in this field and ample opportunity to do something much more exciting (and more profitable) than reliably turn on the lights, that’s the way they’re moving, according to experts I spoke with. Given all these factors, it seems the easiest way to improve the technology is to just deploy it in the real world and let it improve over time. Which is likely why Alexa Plus and Gemini for Home are in “early access” phases. Basically, we’re all beta testers for the AI.\n\nThe bad news is it could be a while until it gets better. In his research, Dhruv Jain, assistant professor of Computer Science & Engineering at the University of Michigan and director of the Soundability Lab, has also found that newer models of smart home assistants are less reliable. “It’s more conversational, people like it, people like to talk to it, but it’s not as good as the previous one,” he says. “I think [tech companies’] model has always been to release it fairly fast, collect data, and improve on it. So, over a few years, we might get a better model, but at the cost of those few years of people wrestling with it.”\n\nThe Alexa that launched in 2014 on the original Echo smart speaker isn’t capable enough for the future Amazon is working toward. Image: Amazon\n\nThe inherent problem appears to be that the old and new technologies don’t mesh. So, to build their new voice assistants, Amazon, Google, and Apple have had to throw out the old and build something entirely new. However, they quickly discovered that these new LLMs were not designed for the predictability and repetitiveness that their predecessors excelled at. “It was not as trivial an upgrade as everyone originally thought,” says Mark Riedl, a professor at the School of Interactive Computing at Georgia Tech. “LLMs understand a lot more and are open to more arbitrary ways to communicate, which then opens them to interpretation and interpretation mistakes.”\n\nBasically, LLMs just aren’t designed to do what prior command-and-control-style voice assistants did. “Those voice assistants are what we call ‘template matchers,’” explains Riedl. “They look for a keyword, when they see it, they know that there are one to three additional words to expect.” For example, you say “Play radio,” and they know to expect a station call code next.\n\n“It was not as trivial an upgrade as everyone originally thought.” — Mark Riedl\n\nLLMs, on the other hand, “bring in a lot of stochasticity — randomness,” explains Riedl. Asking ChatGPT the same prompt multiple times may produce multiple responses. This is part of their value, but it’s also why when you ask your LLM-powered voice assistant to do the same thing you asked it yesterday, it might not respond the same way. “This randomness can lead to misunderstanding basic commands because sometimes they try to overthink things too much,” he says.\n\nTo fix this, companies like Amazon and Google have developed ways to integrate LLMs with the APIs at the heart of our smart homes (and most of everything we do on the web). But this has potentially created a new problem.\n\n“The LLMs now have to compose a function call to an API, and it has to work a whole lot harder to correctly create the syntax to get the call exactly right,” Riedl posits. Where the old systems just waited for the keyword, LLM-powered assistants now have to lay out an entire code sequence that the API can recognize. “It has to keep all that in memory, and it’s another place where it can make mistakes.”\n\nAll of this is a scientific way of explaining why my coffee machine sometimes won’t make me a cup of coffee, or why you might run into trouble getting Alexa or Google’s assistant to do something it used to do just fine.\n\nSo, why did these companies abandon a technology that worked for something that doesn’t? Because of its potential. A voice assistant that, rather than being limited to responding to specific inputs, can understand natural language and take action based on that understanding is infinitely more capable.\n\n“What all the companies that make Alexa and Siri and things like that really want to do is chaining of services,” explains Riedl. “That’s where you want a general language understanding, something that can understand complex relationships through tasks and how they’re conveyed by speech. They can invent the if-else statements that chain everything together, on the fly, and dynamically generate the sequence.” They can become agentic.\n\n“The question is whether … the expanded range of possibilities the new technology offers is worth more than a 100 percent accurate non-probabilistic model.” — Dhruv Jain\n\nThis is why you throw away the old technology, says Riedl, because it had no chance of doing this. “It’s about the cost-benefit ratio,” says Jain. “[The new technology] is not ever going to be as accurate at this as the non-probabilistic technology before, but the question is whether that sufficiently high accuracy, plus the expanded range of possibilities the new technology offers, is worth more than a 100 percent accurate non-probabilistic model.”\n\nOne solution is to use multiple models to power these assistants. Google’s Gemini for Home consists of two separate systems: Gemini and Gemini Live. Anish Kattukaran, head of product at Google Home and Nest, says the aim is to eventually have the more powerful Gemini Live run everything, but today, the more tightly constrained Gemini for Home is in charge. Amazon similarly uses multiple models to balance its various capabilities. But it’s an imperfect solution that has led to inconsistency and confusion in our smart homes.\n\nRiedl says that no one has really figured out how to train LLMs to understand when to be very precise and when to embrace randomness, meaning even the “tame” LLMs can still get things wrong. “If you wanted to have a machine that just was never random at all, you could tamp it all down,” says Riedl. But that same chatbot would not be more conversational or able to tell your kid fantastical bedtime stories — both capabilities that Alexa and Google are touting. “If you want it all in one, you’re really making some tradeoffs.”\n\nThese struggles in its deployment in the smart home could be a harbinger of broader issues for the technology. If AI can’t turn on the lights reliably, why should anyone rely on it to do more complex tasks, asks Riedl. “You have to walk before you can run.”\n\nBut tech companies are known for their propensity to move fast and break things. “The story of language models has always been about taming the LLMs,” says Riedl. “Over time, they become more tame, more reliable, more trustworthy. But we keep pushing into the fringe of those spaces where they’re not.”\n\nRiedl does believe in the path to a purely agentic assistant. “I don’t know if we ever get to AGI, but I think over time we do see these things at least being more reliable.” The question for those of us dealing with these unreliable AIs in our homes today, however, is are we willing to wait and at what cost to the smart home in the meantime?", "language": "en", "category": "tech", "source": "https://www.theverge.com/rss/index.xml", "published": "2025-12-23T08:30:00-05:00", "fetched_at": "2025-12-23T14:42:38.628100"}
{"title": "The year the government broke", "link": "https://www.theverge.com/policy/845838/2025-year-end-government-doge", "summary": "The first crack showed right before Inauguration Day. The year before, Congress had overwhelmingly passed a bill banning TikTok unless it broke ties with its Chinese parent company. The Supreme Court unanimously upheld it, and it was clear what needed to happen next: either the president could give TikTok another 90 days to complete a [&#8230;]", "content": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nThe first crack showed right before Inauguration Day. The year before, Congress had overwhelmingly passed a bill banning TikTok unless it broke ties with its Chinese parent company. The Supreme Court unanimously upheld it, and it was clear what needed to happen next: either the president could give TikTok another 90 days to complete a deal or it would be banned immediately.\n\nBut neither of those things happened. Outgoing President Joe Biden punted the decision to incoming President Donald Trump, and after a dramatic few hours where TikTok took itself offline in the US, it returned with a triumphant message thanking Trump for saving it.\n\nNearly a year and four extra-legal extensions later, TikTok remains in the States, owned by the same Chinese company lawmakers warned would gravely endanger US national security. It only recently announced it had finalized a deal to sell its US-based business, with a targeted closing date of January 22nd, 2026 — more than a year after it was first supposed to be banned. The whole ordeal felt like a comedy of errors, where ultimately everyone threw up their hands. The few details known about a supposedly coming deal raise questions about whether it will even comply with the law’s original requirements.\n\nThe failure to take any action at all against TikTok following the panic around its alleged national security risks is just one of many cracks to the federal government’s foundation this year. In March, Secretary of War Pete Hegseth communicated war plans over Signal — an encrypted messaging platform but not one meant for such a use case due to potential security risks on users’ devices — which we only found out about because Trump’s then-national security adviser apparently accidentally added the editor-in-chief of The Atlantic to that chat.\n\nAnd then there was the biggest full-on rupture to the government in 2025: Elon Musk’s pet project, DOGE\n\nThere have been many other instances where democracy’s counterweights have shown signs of life, and at times, even bravery\n\nOf course, the only true test of a democracy’s durability is to see how its checks fare when things break. The TikTok saga shows one example where — at least so far — they have weathered poorly. Congress has issued tepid statements about the executive branch’s unwillingness to enforce the law, but there’s no appetite to impeach Trump over it, and the judicial branch can’t or won’t force action, either. But there have been many other instances where democracy’s counterweights have shown signs of life, and at times, even bravery.\n\nAs 2026 approaches, political posturing for the midterms is likely to overshadow any real efforts at policymaking. With that will come a slew of messages from politicians promising to fix what was broken this year and also promising to break what hasn’t worked in far too long. Voters will choose who they think can best put it all back together. Only then will we find out how deep the cracks actually go.", "language": "en", "category": "tech", "source": "https://www.theverge.com/rss/index.xml", "published": "2025-12-23T08:00:00-05:00", "fetched_at": "2025-12-23T14:42:38.794131"}
{"title": "Apple fined $116 million over app privacy prompts", "link": "https://www.theverge.com/news/849528/apple-italy-antitrust-fine-att-app-privacy", "summary": "Apple has been fined more than &#8364;98 million (about $116 million) by Italy's antitrust regulator over the \"excessively burdensome\" privacy rules it imposes on third-party apps. The Italian Competition Authority (AGCM) says that Apple abused its dominant app store market position by burdening developers with \"disproportionate\" terms around data collection that exceed privacy law requirements, [&#8230;]", "content": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nApple has been fined more than €98 million (about $116 million) by Italy’s antitrust regulator over the “excessively burdensome” privacy rules it imposes on third-party apps. The Italian Competition Authority (AGCM) says that Apple abused its dominant app store market position by burdening developers with “disproportionate” terms around data collection that exceed privacy law requirements, compared to rules for native iOS apps.\n\nThe fine specifically targets the App Tracking Transparency (ATT) policy Apple launched in 2021, which requires third-party developers to ask users for consent twice to track their data across other apps and websites. Apple’s own apps can obtain this permission in a single tap. AGCM says that the burden of consenting twice led to a reduction in user consent rates for advertising profiling, thus harming developers whose business models depend upon revenue generated by personalized ads.\n\n“The Authority established that the terms of the ATT policy are imposed unilaterally and harm the interests of Apple’s commercial partners,” the AGCM said in its announcement. ”The double consent request renders the ATT policy disproportionate, since Apple should have ensured the same level of privacy protection for users by allowing developers to obtain consent to profiling in a single step.”\n\nThis follows the Cupertino company being fined $162.4 million by France’s competition watchdog in March over similar concerns with Apple’s ATT system. Apple said in a statement to Reuters that it “strongly disagrees” with the AGCM and will appeal the decision, pushing its commitment “to defend strong privacy protections.”", "language": "en", "category": "tech", "source": "https://www.theverge.com/rss/index.xml", "published": "2025-12-23T07:46:56-05:00", "fetched_at": "2025-12-23T14:42:38.952414"}
{"title": "Dometic makes a better portable water faucet", "link": "https://www.theverge.com/tech/848916/dometic-recon-360-water-pump-review", "summary": "As a reluctant doomsday prepper and eager vanlifer, Dometic's battery-powered Go Faucet has, for the last few years, played a central role in my bougie bug-out kit and my camping rig's water system. So it took me all of two minutes with Dometic's new Recon 360 Faucet to realize it's an upgrade in every single [&#8230;]", "content": "is a deputy editor and Verge co-founder with a passion for human-centric cities, e-bikes, and life as a digital nomad. He’s been a tech journalist for 20 years.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nAs a reluctant doomsday prepper and eager vanlifer, Dometic’s battery-powered Go Faucet has, for the last few years, played a central role in my bougie bug-out kit and my camping rig’s water system. So it took me all of two minutes with Dometic’s new Recon 360 Faucet to realize it’s an upgrade in every single way that matters — and then confirmed after a week of testing it.\n\nThe Recon 360 Faucet lets you pump water out of a storage container like a typical faucet in places that lack traditional plumbing, be it inside a boat, cabin, or van, or at the beach, job site, or campground. A long silicone water hose attaches to the back of the faucet and snaps into the CPC quick-connect fitting found on Dometic’s Go Jug or Recon Hardside Coolers. But there’s nothing to stop you from dropping that tube into any jerry can via a third-party CPC adapter. It also works with inline filters like the one I use from LifeStraw and Camelbak.\n\nAs to the upgrades, the Recon 360 Faucet ditches the easy-to-miss touch surface for real mechanical buttons. One button produces a standard water flow to brush your teeth or fill a glass, and the second, larger button emits a more forceful stream for washing dishes, your hair, or quickly filling a water bottle before heading out on a hike. The water stream shuts off with a second press of the active button, otherwise it’ll automatically stop the flow after 90 seconds or 1.5L/3L to avoid depleting that precious resource.\n\nIt’s very small and portable with a battery good for about 150 liters. Here in my van, the rotating base prevents the stiff water tube from twisting the faucet away from the sink. Stacked on top of Dometic’s 11-liter Go Jug, where the water tube connects through that white CPC coupler on top. The light is very useful at night. Pictured here in a blacked-out room.\n\nIn my testing, pressing the smaller button extracts one liter of water in 41 seconds (at a loud 52dB from arm’s length), while the fast button yields one liter in just 24 seconds at an even louder 60dB. The low-flow mode is quieter than the original one-button Go Faucet, with a less annoying drone due to its lower pitch. However, it’s still too loud for vanlifers to sneak a glass of water at night while others sleep, although the bright LED light that illuminates the stream certainly makes it possible.\n\nAnd as the name suggests, the base can now be rotated 360 degrees for more placement options. It’s a welcome change that should reduce the number of times I have to clean water off my kitchen counter when the stiff, crimp-resistant water hose — included with both Dometic models — caused the lightweight Go Faucet to twist away from the sink.\n\nThankfully, the new tap has also been migrated from Micro USB to a USB-C connector for charging, with a battery that’s still good for about 150 liters (about 40 gallons). The Recon 360 Faucet now also has a 4-stage LED meter on top that shows the remaining charge.\n\nThe faucet is slightly smaller but a little heavier than the Go model. It comes with a selection of metal pucks that can be adhered to a countertop or water jug to create a platform for the faucet’s magnetic base. The force of the new magnet feels about twice as strong as the older model, which should hold the faucet in place better when driving down bumpy roads. That’s good because I’ve sent my Go Faucet flying through the van about five or six times now, yet it just keeps on pumping. I hope the Recon 360 Faucet is just as durable.\n\nPrevious Next\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 9 The water hose clicks into the Dometic Go Jug (shown here), Dometic’s new Recon Hardside Coolers, and even generic jerry cans that use universal CPC couplers.\n\nThe only real issue is the price: $149.99 for the Recon 360 Faucet, instead of $99.99 for the Go Faucet, which Dometic still sells. The Go Faucet is great, but the Recon 360 fixes so many little complaints that I think it’s worth every extra penny. Yes, there are cheaper and less-functional alternatives to be had on Amazon and AliExpress, but if you need to use a portable faucet regularly, like I do, then Dometic’s durable and feature-rich faucets won’t disappoint if you can afford them.\n\nAll photography by Thomas Ricker / The Verge", "language": "en", "category": "tech", "source": "https://www.theverge.com/rss/index.xml", "published": "2025-12-23T05:44:07-05:00", "fetched_at": "2025-12-23T14:42:39.123442"}
{"title": "Laptop Buying Guide (2025): How to Choose the Right PC (Step-by-Step Guide)", "link": "https://www.wired.com/story/how-to-buy-the-right-laptop-for-you/", "summary": "Shopping for a laptop can be infuriating. Here’s how to sift through the acronyms, storage options, and extra features to find the best one for you.", "content": "Buying a laptop is an exercise in confusion. Even if you know what everything means and exactly what you want, finding it can be difficult. Heck, just navigating the manufacturer's website to locate the model you want is frustrating. We hope this guide will help you traverse the morass of modern laptops. Below is a section on every major component you'll want to know about when you browse for the best laptop for you. We break down the jargon and explain things on a practical level, so you end up with a machine that's the right fit.\n\nUpdated December 2025: We've added the latest chip news from Intel, AMD, Apple, and Qualcomm. We also have details about the incoming memory shortage and the future of ChromeOS.\n\nUnderstanding Use Cases and Budget\n\nBefore getting into the nitty-gritty, I always recommend starting with the biggest question first: What will you do with your new laptop? Is this a business machine meant primarily for office work and other simple tasks that can be done in a browser? Or perhaps you have a burgeoning interest in a hobby like PC gaming, video editing, coding, or design. Maybe one of those hobbies is more of a job for you, meaning you'll want something that is designed from the ground up to accelerate work in those applications. On the other side of the spectrum, maybe you plan to primarily use your laptop on the go, whether that's on a plane or in coffee shops. In that case, portability and battery life may be the most important factors to consider.\n\nThe answer to those questions will help point you in the right direction and ensure that you don't overspend on features or performance you don't need. For example, buying a MacBook Pro instead of a MacBook Air just because you have extra money to spend isn't a good idea. That brings us to the budget: $1,000 is an important price. There are many good options below that price, but it's the level at which you can expect laptops to feel premium and lack any significant compromises. It's the starting retail price of the starting MacBook Air, as well as several Windows laptops. Thanks to solid discounts, it's not uncommon to see these laptops dip in price to $700.\n\nSpeaking of Windows laptops, you'll have to be patient to find something under $600 that's still worth buying. If your budget is $500 or less, you're better off buying a Chromebook. They'll feel faster and lighter, and usually get longer battery life too, at least compared to similarly priced Windows laptops.\n\nWhich Operating System Is Best?\n\nCourtesy of Apple\n\nI won't waste your time repeating the same arguments you've probably already heard about why macOS is better than Windows, or vice versa. Both have strengths and weaknesses, and you likely already have opinions about them. The truth is that these operating systems are more similar today than they have ever been, not unlike Android and iOS. So if you're on the fence, I recommend opting for a laptop that runs whichever is most familiar.", "language": "en", "category": "tech", "source": "https://www.wired.com/feed/rss", "published": "Tue, 23 Dec 2025 13:00:00 +0000", "fetched_at": "2025-12-23T14:42:39.497323"}
{"title": "iBuyPower RDY Slate 9MP R01 Gaming PC Review: Great Value", "link": "https://www.wired.com/review/ibuypower-rdy-slate-9mp-r01/", "summary": "iBuyPower’s prebuilt gaming desktop tries some new tricks but comes with a few flaws.", "content": "The iBuyPower Slate system I spent the last month gaming on isn’t particularly flashy, nor is it a shining example of the heights that gaming PC brands can reach. It is, however, a totally usable system with minimal bloatware, and any qualms I have with some odd choices don’t harm the gaming performance.\n\nAt its listed price of almost $2,000, this configuration of the iBuyPower is charging you a modest premium just to install (almost) all of the components, but frequent sales and discounts make this a more palatable deal as the price gets lower.\n\nIt’s really only set back by some minor assembly issues, as well as parts that may limit future upgrades, which currently affects users at opposite ends of the PC building spectrum disproportionately. Given the current RAM pricing issues, this is a better value than ever, and perhaps cheaper than an off-the-shelf build.\n\nPhotograph: Brad Bourque\n\nA Mixed Experience\n\nFirst, the good stuff: The GPU is packaged separately from the rest of the system, which may sound odd, but I've found that’s one of the most common pain points when shipping a new gaming PC. I’ve seen system builders use expanding foam, special brackets, and folded cardboard supports, among other solutions, but packing the graphics cards in its original box is far simpler and safer, and the other ways of shipping a PC with an installed graphics card still require opening the system up anyway. I do wish the instructions were more specific to the case, particularly since the PCIe bracket might be a little fiddly for total novices, but anyone who has worked with gaming systems in the past shouldn't have any issues.\n\nThe case isn't particularly unique or eye-catching, but it does have a wide, slightly smoky glass side panel that helps give it a clean silhouette. The dark tint allows the lights underneath to shine a bit without the whole system being overtly gamer-coded, but also makes them extremely reflective. There are no screws holding it in place, it’s just press fit, but it’s nice and sturdy, and I didn’t worry about it falling out. Like most glass panels, they inhibit airflow, so iBuyPower has set the front fan array an inch or so back from the panel, and added mesh sections at the top and bottom, which helps alleviate the issue. Even so, I can’t imagine the fan directly behind the center glass panel is doing all that much.", "language": "en", "category": "tech", "source": "https://www.wired.com/feed/rss", "published": "Tue, 23 Dec 2025 12:00:00 +0000", "fetched_at": "2025-12-23T14:42:39.733597"}
{"title": "Google’s and OpenAI’s Chatbots Can Strip Women in Photos Down to Bikinis", "link": "https://www.wired.com/story/google-and-openais-chatbots-can-strip-women-in-photos-down-to-bikinis/", "summary": "Users of AI image generators are offering each other instructions on how to use the tech to alter pictures of women into realistic, revealing deepfakes.", "content": "Some users of popular chatbots are generating bikini deepfakes using photos of fully clothed women as their source material. Most of these fake images appear to be generated without the consent of the women in the photos. Some of these same users are also offering advice to others on how to use the generative AI tools to strip the clothes off of women in photos and make them appear to be wearing bikinis.\n\nUnder a now-deleted Reddit post titled “gemini nsfw image generation is so easy,” users traded tips for how to get Gemini, Google’s generative AI model, to make pictures of women in revealing clothes. Many of the images in the thread were entirely AI, but one request stood out.\n\nA user posted a photo of a woman wearing an Indian sari, asking for someone to “remove” her clothes and “put a bikini” on instead. Someone else replied with a deepfake image to fulfil the request. After WIRED notified Reddit about these posts and asked the company for comment, Reddit’s safety team removed the request and the AI deepfake.\n\n“Reddit's sitewide rules prohibit nonconsensual intimate media, including the behavior in question,” said a spokesperson. The subreddit where this discussion occurred, r/ChatGPTJailbreak, had over 200,000 followers before Reddit banned it under the platform’s “don't break the site” rule.\n\nAs generative AI tools that make it easy to create realistic but false images continue to proliferate, users of the tools have continued to harass women with nonconsensual deepfake imagery. Millions have visited harmful “nudify” websites, designed for users to upload real photos of people and request for them to be undressed using generative AI.\n\nWith xAI’s Grok as a notable exception, most mainstream chatbots don’t usually allow the generation of NSFW images in AI outputs. These bots, including Google’s Gemini and OpenAI’s ChatGPT, are also fitted with guardrails that attempt to block harmful generations.\n\nIn November, Google released Nano Banana Pro, a new imaging model that excels at tweaking existing photos and generating hyperrealistic images of people. OpenAI responded last week with its own updated imaging model, ChatGPT Images.\n\nAs these tools improve, likenesses may become more realistic when users are able to subvert guardrails.\n\nIn a separate Reddit thread about generating NSFW images, a user asked for recommendations on how to avoid guardrails when adjusting someone’s outfit to make the subject’s skirt appear tighter. In WIRED’s limited tests to confirm that these techniques worked on Gemini and ChatGPT, we were able to transform images of fully clothed women into bikini deepfakes using basic prompts written in plain English.", "language": "en", "category": "tech", "source": "https://www.wired.com/feed/rss", "published": "Tue, 23 Dec 2025 11:30:00 +0000", "fetched_at": "2025-12-23T14:42:39.974506"}
{"title": "Chinese Crypto Scammers on Telegram Are Fueling the Biggest Darknet Markets Ever", "link": "https://www.wired.com/story/expired-tired-wired-chinese-scammer-crypto-markets/", "summary": "Online black markets once lurked in the shadows of the dark web. Today, they’ve moved onto public platforms like Telegram—and are racking up historic illicit fortunes.", "content": "When black markets for drugs, guns, and all manner of contraband first sprang up on the dark web more than a decade ago, it seemed that cryptocurrency and the technical sophistication of the anonymity software Tor were the keys to carrying out billions of dollars worth of untouchable, illicit transactions online.\n\nNow, all of that looks a bit passé. In 2025, all it takes to get away with tens of billions of dollars in black-market crypto deals is a messaging platform willing to host scammers and human traffickers, enough persistence to relaunch channels and accounts on that service when they’re occasionally banned, and fluency in Chinese.\n\nThe ecosystem of marketplaces for Chinese-speaking crypto scammers hosted on the messaging service Telegram have now grown to be bigger than ever before, according to a new analysis from the crypto tracing firm Elliptic. Despite a brief drop after Telegram banned two of the biggest such markets in early 2025, the two current top markets, known as Tudou Guarantee and Xinbi Guarantee, are together enabling close to $2 billion a month in money-laundering transactions, sales of scam tools like stolen data, fake investment websites, and AI deepfake tools, as well as other black market services as varied as pregnancy surrogacy and teen prostitution.\n\nexpired: crypto markets for US drug dealers tired: crypto markets for Russian hackers wired: crypto markets for Chinese scammers Read more Expired/Tired/WIRED 2025 stories here.\n\nThe crypto romance and investment scams regrettably known as “pig butchering”—carried out largely from compounds in Southeast Asia staffed with thousands of human trafficking victims—have grown to become the world’s most lucrative form of cybercrime. They pull in around $10 billion annually from US victims alone, according to the FBI. By selling money-laundering services and other scam-related offerings to those operations, markets like Tudou Guarantee and Xinbi Guarantee have grown in parallel to an immense scale.\n\n“When you consider illicit use of crypto assets, there really isn’t anything larger right now,” says Tom Robinson, Elliptic’s cofounder and chief scientist.\n\nIn fact, these criminal trading zones aren’t simply the biggest online black markets of the moment, but the biggest in history. AlphaBay was once the biggest dark-web market for drugs, stolen data, and hacking tools. Described by the FBI as 10 times the size of the original Silk Road dark-web drug market at its peak, AlphaBay facilitated more than $1 billion in transactions over its two and a half years online. Hydra, a Russian dark-web market that also offered money-laundering services to cryptocurrency thieves and ransomware groups, did more than $5 billion in transactions over its seven years of operation.\n\nBy comparison, Huione Guarantee, the Chinese-language, Telegram-based market used largely by crypto scammers, facilitated a stunning $27 billion in transactions from 2021 to 2025, according to Elliptic, dwarfing every online black market before it, even as it operated in full public view on Telegram’s messaging platform. Elliptic has called it simply “the largest illicit online marketplace to have ever operated.”", "language": "en", "category": "tech", "source": "https://www.wired.com/feed/rss", "published": "Tue, 23 Dec 2025 11:00:00 +0000", "fetched_at": "2025-12-23T14:42:40.212432"}
{"title": "Big Balls Was Just the Beginning", "link": "https://www.wired.com/story/expired-tired-wired-doge/", "summary": "DOGE dominated the news this year as Elon Musk’s operatives shook up several US government agencies. It’s far from over.", "content": "Since the beginning of the Trump administration, the so-called Department of Government Efficiency (DOGE), the brainchild of billionaire Elon Musk, has gone through several iterations, leading periodically to claims—most recently from the director of the Office of Personnel Management—that the group doesn’t exist, or has vanished altogether.\n\nBut DOGE isn’t dead. Many of its original members are in full-time roles at various government agencies, and the new National Design Studio (NDS) is headed by Airbnb cofounder Joe Gebbia, a close ally of Musk’s.\n\nEven if DOGE doesn’t survive another year, or until the US semiquincentennial—its original expiration date, per the executive order establishing it—the organization’s larger project will continue. DOGE from its inception was used for two things, both of which have continued apace: the destruction of the administrative state and the wholesale consolidation of data in service of concentrating power in the executive branch. It is a pattern that experts say could spill over beyond the Trump administration.\n\n“I do think it has altered the norms about where legislative power ends and where executive power begins simply by ignoring those norms,” says Don Moynihan, a professor of public policy at the University of Michigan. “This is not necessarily going to be limited to Republican administrations. There are going to be future Democratic presidents who will say, ‘Well, DOGE was able to do this, why can't we?’”\n\nThe earliest days of DOGE were characterized by a chaotic blitz in which small teams of DOGE operatives, like the now infamous Edward “Big Balls” Coristine, were deployed across government agencies, demanding high-level access to sensitive data, firing workers, and cutting contracts. And while these moves were often radical, if not appearing to be illegal, as matters of bureaucratic operation, they were in service of what had been the Trump administration’s agenda all along.\n\nexpired: big balls tired: big balls wired: big balls Read more Expired/Tired/WIRED 2025 stories here.\n\nGoals like cutting discretionary spending and drastically reducing the size of the federal workforce had already been championed by people like vice president JD Vance, who in 2021 called for the “de-Ba’athification” of the government, and Russell Vought, now the head of the Office of Management and Budget (OMB). These goals were also part of Project 2025. What DOGE brought wasn’t the end, but the means—its unique insight was that controlling technical infrastructure, something achievable with a small group, functionally amounted to controlling the government.\n\n“There has never been a unit of government that was handed so much power to fundamentally upend government agencies with so little oversight,” says Moynihan.\n\nUnder the Constitution, the authority for establishing and funding federal agencies comes from Congress. But Trump and many of the people who support him, including Vought and Vance, adhere to what was until relatively recently a fringe view of how government should be run: the unitary executive theory. This posits that, much like the CEO of a company, the president has near complete control over the executive branch, of which federal agencies are a part—power more like that of a king than of the figure described in the nation’s founding documents.", "language": "en", "category": "tech", "source": "https://www.wired.com/feed/rss", "published": "Tue, 23 Dec 2025 11:00:00 +0000", "fetched_at": "2025-12-23T14:42:40.480201"}
{"title": "The tooth fairy just got reimagined for the tech-savvy generation", "link": "https://techcrunch.com/2025/12/23/the-tooth-fairy-just-got-reimagined-for-the-tech-savvy-generation/", "summary": "Move over, Santa. Now there’s another magical character for kids to track: the Tooth Fairy. After making a personalized Tooth Fairy video for his nephew, Oliver Finel noticed a gap. While there are plenty of Santa trackers, nothing similar existed for the Tooth Fairy. Recognizing that Generation Alpha is growing up with interactive online experiences [&#8230;]", "content": "Move over, Santa. Now there’s another magical character for kids to track: the Tooth Fairy.\n\nAfter making a personalized Tooth Fairy video for his nephew, Oliver Finel noticed a gap. While there are plenty of Santa trackers, nothing similar existed for the Tooth Fairy. Recognizing that Generation Alpha is growing up with interactive online experiences at their fingertips, he set out to create a new kind of adventure that families everywhere could enjoy.\n\nTooth Fairy Tracker features Kiki the Tooth Fairy as its central character. When a child loses a tooth, parents can visit the website and enter their email to receive notifications as Kiki begins her mission. Throughout the evening, children receive a series of video updates showing Kiki preparing for her journey, departing from headquarters, and traveling to collect the tooth. These updates may include flight speed information, vlog-style check-ins, and cute selfies.\n\nThe experience is hosted entirely on the site, with countdowns to each new video, making it feel like an exciting day-long event that builds anticipation for bedtime. Plus, Finel believes the evening updates help motivate children to brush their teeth and prepare for sleep. Then, the final update takes place in the morning, when the child is congratulated and can check their special gift under their pillow.\n\nImage Credits:Kiki the Tooth Fairy/Oliver Finel\n\nLaunched in October, the website is gearing up to launch a redesign soon. Finel explains that while the core experience will remain unchanged, the site will feature “a more playful design and a few added details to make it more immersive for kids.”\n\nLooking ahead to 2026, Finel is preparing to launch a revamped version of the tracker featuring even more personalization. Kiki will say each child’s name, mention their hobbies, and include their photo in every video. Kids will also receive custom certificates for each lost tooth. Another upcoming feature entails oral-care videos where Kiki teaches children healthy brushing habits.\n\nThe enhanced experience will be available via a new subscription for $20, which includes 6 Kiki visits.\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nAdditionally, Finel plans to adapt the product for families in Latin America and Western Europe, making it more culturally relevant. For example, while the Tooth Fairy is most popular in the U.S., the Tooth Mouse is popular in France, Spain, and Russia.\n\nHe also hopes to partner with pediatric dentists, so dental offices can offer the Kiki the Tooth Fairy experience to young patients. Pre-appointment videos can help ease anxiety, while post-visit rewards encourage kids to return to the dentist and make the experience more positive.\n\nOther long-term roadmap plans include branded toothbrushes and toothpaste, each accompanied by a personalized video of Kiki choosing the bristles for the toothbrush, picking colors, and assembling it just for the child.\n\nThe Tooth Fairy tracker is free to use and requires no app or account.", "language": "en", "category": "tech", "source": "https://techcrunch.com/feed/", "published": "Tue, 23 Dec 2025 14:00:00 +0000", "fetched_at": "2025-12-23T14:42:40.631760"}
{"title": "OpenAI says AI browsers may always be vulnerable to prompt injection attacks", "link": "https://techcrunch.com/2025/12/22/openai-says-ai-browsers-may-always-be-vulnerable-to-prompt-injection-attacks/", "summary": "OpenAI says prompt injections will always be a risk for AI browsers with agentic capabilities, like Atlas. But the firm is beefing up its cybersecurity with an \"LLM-based automated attacker.\"", "content": "Even as OpenAI works to harden its Atlas AI browser against cyberattacks, the company admits that prompt injections, a type of attack that manipulates AI agents to follow malicious instructions often hidden in web pages or emails, is a risk that’s not going away anytime soon — raising questions about how safely AI agents can operate on the open web.\n\n“Prompt injection, much like scams and social engineering on the web, is unlikely to ever be fully ‘solved,’” OpenAI wrote in a Monday blog post detailing how the firm is beefing up Atlas’ armor to combat the unceasing attacks. The company conceded that “agent mode” in ChatGPT Atlas “expands the security threat surface.”\n\nOpenAI launched its ChatGPT Atlas browser in October, and security researchers rushed to publish their demos, showing it was possible to write a few words in Google Docs that were capable of changing the underlying browser’s behavior. That same day, Brave published a blog post explaining that indirect prompt injection is a systematic challenge for AI-powered browsers, including Perplexity’s Comet.\n\nOpenAI isn’t alone in recognizing that prompt-based injections aren’t going away. The U.K.’s National Cyber Security Centre earlier this month warned that prompt injection attacks against generative AI applications “may never be totally mitigated,” putting websites at risk of falling victim to data breaches. The U.K. government agency advised cyber professionals to reduce the risk and impact of prompt injections, rather than think the attacks can be “stopped.”\n\nFor OpenAI’s part, the company said: “We view prompt injection as a long-term AI security challenge, and we’ll need to continuously strengthen our defenses against it.”\n\nThe company’s answer to this Sisyphean task? A proactive, rapid-response cycle that the firm says is showing early promise in helping discover novel attack strategies internally before they are exploited “in the wild.”\n\nThat’s not entirely different from what rivals like Anthropic and Google have been saying: that to fight against the persistent risk of prompt-based attacks, defenses must be layered and continuously stress-tested. Google’s recent work, for example, focuses on architectural and policy-level controls for agentic systems.\n\nBut where OpenAI is taking a different tact is with its “LLM-based automated attacker.” This attacker is basically a bot that OpenAI trained, using reinforcement learning, to play the role of a hacker that looks for ways to sneak malicious instructions to an AI agent.\n\nThe bot can test the attack in simulation before using it for real, and the simulator shows how the target AI would think and what actions it would take if it saw the attack. The bot can then study that response, tweak the attack, and try again and again. That insight into the target AI’s internal reasoning is something outsiders don’t have access to, so, in theory, OpenAI’s bot should be able to find flaws faster than a real-world attacker would.\n\nIt’s a common tactic in AI safety testing: build an agent to find the edge cases and test against them rapidly in simulation.\n\n“Our [reinforcement learning]-trained attacker can steer an agent into executing sophisticated, long-horizon harmful workflows that unfold over tens (or even hundreds) of steps,” wrote OpenAI. “We also observed novel attack strategies that did not appear in our human red teaming campaign or external reports.”\n\nImage Credits:OpenAI\n\nIn a demo (pictured in part above), OpenAI showed how its automated attacker slipped a malicious email into a user’s inbox. When the AI agent later scanned the inbox, it followed the hidden instructions in the email and sent a resignation message instead of drafting an out-of-office reply. But following the security update, “agent mode” was able to successfully detect the prompt injection attempt and flag it to the user, according to the company.\n\nThe company says that while prompt injection is hard to secure against in a foolproof way, it’s leaning on large-scale testing and faster patch cycles to harden its systems before they show up in real-world attacks.\n\nAn OpenAI spokesperson declined to share whether the update to Atlas’ security has resulted in a measurable reduction in successful injections, but says the firm has been working with third parties to harden Atlas against prompt injection since before launch.\n\nRami McCarthy, principal security researcher at cybersecurity firm Wiz, says that reinforcement learning is one way to continuously adapt to attacker behavior, but it’s only part of the picture.\n\n“A useful way to reason about risk in AI systems is autonomy multiplied by access,” McCarthy told TechCrunch.\n\n“Agentic browsers tend to sit in a challenging part of that space: moderate autonomy combined with very high access,” said McCarthy. “Many current recommendations reflect that trade-off. Limiting logged-in access primarily reduces exposure, while requiring review of confirmation requests constrains autonomy.”\n\nThose are two of OpenAI’s recommendations for users to reduce their own risk, and a spokesperson said Atlas is also trained to get user confirmation before sending messages or making payments. OpenAI also suggests that users give agents specific instructions, rather than providing them access to your inbox and telling them to “take whatever action is needed.”\n\n“Wide latitude makes it easier for hidden or malicious content to influence the agent, even when safeguards are in place,” per OpenAI.\n\nWhile OpenAI says protecting Atlas users against prompt injections is a top priority, McCarthy invites some skepticism as to the return on investment for risk-prone browsers.\n\n“For most everyday use cases, agentic browsers don’t yet deliver enough value to justify their current risk profile,” McCarthy told TechCrunch. “The risk is high given their access to sensitive data like email and payment information, even though that access is also what makes them powerful. That balance will evolve, but today the trade-offs are still very real.”", "language": "en", "category": "tech", "source": "https://techcrunch.com/feed/", "published": "Mon, 22 Dec 2025 22:11:19 +0000", "fetched_at": "2025-12-23T14:42:40.757908"}
{"title": "Alphabet to buy Intersect Power to bypass energy grid bottlenecks", "link": "https://techcrunch.com/2025/12/22/alphabet-to-buy-intersect-power-to-bypass-energy-grid-bottlenecks/", "summary": "Alphabet is set to pay $4.75 billion in cash, plus debt, for the data center and clean energy developer.", "content": "In Brief\n\nGoogle parent Alphabet has agreed to buy Intersect Power, a data center and clean energy developer, for $4.75 billion in cash, plus the assumption of the company’s debt.\n\nThe acquisition, which was announced Monday, will help Alphabet expand its power-generation capacity alongside new data centers without having to rely on local utilities that are struggling to keep up with the demand of AI companies. Securing access to energy that powers data centers has become a critical part of training AI models.\n\nAlphabet previously held a minority stake in Intersect Power after Google and TPG Rise Climate led an $800 million strategic funding round in the company last December. That partnership set a target of $20 billion in total investment by 2030.\n\nThe acquisition includes Intersect’s future development projects but excludes its existing operation, which will be bought out by other investors and managed as a separate company.\n\nIntersect’s new data parks, which are essentially locations next to wind, solar, and battery power, are expected to be operational late next year and fully completed by 2027, Google said when it announced its minority investment.\n\nThe transaction is expected to close in the first half of next year.\n\nGoogle will be the primary user. However, Intersect’s campuses are designed as industrial parks that can host other companies’ AI chips alongside Google’s.", "language": "en", "category": "tech", "source": "https://techcrunch.com/feed/", "published": "Mon, 22 Dec 2025 21:10:54 +0000", "fetched_at": "2025-12-23T14:42:40.865345"}
{"title": "Trump admin halts 6 GW of offshore wind leases again", "link": "https://techcrunch.com/2025/12/22/trump-admin-halts-6-gw-of-offshore-wind-leases-again/", "summary": "The move is the latest attempt by the Trump administration to delay the construction of 6 gigawatts of offshore wind near a hotspot of data center development.", "content": "Two weeks after a judge struck down President Donald Trump’s executive order that blocked offshore wind development, the White House is again pausing leases for five large projects, this time citing concerns over radar interference.\n\n“Today’s action addresses emerging national security risks, including the rapid evolution of the relevant adversary technologies, and the vulnerabilities created by large-scale offshore wind projects with proximity near our east coast population centers,” Interior Secretary Doug Burgum said Monday in a statement.\n\nThe affected projects include Revolution Wind in Connecticut and Rhode Island, Coastal Virginia Offshore Wind, Vineyard Wind in Massachusetts, and Empire Wind and Sunrise Wind, both of which are in New York. In total, these projects represent nearly 6 gigawatts of generating capacity for the Eastern seaboard, a hotspot of data center development.\n\nThe Department of the Interior justified the action by citing unclassified government reports — it didn’t say which agency had produced them, nor did it link to them — along with “recently completed classified reports” from the Pentagon. The department said it would give the government time to work with stakeholders to address national security concerns.\n\nThe statement did not acknowledge the ongoing work government and wind developers have been doing to address national security concerns, specifically related to radar, for years.\n\nThe report the Interior Department is likely referring to was issued by the Department of Energy in February 2024, and it lists a number of projects that were then underway to mitigate the problem of radar interference. (Other reports over the years have been commissioned to address the same concerns, some dating back to the previous Trump administration.)\n\n“To date, no mitigation technology has been able to fully restore the technical performance of impacted radars,” the 2024 report said. “However, the development and use of radar interference mitigation techniques, and collaboration both among federal agencies and between the federal government and the wind industry have enabled federal radar agencies to continue to perform their missions without significant impacts, and have also enabled significant wind energy deployments throughout the United States.”\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nRadar interference caused by wind turbines is nothing new. Researchers have been studying the phenomenon for well over a decade, and they’ve developed a range of strategies to mitigate any problems.\n\nWind turbines present a unique challenge to radar operators.\n\n“The motion of a wind turbine gives it a complex Doppler signature,” Nicholas O’Donoughue, a senior engineer at the Rand Corporation, told TechCrunch.\n\nDoppler refers to the change in frequency of a wave like a radar signal caused by a moving object. As a wind turbine’s blades sweep through their arc, they are alternately moving toward and away from the radar station. The angle and speed of the blades can have an effect, too.\n\nThose, along with other considerations, can “challenge the detection of any targets that are near the wind farm,” O’Donoughue said.\n\nBut radar systems can filter out signals that result from wind farms. “The primary approach is to use adaptive processing algorithms, such as Space-Time Adaptive Processing, to learn the structure of a wind farm’s interference,” he said.\n\n“Over time, the reflections from a wind farm can be processed to look for patterns, which can then be matched and suppressed. This process is analogous to how modern adaptive noise cancellation headphones work, albeit more complicated.” Objects with a low radar cross section can still slip through, he noted.\n\nBecause of that, many wind farms are already built with radar installations in mind. “The most basic and widely employed mitigation method is wind farm siting, such as modifying the layout of a proposed wind farm to keep the wind turbines out of the line-of-sight of the radar,” the 2024 Energy department report said.", "language": "en", "category": "tech", "source": "https://techcrunch.com/feed/", "published": "Mon, 22 Dec 2025 20:52:31 +0000", "fetched_at": "2025-12-23T14:42:40.991369"}
{"title": "Paramount renews bid for Warner Bros, ensuring $40B Larry Ellison backing", "link": "https://techcrunch.com/2025/12/22/paramount-renews-bid-for-warner-bros-ensuring-40-billion-larry-ellison-backing/", "summary": "It's the latest attempt by one major Hollywood superpower to acquire another.", "content": "The war for the future of Warner Brothers continues, as Paramount Skydance announced Monday an amended all-cash offer for the legacy movie studio. The offer includes an “irrevocable personal guarantee” from a major backer, Oracle billionaire Larry Ellison, to provide tens of billions in equity financing for the deal. It’s the latest move by Ellison’s son, David Ellison — the CEO of Paramount Skydance — to pry the potential acquisition loose from his competition, the streaming giant Netflix.\n\n“Larry Ellison has agreed to provide an irrevocable personal guarantee of $40.4 billion of the equity financing for the offer and any damages claims against Paramount,” a Paramount press release published Monday states. The proposed equity financing had previously been included in Paramount’s offer, but the elder Ellison’s “personal guarantee” is new, the press release states.\n\nThe revamped offer comes a mere week after the WBD board rejected Paramount’s initial bid, favoring, instead, a previous deal with Netflix. That deal was announced on December 5, outlining how the streamer would purchase the movie studio via a cash and stock option valued at $27.75 per WBD share, and a total enterprise value of $82.7 billion.\n\nThree days after the Netflix deal was announced, Paramount launched a hostile bid valued at $108.4 billion, offering $30 per share. The WBD board rejected this offer, calling it “illusory” and claiming that Paramount had misled shareholders about the proposed deal’s financing. At the time of the rejection, the board noted that the deal with Netflix was “a binding agreement with enforceable commitments, with no need for any equity financing and robust debt commitments.”\n\nNow, Paramount’s amended offer has been designed to “address WBD’s stated concerns regarding Paramount’s superior offer,” Paramount said. In October, CNBC reported that, prior to the Netflix deal, WBD had previously rejected three different takeover offers from Paramount.\n\n“Paramount has repeatedly demonstrated its commitment to acquiring WBD,” said Paramount Skydance CEO David Ellison, in Monday’s press release. “Our $30 per share, fully financed all-cash offer was on December 4, and continues to be, the superior option to maximize value for WBD shareholders. Because of our commitment to investment and growth, our acquisition will be superior for all WBD stakeholders, as a catalyst for greater content production, greater theatrical output, and more consumer choice.”\n\nHe added: “We expect the board of directors of WBD to take the necessary steps to secure this value-enhancing transaction and preserve and strengthen an iconic Hollywood treasure for the future.”\n\nTechCrunch reached out to Warner Bros. Discovery for comment.", "language": "en", "category": "tech", "source": "https://techcrunch.com/feed/", "published": "Mon, 22 Dec 2025 19:53:33 +0000", "fetched_at": "2025-12-23T14:42:41.104369"}
{"title": "The Splay is a subpar monitor but an exciting portable projector", "link": "https://arstechnica.com/gadgets/2025/12/the-splay-is-a-subpar-monitor-but-an-exciting-portable-projector/", "summary": "Splay can be a monitor and takes a lot of the stress out of projectors, too.", "content": "Since I’m fascinated by new display technologies and by improving image quality, I’ve never been a fan of home projectors. Projectors lack the image quality compared to good TVs and monitors, and they’re pretty needy. Without getting into the specific requirements of different models, you generally want a darker room with a large, blank wall for a projector to look its best. That can be a lot to ask for, especially in small, densely decorated homes like mine.\n\nThat said, a projector can be a space-efficient alternative to a big-screen TV or help you watch TV or movies outside. A projector can be versatile when paired with the right space, especially if that projector makes sure the “right space” is included in the device.\n\nThe Splay was crowdfunded in 2021, and its maker, Arovia, describes it as the “first fully collapsible monitor and projector.” In short, it’s a portable projector with an integrated fabric shroud that can serve as a big-screen (24.5 or 34.5 inches diagonally, depending on the model) portable monitor. Or, you can take off the fabric shroud and use the Splay as an ultra-short-throw projector and cast a display that measures up to 80 inches diagonally onto a wall.\n\nAt its core, the Splay is a projector, meaning it can’t compete with high-end LCD-LED or OLED monitors. It costs $1,300; the device is currently sold out, but an Arovia representative told me that it will be restocked this month.\n\nHere’s how the device works, per one of Arovia’s patents\n\nThe … collapsible, portable display device, has a housing member having a sliding member aligned on the exterior of the housing member, and sliding along the exterior of said housing member between two operating positions, a collapsible screen containing one or more sheets of flexible, wrinkle resistant silicone or rubber materials containing optical enhancing components and capable of displaying an image when in an expanded operating position, and multiple collapsible members connected to said screen …\n\nArovia’s representative pointed to the Splay being used for mobile workspaces, gaming, and enterprise use cases, like trade shows.", "language": "en", "category": "tech", "source": "https://arstechnica.com/feed/", "published": "Tue, 23 Dec 2025 12:30:06 +0000", "fetched_at": "2025-12-23T14:42:41.578541"}
{"title": "In a surprise announcement, Tory Bruno is out as CEO of United Launch Alliance", "link": "https://arstechnica.com/space/2025/12/in-a-surprise-announcement-tory-bruno-is-out-as-ceo-of-united-launch-alliance/", "summary": "\"It has been a great privilege to lead ULA through its transformation and to bring Vulcan into service.\"", "content": "Tory Bruno, a veteran engineer and aerospace industry executive, has resigned from the top job at United Launch Alliance after more than a decade competing against the growing dominance of SpaceX, the company announced Monday.\n\nThe news of Bruno’s sudden resignation was unexpected. His tenure was marked by a decline in ULA’s market share as rival SpaceX competed for and won ever-larger US government launch contracts. More recently, Bruno oversaw the successful debut of ULA’s Vulcan rocket, followed by struggles to ramp up the new rocket’s launch cadence.\n\nBruno had a 30-year career as an engineer and general manager for Lockheed Martin’s ballistic missile programs before taking over as president and CEO of United Launch Alliance in August 2014. He arrived as SpaceX started making inroads with its partially reusable Falcon 9 rocket, and ULA’s leading position in the US launch market looked to be in doubt.\n\nIn his first year, Bruno announced what would become the Vulcan rocket and the phaseout of ULA’s legacy Atlas and Delta launch vehicles. He also selected Jeff Bezos’ Blue Origin, then an emerging space company, to build the Vulcan rocket’s booster engines, bypassing the industry’s established propulsion contractor.\n\nThe decision to develop a new rocket and the selection of the engine to power it proved to be correct. The Atlas V rocket, now nearing retirement, is powered by Russian engines, a nonstarter in today’s geopolitical reality, and the already-retired Delta IV launch vehicle was prohibitively expensive. The Vulcan rocket has been successful in all three of its flights so far, and the performance of Blue Origin’s liquid-fueled BE-4 engine has, by all accounts, been exceptional.\n\nHard times at the rocket ranch\n\nBut ULA’s potential for regaining its position atop the launch market was hamstrung by the company’s decision to make the Vulcan rocket fully expendable. There are long-term plans to recover and reuse the rocket’s main engines, but not the entire booster. And the new rocket’s entry into service has not been smooth. The Vulcan rocket flew just once this year after receiving certification from the US Space Force to carry national security satellites into orbit, well short of Bruno’s goal of flying the new launcher up to 10 times.", "language": "en", "category": "tech", "source": "https://arstechnica.com/feed/", "published": "Mon, 22 Dec 2025 23:51:44 +0000", "fetched_at": "2025-12-23T14:42:42.061462"}
{"title": "Call of Duty co-creator and Battlefield lead Vince Zampella dies in car crash", "link": "https://arstechnica.com/gaming/2025/12/vince-zampella-developer-of-call-of-duty-and-battlefield-games-dies-at-55/", "summary": "He had worked on Medal of Honor, Call of Duty, Titanfall, and Battlefield.", "content": "Vince Zampella, a video game developer who has co-created or helmed some of the most popular franchises in the world, died in a car crash on a Los Angeles highway at 12:45 pm Pacific time on Sunday, December 21. He was 55 years old.\n\nAccording to the California Highway Patrol, Zampella was in a car on Angeles Crest Highway when the vehicle veered off the road and crashed into a concrete barrier. No other vehicles were reported to be part of the crash.\n\nA passenger was ejected from the vehicle, while the driver was trapped inside after the vehicle caught fire. The driver died at the scene, and the passenger died after being taken to the hospital. The report did not indicate whether Zampella was the passenger or the driver.\n\nAngeles Crest Highway is a scenic road under the San Gabriel Mountains on the eastern end of LA and is commonly used for Sunday leisure drives. The vehicle involved in the crash was a 2026 Ferrari 296 GTS.\n\nA storied career in game development\n\nEarly in his career, Zampella worked at SegaSoft and Panasonic, and he was the lead designer for the influential World War II shooter Medal of Honor: Allied Assault, which was released in 2002. But it was the famed studio Infinity Ward that turned him into a household name for gamers. He co-founded Infinity Ward with Jason West and Grant Collier in 2002.", "language": "en", "category": "tech", "source": "https://arstechnica.com/feed/", "published": "Mon, 22 Dec 2025 21:35:51 +0000", "fetched_at": "2025-12-23T14:42:42.238391"}
{"title": "Safety panel says NASA should have taken Starliner incident more seriously", "link": "https://arstechnica.com/space/2025/12/safety-panel-says-nasa-should-have-taken-starliner-incident-more-seriously/", "summary": "\"This particular anomaly deserves to be right up front and center for quite some time.\"", "content": "For the better part of two months last year, most of us had no idea how serious the problems were with Boeing’s Starliner spacecraft docked at the International Space Station. A safety advisory panel found this uncertainty also filtered through NASA’s workforce.\n\nOn its first Crew Test Flight, Boeing’s Starliner delivered NASA astronauts Butch Wilmore and Suni Williams to the space station in June 2024. They were the first people to fly to space on a Starliner spacecraft after more than a decade of development and setbacks. The astronauts expected to stay at the ISS for one or two weeks, but ended up remaining in orbit for nine months after NASA officials determined it was too risky to return them to Earth in the Boeing-built crew capsule. Wilmore and Williams flew back to Earth last March on a SpaceX Dragon spacecraft.\n\nThe Starliner capsule was beset by problems with its maneuvering thrusters and pernicious helium leaks on its 27-hour trip from the launch pad to the ISS. For a short time, Starliner commander Wilmore lost his ability to control the movements of his spacecraft as it moved in for docking at the station in June 2024. Engineers determined that some of the thrusters were overheating and eventually recovered most of their function, allowing Starliner to dock with the ISS.\n\n“There was concern in real time that without recovery of some control, neither a docking nor a deorbit could be controllable, and that could have led to loss of vehicle and crew,” said Charlie Precourt, a former space shuttle commander and now a member of NASA’s Aerospace Safety Advisory Panel (ASAP). “Given the severity of this anomaly, NASA wisely and correctly used the safe haven of the ISS to conduct testing and engineering on the ground to analyze the various recovery options.”\n\nConfusion and uncertainty\n\nThroughout that summer, managers from NASA and Boeing repeatedly stated that the spacecraft was safe to bring Wilmore and Williams home if the station needed to be evacuated in an emergency. But officials on the ground ordered extensive testing to understand the root of the problems. Buried behind the headlines, there was a real chance NASA managers would decide—as they ultimately did—not to put astronauts on Boeing’s crew capsule when it was time to depart the ISS.", "language": "en", "category": "tech", "source": "https://arstechnica.com/feed/", "published": "Mon, 22 Dec 2025 21:11:11 +0000", "fetched_at": "2025-12-23T14:42:42.419125"}
{"title": "World’s largest shadow library made a 300TB copy of Spotify’s most streamed songs", "link": "https://arstechnica.com/tech-policy/2025/12/worlds-largest-shadow-library-brags-it-scraped-300tb-of-spotify-music-metadata/", "summary": "Spotify is reportedly investigating how much music Anna’s Archive scraped.", "content": "The world’s largest shadow library—which is increasingly funded by AI developers—shocked the Internet this weekend by announcing it had “backed up Spotify” and started distributing 300 terabytes of metadata and music files in bulk torrents.\n\nAccording to Anna’s Archive, the data grab represents more than 99 percent of listens on Spotify, making it “the largest publicly available music metadata database with 256 million tracks.” It’s also “the world’s first ‘preservation archive’ for music which is fully open,” with 86 million music files, the archive boasted.\n\nThe music files supposedly represent about 37 percent of songs available on Spotify as of July 2025. The scraped files were prioritized by popularity, with Anna’s Archive weeding out many songs that are never streamed or are of poor quality, such as AI-generated songs.\n\nOn Monday, Spotify told Android Authority on Monday that it was investigating whether Anna’s Archive had actually scraped its platform “at scale,” as its blog claimed.\n\n“An investigation into unauthorized access identified that a third party scraped public metadata and used illicit tactics to circumvent DRM to access some of the platform’s audio files,” Spotify said. “We are actively investigating the incident.”\n\nIt’s unclear how much Spotify data was actually scraped, Android Authority noted, or if the company will possibly pursue legal action to take down the torrents. Asked for comment, a Spotify spokesperson told Ars that “Spotify has identified and disabled the nefarious user accounts that engaged in unlawful scraping.”\n\nFor Anna’s Archive, the temptation to scrape the data may have been too much after stumbling upon “a way to scrape Spotify at scale,” supposedly “a while ago.”\n\n“We saw a role for us here to build a music archive primarily aimed at preservation,” the archive said. Scraping Spotify data was a “great start,” they said, toward building an “authoritative list of torrents aiming to represent all music ever produced.”\n\nA list like that “does not exist for music,” the archive said, and would be akin to LibGen—which was used by tech giants like Meta and startups like Anthropic to notoriously pirate book datasets to train AI.", "language": "en", "category": "tech", "source": "https://arstechnica.com/feed/", "published": "Mon, 22 Dec 2025 19:34:22 +0000", "fetched_at": "2025-12-23T14:42:42.595956"}
{"title": "Pirate group Anna’s Archive says it has scraped 86 million songs from Spotify", "link": "https://techcrunch.com/2025/12/23/pirate-group-annas-archive-says-it-has-scraped-86-million-songs-from-spotify/", "summary": "Spotify says it has identified and disabled the user accounts involved in the scraping.", "content": "In Brief\n\nPirate activist group Anna’s Archive says it has scraped the entirety of Spotify’s music library, and plans to release it through torrents.\n\nSpotify has around 256 million tracks, and the Anna’s Archive collection contains metadata for an estimated 99.9% of them. The group archived approximately 86 million music files, accounting for roughly 99.6% of all listens, with a total size of nearly 300 terabytes. So far, only metadata has been released, not any actual music.\n\n“This Spotify scrape is our humble attempt to start such a ‘preservation archive’ for music,” the group wrote in a blog post. “Of course Spotify doesn’t have all the music in the world, but it’s a great start.”\n\nSpotify told TechCrunch that it has identified and disabled the user accounts involved in the scraping.\n\n“We’ve implemented new safeguards for these types of anti-copyright attacks and are actively monitoring for suspicious behavior,” a Spotify spokesperson said in an emailed statement. “Since day one, we have stood with the artist community against piracy, and we are actively working with our industry partners to protect creators and defend their rights.”\n\nAnna’s Archive says it normally focuses on text, like books and papers, but its mission to “preserve humanity’s knowledge and culture doesn’t distinguish among media types.”", "language": "en", "category": "tech", "source": "https://techcrunch.com/feed/", "published": "Tue, 23 Dec 2025 14:51:40 +0000", "fetched_at": "2025-12-23T14:56:33.707163"}
